{"posts":[{"title":"迪瑞克拉神龛","text":"这里是迪瑞克拉的意识深处，世界和思维的残片在这里漂浮，破碎，组合 window.alert(\"入侵成功，开始潜入迪瑞克拉深层\"); let showed = false; var binft = function (r) { function t() { return b[Math.floor(Math.random() * b.length)] } function e() { return String.fromCharCode(94 * Math.random() + 33) } function n(r) { for (var n = document.createDocumentFragment(), i = 0; r > i; i++) { var l = document.createElement(\"span\"); l.style.fontSize = \"40px\"; l.textContent = e(), l.style.color = t(), n.appendChild(l) } return n } function i() { if(showed) { return } let fontSize = c.fontSize; r.style.fontSize = fontSize; var t = o[c.skillI]; c.step ? c.step-- : (c.step = g, c.prefixP < l.length ? (c.prefixP >= 0 && (c.text += l[c.prefixP]), c.prefixP++) : \"forward\" === c.direction ? c.skillP < t.length ? (c.text += t[c.skillP], c.skillP++) : c.delay ? c.delay-- : (c.direction = \"backward\", c.delay = a) : c.skillP > 0 ? (c.text = c.text.slice(0, -1), c.skillP--) : (c.skillI = (c.skillI + 1) % o.length, c.direction = \"forward\")), r.textContent = c.text, r.appendChild(n(c.prefixP < l.length ? Math.min(s, s + c.prefixP) : Math.min(s, t.length - c.skillP))), setTimeout(i, d) } var l = \"\", o = [\"开始骇入\", \"正在获取认证信息\",\"正在窃取超级用户权限\", \"正在破解终端\",\"正在反汇编程序\",\"登陆成功，欢迎来到迪瑞克拉\",,\"hello\"].map(function (r) { return r + \"\" }), a = 2, g = 1, s = 5, d = 75, b = [\"rgb(255,255,0)\"], c = { text: \"\", prefixP: -s, skillI: 0, skillP: 0, direction: \"forward\", delay: a, step: g, fontSize: \"40px\" }; i() }; binft(document.getElementById('binft'));","link":"/cyberblog/2024/01/20/%E8%BF%AA%E7%91%9E%E5%85%8B%E6%8B%89/"},{"title":"琐碎的日记","text":"当代舆论对伤痕文学各有看法，甚至分类上也模糊不清，比如我就不觉得王小波写的是伤痕文学 但​不管怎么说，如果要找个稍微主流的看法，伤痕对农民来说是日常是过去也是当下，对城里小市民来说确实是伤痕，但对这两者外的人，没多少人提，但这些人其实很重要，因为以他们的年纪来说，会在历史上扮演一个很重要的位置，然而，伤痕对他们来说不过是个小插曲，无关痛痒，而很有意思的是，这些人甚至影响到了我，因为相当一部分的这样的人成了我的老师，或者我老师的老师，这也是我看王小波会感到既视感的原因，我在这些所谓的老师身上看到了来自过去的幻影，于是恍惚间我就成了王二究竟是做题这件事错了呢，还是我不够会做题呢？此时我的脑中浮现出汉弗莱那句话“emm,it could go either way,really” 在一切有自我意识的生命体中(windows知道自己是windows，这已经可以算意识了)，电脑是唯一可以信任的，亲人往往会在立场和你站在一起，但有时候会好心办坏事，朋友恋人这种不用说了，随时可能因为一些事离开或者背叛，宠物犬虽然忠诚，但很多命令听不懂，难以管教​总而言之，电脑是唯一有智能还能完全听从人类话的意识体，排除可能性较低的硬件错误，电脑会忠诚执行人的一切指令，永远不会背叛(当然，也有黑客这种窃取使用者权能的，但这点不能怪电脑)，这种绝对的忠诚，服从以及掌控，正是我所追求的​从这点上说，我超越了世界上所有暴君雄主 当我看到挂科通知的时候，我尚在执迷不悟，这就像高僧的当头棒喝“为何执迷不悟?！”于是我冥思苦想，愁眉苦脸，想了几天，终于悟了，就像那段著名的对答“菩提本无树，明镜亦非台，本来无一物，何处惹尘埃”​总之，我相信存在一个由数学，公理以及二进制计算机构成的净土，人类永远无法到达那里，但可以用泰勒公式一样的工具去拟合，如果一个人的目的是到达那里，就不能纠结于莫名其妙的人情世故，纠结于这种混沌系统也没什么作用，除非你能给他建一个计算模型——听《omen》有感 我高中很喜欢看书，对此我的想法是这样的，我这么聪明，大学肯定全在看理工科理论，或者做理工科研究，所以现在应该看点人文综合一下​然而事实是，大一大二我全在学一些莫名其妙的人文玩意，导致之后的时间我需要全部埋头于理工科来中和那股恶臭的穷酸书生味​可见只有最优秀或者运气好的人才能做好中长期规划，想来当时的我还是naive 我小时候非常善良，或者说有一种朴素的是非观，有篇小说写的是一个小姑娘去上学，每天都要被领居家的小孩扔石头打，因为他们家没钱上学只能放牛，非常嫉妒有学上的人，当时我看了很气愤，自己不上进还不让别人上进，怎么会有这样的人呢？​现在我对这件事的看法可谓大为不同，不过这倒不是我变得更善良了，只是我逐渐理解了选择善良到底要付出多少代价，从而变成了沉默的大多数，这就是说，我可能变得清醒了，但更冷漠了，不过鉴于随着年龄增长，选择善良的代价往往是增大的这个事实，我觉得这也没什么​总之，这样一来唯一的问题是，由于我小时候接受的都是价值观的判断，没人告诉我选择善良对应什么行动，导致我产生了一种空中楼阁式的善良观，马克吐温说，没有什么比没有火炼过的道德更脆弱，就是说的这种情况换而言之，要么我承认小时候的自己很虚伪，要么我承认现在的自己自甘堕落，这就很让人进退两难 我的一个朋友，他上小学的时候经常考试，考试就要把成绩告诉家里，这时他就很不厚道的报一下考得不好的人的分数作为对照组，这时他的母亲就会说，不要和差的比，跟好的比，这个逻辑还有一些变种，比如说不要和差的玩，和好的玩​这种观点颇有一些道理在，可惜他很晚才想明白，比如一个winXP机要和dos打交道，那么dos倒是很幸福，什么都不需要考虑，xp就得麻烦，要考虑非常麻烦的兼容问题，但xp和win11打交道呢，那就反过来了，所以总的来说，这是一个工程上的兼容问题，至少他现在是这么理解的​当然，伴生的问题是，人可不可以被当作工程学问题考虑，这点我还没想明白 现在我每挖掘出一款old school式的老剧情游戏，当然主要是avg和rpg，就得被上世纪的日美欧文化产业震撼一下，因为往往能顺藤摸瓜找出一大堆有类似品质的，流传至今的作品，这样的游戏现在可能一年只有一两个，有时候还颗粒无收(对我而言)​当然，如果我们用客观的历史视角去看待这个现象就会知道这是附属于发达国家的一些经济特征以及当时的技术条件的，尤其是后者，你可以从现在的业界看出来，并可以很容易地意识到这点——上世纪在屏幕上显示文本并不比现在做同样的事难到哪去，但其他方面就差得远了，因此当时的厂商只能卷文本，而现在当然也有人做文本，但当时被逼着只能看文本的玩家现在就不鸟他们了​对叙事游戏的未来我并不是一个悲观主义者，前人创造了很多奇迹，但他们依旧也有更宽容的市场与更多的机会，这并不意味着他们多高明，只是历史走到了那一步 设想有一天我突然失踪了，可能失踪前还念叨着什么旧日支配者苏醒，什么群星之夜将要到来之类神神叨叨的话，我的个人遗物中留下了一个笔记本，上面有若干提示词，仔细看一下我的档案就能得到一串数字，这是我电脑上的加密硬盘密码，顺便一提这个硬盘(其实是个虚拟或者说逻辑硬盘，没有对应的硬件)使用的是当下最先进的加密算法，且密钥足够复杂，把太湖之光调过来都未必能破解。这个硬盘内部有我的部分调查笔记，以及我之前匿名购买的一个服务器的普通用户密码以及ip地址，这个调查员远程连接上了服务器，随后他就要寻找一个关键的git仓库，仓库里有几百万条甚至更多文本记录，调查员需要用之前硬盘里提到的一些关键文本写正则表达式来匹配唯一的一行，这是git仓库的某个历史提交的哈希码，且因为刻意这么做，只可以通过这个哈希码来访问。随后他会在这个历史提交里找到我的root账号密码，他可以在root目录里找到一个数据库，里面记载了一些黑暗的失落秘密，也可能是个愚人节笑话。总之，这个游戏似乎很有意思，我甚至把流程可以做得更复杂一点，虽然我怀疑只有我这么想 月之都认为，只要生命存在，就会产生污秽。对此我是这么理解的，再厉害的系统，也未必能几百年开机不出问题，一个没有外界输入的系统终将走向混乱，因此月之都用某种方式留住了自己的秩序性，让自己陷入“静止”，这可以这么理解，月人对自己进行快照，并定期恢复，这种快照式的备份可以通过分布式存储之类的存储技术，将数据丢失的可能性降低到无限接近零，这样一来这样不断备份恢复，就可以在一个局部系统内实现几乎纯粹的洁净​在月人看来，地上之人如同在用算盘或者数筹的原始人，无时无刻不在积累错误，当积重难返时就会死去，但作为地上之人应该怎么看待这些月球背面的住民呢？地上之人会有一日像月人那么生存吗？ 如果所有人都守规矩，第一个不守规矩的就可以得到天大的利益，如果所有人都不守规矩，所有人都会受损，所以长期来看，这个系统要么达到动态平衡，平衡的双方是维护规矩一方的力度与破坏规矩的收益，要么达到一个守规矩再也没有用的临界点，彻底成为丛林社会​所以如果是你绝对理性与自私，就应该主动去违反那些执行力度很小收益却相对大的规定，比如没人看的时候在监控死角偷吃超市的东西，那么多人都在当坏人没有被惩罚，多你一个有什么事呢？ “所以，猎杀自己的造物是什么感觉，就像父母杀死自己的孩子?”​“我雇佣你的原因之一就是我不忍心亲自做这事，还有个原因就是我没有体力去追捕他”​“好吧，我该怎么找到他”​“我没法告诉你具体位置，追踪器被他发现并拆掉了，但好在我对他的过去做了足够详细的记录”​“所以?”​“所以我可以对他建一个详细的行为模型”​“但他知道你对他的了解程度”​“当然，当然，这就是为什么我留了最关键的后门，我抑制了他和群体性有关的特质，加上他卓越的个人能力，这会让他不受控制地表达自己，也就是说，你可以轻松的从人群里认出他依我看来有以下几种可能他选择的地区时局混乱，因此他很可能占据一个根据地，并建立一个武装强盗团伙来满足自己的权欲又或者他更加谨慎，选一个地方低调的藏起来，但他无法长久地压抑欲望，必须定期进行某种暴力行为，因此这个藏身处必定视野开阔，便于物色猎物，我建议你留意类似的地方”​“听起来，你的造物是个定时炸弹，他的一生不过是自我毁灭的过程，不过这倒不关我的事”​“去干活吧，佣兵” 圣经还是什么说，一个人要么侍奉上帝要么侍奉玛门(玛门是某种财神)如果认这是一种二分法，那么上帝是高尚的，玛门是庸俗的，所有人必须二选一，但客观地说这可以细分下去，比如一个人假装侍奉上帝，其实侍奉玛门，这种人倒是不少，还有一种人假装侍奉玛门，实际上侍奉上帝，这种人非常稀少，某种意义上，比言行一致侍奉上帝的人还要伟大 我的一个朋友，他上小学的时候经常考试，考试就要把成绩告诉家里，这时他就很不厚道的报一下考得不好的人的分数作为对照组，这时他的母亲就会说，不要和差的比，跟好的比，这个逻辑还有一些变种，比如说不要和差的玩，和好的玩​这种观点颇有一些道理在，可惜他很晚才想明白，比如一个winXP机要和dos打交道，那么dos倒是很幸福，什么都不需要考虑，xp就得麻烦，要考虑非常麻烦的兼容问题，但xp和win11打交道呢，那就反过来了，所以总的来说，这是一个工程上的兼容问题，至少他现在是这么理解的​当然，伴生的问题是，人可不可以被当作工程学问题考虑，这点我还没想明白 如果把现在的我送到我的小学刚入学的时代，并全天候负责他的教育，凭我的资质和自学经验，就可以轻轻松松地让他在小学学会初中知识，初中学完高中知识(文科除外)，然后我就把世界是不公平的，努力是未必有用的这些事先告诉他，让他自己决定是继续卷，还是普普通通地度过一生，如果是后者，我也可以在高中就开始教他谋生技能​在这样的情况下我要么取得远盛现在的成就，要么轻松地找个说得过去的工作，但这种程度的师资实在是天方夜谭，只有谷爱玲这种家庭才有可能，所以这种二代取得什么成就我都不奇怪 搞前端网页特效就像在商场买衣服，挑花了眼最后选了一版，回头想想感觉也没那么好看，但时间(对买衣服来说是钱)已经花了，还能怎么办呢​不过幸好我有勤git的好习惯，想回到初版敲一行命令就行了​但话说回来，选择会让人犹豫不决，就像我也可以直接维护两个不同样式的分支，再写个按钮用来切换，虽然这种行为多少有点无聊，总之，博客这种事自己开心就好，就像装修除了承重墙可以全拆了，我可以按心情一天换一版，又不会有人打消协电话投诉，我唯一的顾虑就是玩这个格调太低了，被同行知道得被狠狠踩头，打成前端仔永世不得翻身 我很喜欢这样的结局，所有谜团都已经揭开，所有线索都交织于此，要做的只有收尾，这是通过某个固定流程的仪式性的流程完成的，而参演的所有人都对剧本烂熟于心​这样的结局就不会有任何仓促之感，可以让人精心欣赏接下来上演的终幕 学习作为一种商品和其他商品有什么不同呢？首先它是虚拟的，最终结果只体现为一些考核结果，比如考证和考研分数，但和电视剧电子游戏之类的虚拟商品不同的是，学习是近乎纯粹功利的商品，没有多少成年人会觉得学习是为了陶冶情操，提高修养云云，成年人去学习，一般只有一个直接目的，提高自己的劳动能力，而至于最终目的也很明显，目前劳动力的唯一出路就是在人才市场上卖钱，所以可以说，学习是为了赚更多钱​即使在看似发达的美国，nerd这种不为了钱就是喜欢学习的也被视为怪胎，美剧经常极尽嘲讽这些书呆子，原因很明显，学习对绝大多数人来说就是痛苦的，而nerd现象要么是特殊基因，要么就是某种精神创伤，总之这种极少数统计上可以忽略​由此可以继续推理，各种辅导机构，打卡app卖得这么火热，说明消费者觉得学习带来的增量可以覆盖在学习上花的钱，但这是个脆弱的推论，没有考虑到孔乙己这种学了也没用的情况，如果这个预期崩塌，这种学习的热情就会迅速退去，留下一地鸡毛 我打算哪天模拟一下应急情况，比如说发酒疯把我的生产环境全删了，或者直接把我的硬盘砸了，这听起来是灾难性事件，但其实也没有那么糟，首先我的windows和linux都有系统镜像存在云上，如果忽略这点，重要数据我也做了多地备份，而生产环境呢，代码我基本github上都有一个备份仓库，安装过的包名也导出过存到github上了，到时候我只要写个脚本一个个装过去就会恢复了,只可惜了应用程序和游戏，不过现在比较商业的软件都会把用户配置存自己的服务器，所以除了装一遍很麻烦也还好。 如果有人发帖说自己被强奸了，比较虚的回应是不要在意过往，向前看吧；比较实的回应是心理治疗要多少钱？我来出。但如果回答下次遇到强奸不要慌，只要温顺一点强奸犯就不会太粗暴，这种回应就很让人难受，但这确实是常态。 保尔捍卫的红色政权最后化作回旋镖打了回来，导致他那段著名的话语也被人嘲笑​对于不应该带着悔恨闭眼，我和保尔有相同的态度，但保尔相信一个很可能会改变自己本质的政权，而我则相信着标准永不改变的科学和技术，瓦特，特斯拉，爱迪生，这些名字在现在也脍炙人口，因为改良后的蒸汽机，电灯泡，交流电网都是当时特定条件下的最佳实践，如果要我捍卫的是一个政权，我就不会这么坦然了，谁知道我做的决定在日后看会不会错得离谱 如果有哪个家长向我请教怎么让小孩玩不了游戏，那倒是很容易做到，我可以用户权限控制，硬盘加密，就是限制上网比较麻烦，我总不能手写个墙出来，最多放几个白名单端口号与ip号，只能上部分网站，但也不是绕不过去，总之，如果强制离线的话，限制起来不是不可能，除非这小孩还会自己买个移动硬盘再装一个系统​不过这么做其实没什么意义，打游戏的习惯可以让一个小孩早早学会盲打，学会键盘鼠标的用法，windows的常见操作，.net等常见运行环境，如果打老游戏，他可能还得学一下什么是虚拟机或者类似的虚拟化技术，这些能让他知道电脑能做到什么，并对机箱里面有什么魔法感到好奇​所以如果有人找我做这种事，我就会枪口抬高一厘米 等以后机器人编程普及了，我就买一打功能简单的机器人，什么都不干，专门给我磕头，早上起来磕一个，洗漱再磕一个，吃早饭的时候恭恭敬敬磕大头我要试试权力到底有没有这么让人着迷 魂类的末世开局，也就是主角从一片废墟里醒来开始捡垃圾，有很多优点，但总的来说，我不喜欢这种太侧重氛围而没有内容的叙事，如果是我就会多放几个角色，让他们要么互相算计，要么为了各种原因互相杀戮来创造一种复合了天灾与人祸的末世感，不过这好像是另一种类别了 我高中很喜欢看福赛斯，这小子是冷战遗老，对整个泛左翼都很敌视，但他的小说还是引进国内了，说明也没有人和过不去​但抛开意识形态，福赛斯对计划与执行的阐述很有意思，他在写作中会把所有细节事无巨细地列出来，但对于怎么制定计划，他认为越长远的计划就越要模糊，因为变数太多了，往往需要随机应变，这么说好像很模糊，但其实是这样的，反过来说越短期的计划就可以越具体，所以说福赛斯设想的模式是关卡式的，面对一个具体的小任务，就应该设想多个精确的短期计划来完成，实在不行了再随机应变，而长期计划，就拆分成若干可能的关卡，要是发现拆得不对再随机应变，总之，最终都需要转化成精确的计划，只是长期计划会需要额外的多个模糊节点​当然这些都是最后完成了的计划，小说这种虚构产物就特殊在主角都是不怕死的好汉，从来不想这活干不了了怎么保命，但我还是怕的，所以在福赛斯的基础上我还要加一个最差预案 大部分老祖宗的智慧我都嗤之以鼻，但有几句我很喜欢，比如庄子那句圣人不死，大盗不止。这句话就让我想起谭浩强谭圣，还有他的c语言红宝书，当然c语言是非常厉害的一门编程语言，封神也不为过，但谭圣就是写了几本教材，着实没必要给他封圣，但谭圣还真就成了中国c语言之父，有着无数孝子贤孙。我看这就不是圣人，这是大盗，问题是大家还真认大盗为圣人，这有什么办法，只有两种办法，一个是把大盗揪出来关起来，一个是不承认任何圣人，前者其实远比后者难，所以只能消解任何神圣，c语言没什么了不起，汇编没什么了不起，linux没什么了不起，学生喜欢哪个学哪个，这样就不会有大盗了​当然私下里，我还是觉得linus是圣人，windows的工程师是圣人，他们的技术水平我一辈子也达不到，但为了避免大盗的出现，我就不能光明正大地说他们多伟大，这也是没办法的事 维护这种事务有若干特点: ​1. 定期就可以去做​2. 可以拖一段时间，但迟早要做​3. 成功概率相对较大​4. 就是出错了，也很大可能不是自己的锅，可以发帖去骂开发商/客户​5. 如果实在万劫不复了，总可以回滚，如果硬件坏了就重买，总的来说不至于完全做不了​基于以上特点，我觉得维护还挺有意思的，就像有的人可能会喜欢做家务一样…… 世界在我眼中越来越像是数字信号，模拟信号编码解码的原料与产物，这让我怀疑是不是在这条路上走得太远了，就像是克苏鲁神话中到处寻访禁忌知识的民俗学家 每次回老家，总是无语老人家里冰箱塞满了过期菜​其实我这代人也有类似的心里缺陷，一旦做不到其他人能做的事就会无止境地恐慌，本质上这两件事差不多，对我来说这种情节的后果是大脑里塞满了未必多大用的知识​这像是非理性的恐慌，但也像是习惯性地对未来的预演，可能每一代都觉得未来会和小时候一样，在信息未必充足的情况下，这种假设也未必是错的…… 如果我在高三，听说xx中有人跳了，会作何感想呢？​我觉得应该不会很高兴，这可以说一方面我良心未泯，觉得靠献祭生命来提高排名这种做法不值得提倡，另一方面可能比重大点，我比较倾向于悲观，就算这个xx是重点中学的，他的省排名也未必比我高，要是比我低那他的死活和我就没什么关系了​这时比较理性的选择是对排名比我高的人大肆宣扬这件事，告诉他们还是命重要，别那么卷了，然后我自己回家偷偷高强度做题，不过我还是不太想做这种事，或许是真的还有点良心吧 虽然学生阶段几乎没有项目需要版本控制，但一片绿的提交记录还是令人神往，其实这说明不了什么，你完全可以注册个系统服务，一开机就在仓库里随机写入几行，然后push，这样什么也不做也能全勤，但总是这样，无聊的虚荣心总之，往好处想，再过几个月我就可以截出一张全绿瓷砖图，然后大家就知道至少我不是什么培训班战神了 失宠的倒数第二句话“别忘了我”，不是“别死”，也不是“别去”，而是别忘了我总有人相信记忆的力量，因为如果无法相信记忆，那么整个意识体系都会倒塌，然后陷入虚无主义的永恒折磨这就是为什么我需要创造里格，永远需要一个记录下来故事，对抗虚无的人，不管是作者还是读者都需要证明这个故事存在过，并且可以继续存在，我觉得没什么人想看一个最后结局是“哦，还好只是一场梦”的故事但里格还有一个有趣的作用，如果记录者记录自己的记录，那么这就产生了嵌套，如果他不记录自己，那么他就没有记下全部真相，这可不客观，一般来说正确的做法是多方求证，但除了推理小说，没什么愿意看一堆视角然后推出矛盾…… 回想the longest journel 的开头还是很惊艳的，我当时以为这会是一个精彩的多线交织，时间线像有向图一样混乱，最后收束到开头的那种炫技故事，在结局后回望这个开头，必然会感慨万千，原来一切早已注定然而结局完全不是这么一回事，与其说这个故事的主题是时间，不如说是空间，开头那段成了之后也没填的坑……总之，不能抱有太不切实际的期待 操作系统课会讲文件系统，讲分区，分区表，引导，bios，甚至可能提一嘴uefi，但肯定不会讲怎么做启动盘，怎么做系统镜像，怎么一步步给硬盘分区（当然除了运维这技能应该很少用得上），这道理上没错，理论上讲你操作系统学得好的话可以把做这些当课设作业​但有现成的成熟解决方案为什么不用呢，反正在课上教也就是提一嘴的事情，可能有人说流行的工具会变，这是废话，难道每年的课就要一模一样地上?几十年前的ppt原封不动地用​总之，工具羞耻这种情结属实没什么必要，除非你指望给人装系统赚钱 日本的文字游戏业界实在有不少天才，在我看来这种日式编剧有一种奇妙的从文字，并且只从文字构建故事的能力，这和欧美游戏是完全不同的​同样以文本量巨大著称的一些欧美rpg,avg往往有着同样地位的美术形象，比如说经典的巨龙，骑士这种画面，还有痛苦女士之类的经典屏幕形象，这些不是纯文字的，就像三国演义，关羽出场先说他面色若红枣，再写其他方面，而日本游戏，而且只有日本，能出现扎堆的以文本为第一公民的优秀剧作你可以说只是因为日本要比欧美穷，做不起画面，但事实上，文字也有一种独特的性质，也就是可以极大触发读者的想象，利用这种特性还真能实现奇特的叙事效果，像428这种名作，几十万的销量也不是假的这着实是一种耀眼的成就，也是为什么日式avg存活至今，在流行文化里还有极大地位 马克吐温有篇很有意思的短篇，写的是一只小鸟活着的时候无人问津，死后，他的主人（小孩）为它举行了一场盛大的葬礼，所以有个无名的画家效仿这个故事，画了一堆乱七八糟的画然后假死，靠卖自己遗作发财​这件事看上去很荒诞，但原理很现实，人在饿不死吃不饱的情况下创造力最强，这就是为什么很多”第二部”是巅峰，第三部就一般了，所以他的读者，如果够理智的话就要在活着的时候冷落他，让他源源不断地创作，等死了就没有这个限制，可以尽情吹捧了，还有一个原因是盖棺定论了比较安全，作者也不能跳出来说我的意思不是这样，你理解错了，总之，如果创作者死了，他的作品就开始脱离他自己，也不再与其利益挂钩，可以被众人拥有，这样就更适合作为商品推广了​当然，想找个合适的时候死掉不那么容易，现在假死也不像以前那么方便了，最多失踪超过法定期限来认定为死亡，大部分创作者只能等着自己跌下神坛 我不知道我妈有没有我刻苦，但她高中学的肯定没我深，为什么我敢这么肯定呢，那当然是因为我在全国最厉害的教育大省之一江苏，的重点中学（容我自夸一下）上学，高薪聘请的整个教师团队，和市场上丰富的教辅资料，都为了我们这辈人服务，也就是数以万计的高中老师对高中那点知识点出了几十年题，而我系统性地练过至少几千道，这就是我和我妈的差距，我高三做的那些怪题难题，她当年怕是梦里也没见过这件事的意思是，会吃苦没什么了不起，吃的什么苦更值得探讨，个人的努力在时代面前不值一提，设想现在一个和当年我妈差不多的农村考生，他怎么和我比，他没有学历至少211起步的一堆老教师作为后盾呀，最多买点资料半懂不懂地写，而我的学校还远远不是最好的，这就是说，这个假设的农村考生很有资格恨我，但这样说值得他恨的人就太多了总之，这就是时代或者说宿命，我们这种谦卑的小羊羔只能默默接受 或许在另一个if世界线，以我的游戏阅历，全职的话应该已经是小有名气的自媒体了，是否比我现在灰暗的处境更好呢​虽然这种自夸的话不符合我一直受的教育，在我看来大部分游戏媒体的评价水平都极为肤浅，缺少精确理性的探讨，也就是说不仅是基于现象的归纳法，由因溯果的演绎法也很重要，要是我的话就能做得更好，虽然可能不会太有人气​但总的来说，问题是这样的，现在的时代看似有很多职业选择，但当通才的想法是极其愚蠢的，各行各业在发展的时候就会接触到能轻松掌握的各种表层技能，因此，所谓的职业级水平必然有相对长时间的准备才能达到，也就是说当通才要付出的必然不是只学表层部分，要做到和专才差不多才行，这样一来就有不止n倍的成本，职业市场会愿意付多于n倍工资吗？​因此，哪怕你20出头正值年少，你也不能找几条路一起走，明明有过机会，也有自信，但无法尝试，这着实是一件悲伤的事，在可预见的未来，这样的事也会无数次地发生 由于一个引人注目的反派是商业成功的一半，因此也会有一些常见的模式，比如说言行浮夸，雄辩家一样地推销自己的主张，典型如jojo的dio,无主2的帅杰克，这些是正面典型，无主3的邪教姐弟就是反面关于这种反派，嚣张是第一层，纯粹用来引人注目为什么要引人注目，是第二层，一般来说是推销观点，也就是重点是其具体主张，dio是那套安心感学说，帅杰克要搞他的精英主义，这些勉强还说得过去，能理解，不能说一点对的地方也没有，还有不少受众，邪教姐弟比较难绷，纯为了自己，那对这玩家一个劲喊我要当卡密就非常啰嗦且无用第三层就有点水平了，可以作为角色其他侧面的引子，一般来说这种表演型人格都是因为人生某个阶段缺少关爱（一般是童年），比如dio骨子里都是个自卑的小混混，所以顺风话痨，逆风就狼狈不堪。莉耶芙没有母亲的关爱（你支配者还需要这个?）所以天天推销自己的魔改童话，想要被认同自己的创造力。帅杰克是因为丧妻+事业不顺第四层属于可选项，不一定加分，就是邀请读者来直接和作者或角色对话，反驳或者接受其主张，例子比较少，我印象里只有jojo7大总统那句“吾心吾行澄如明镜”，在我看来这个场景很明显是对读者的设问，因为荒木并不想直接判断大总统的对错，这种设问，用得不好就有夹私货之嫌，必须慎用此外也有些其他用法，比如推理作品里用来转移对真凶的注意，这里不赘述 寒蝉里虽然是温暖校园，海猫里却有不少校园80的描写，直接原因可能是乡下和城市教育理念的不同，不过这里不论这个学校里不会教，但小孩总能无师自通地学会拉帮结派，孤立异类，这一直是人性本恶说的力证，而我的想法是这样的，相比成人小孩没有成型的道德观，也就是其行为分布，如果以普遍性的善恶为轴，更有随机性，如果这样的话，小孩总体上的善恶很大程度上取决于小孩能做到的事中善恶轴线的各自占比这样一说，虽然很难统计，但善行由于普遍更有秩序性，因此更稀有，这样的结论应该是符合直觉的，所以儿童有更大可能做坏事更多，但教育（主要指获得知识），能让儿童加深对世界和道德的理解，也就是可以加速消融随机分布，让其行为模式收敛到一个固定的区间，但收敛到哪个区间则会收到非常多因素的影响总的来说，我的意见是人性的善恶偏向是需要经过收敛才能确认的，在此之前则取决于善行恶行的比例这样的推导和胡说八道没什么区别，只能博人一笑 游戏的游戏其实已经很多了，推理的推理我也见过一些，这两个概念看起来很吓人，其实宏观说一群游戏宅或者推理迷聚一起聊游戏或者各种推理作品就能满足定义，所以用稀有题材绝不等于写得好​但喜欢这种递归定义的人，要么是兴趣比较浓厚，要么就是爱好挑刺这种商业上不好对付的存在，所以作为元xx出名的东西，基本都很厉害，当然元编程也很厉害，虽然我是学不会…… 制作者和玩家可以在现实对线，但如果在作品里用作者的口吻（比如旁白）嘲讽做了某个选择的玩家，且玩家没有反驳选项，这就是不公平的战斗了，如果实在有制作组想这么玩，我建议是放到通关后，或者换位思考，提供一个”“你有什么资格审判我”的选项 rpg主角的常见病： 失忆，某种意义上的主角标配，就是开头没说失忆的，也可能在关键处想起来什么重要的事情然后开始逆转 幻觉/幻听，悬疑题材的高发病，有时候能搞出颠覆主角善恶立场的狠活 人格分裂，经典中的经典，不多谈 表演型人格障碍，未必算病，以过分感情用事或夸张言行以吸引他人注意，刻板印象来说日本游戏的高发病 躁狂症或者反社会人格障碍，一些以自由度为卖点的游戏主角标配，简单地说就是大西王转世 频发的头疼，原因可能很复杂，从脑子里进了芯片到古神低语都有可能 以上都是精神疾病，其实也有身体性的： 关节疾病，体现在几十厘米就会摔死，或者几十厘米的台阶爬不上去 身体协调能力低下，体现在走路一定比正常人慢，要跟别人一起行动必须走一会跑一会 耐力极其低下，体现在跑几十米就开始喘气，部分游戏可能是因为装备比较沉重(迫真) 每次扁桃体炎我都要经历一系列症状，其中最痛苦的莫过于头疼，这是因为其他症状只会让你觉得身体不行了，如果涉及到头部，就会怀疑脑子也不行了​即便如此，我也很难描述这种痛苦，这种症状让我无法长时间思考，正如小波劝他侄子说的:他人的痛苦才是艺术的来源，如果你自己也很痛苦，哪有力气去描述痛苦，小波虽然是知青，但也不是农民，所以回城了就有力气写农民的苦，按这个逻辑来看，如果我想写出传神的病痛，就应该当医生而不是病人，而且最好是有后台的医二代，因为规培也很痛苦 对我来说游戏荒不是绝对没有游戏玩了，而是要找下一个游戏要么得忍受几小时的寻觅和试错，要么就得接受一下争议作或者67分的作品，这些事情麻烦到一定程度的时候我就会放弃，也就是直接一阵时间不打游戏，等积蓄起力量或者找到一个新类别后，再投入玩家状态 想到一个有趣的笑话，如何快速破解打越大部分谜题——让游戏中所有“主视角”的人物拥有一面可以随时使用的镜子，并且镜子中必然会映出这个视角的主体的脸，没有幻觉的可能性，玩家也可以随时查看 剧本在空间上必然是一个序列，也就是字符的流，时间和逻辑上则可以有无数种结构，一些结构精巧的剧本，例如无限循环，到达终点后又迎来开始，又或是完全的交错，a最后到达了b，b最后却到达了a，这样的剧作是高度秩序性的，完全脱离情节也相当优美，事实上这种结构精巧的剧作，往往情节就是弱点​反过来说也有情节强而结构弱的，但这些都不过是单层，剧作可以递归定义，剧中剧可以无限套娃下去，递归中如果传递的参数不同，也会有不同的结果，甚至层与层之间没有顺序要求，循环的结构里可以套一个线性的剧中剧，这个剧中剧可以是循环的诱因，这样某种程度上就能结合两者的优点，反过来说，写作的难度也是逆天级别的大，只有寥寥几部作品能稍微让我感觉到这种惊喜，不如说一辈子见过一次就值了 众所周知，玩家视角不等于主角视角，用海猫的比喻，玩家是棋手，角色是棋子，棋手可以随意操控棋子，但必须在棋子的行动规则内，也就是说玩家不能做角色没有可能做的事但这个规则不那么严谨，就比如猎魔人这样的改编游戏，原作杰洛特是个日漫主角一样的老好人，很多任务都不可能拒绝，但游戏又不能不给个拒绝选项，这种无法rp的地方不胜枚举，这时候玩家只能忍一忍，自己设立规则防止ooc像bs就比较讨巧，披着鬼畜系的皮，玩家进来一看，无限轮回，全npc可图，这下可以不当人了，你看这个鬼畜不死人，全地图图图这种事也不是干不出来，这下轻轻松松rp了。但打到真结局就麻烦了，原来这格林脑子有问题，按法律来说都未必有行为能力，rp恶人很容易，rp⭐瘾患者也不难，rp多重人格的精神病人就难办了，严格来说非精神病玩家可能扮演的是当前时刻的主导人格，因为正常人怎么也不可能在脑子里天天开会，这虽然不是什么大问题，但对扮演感来说也是个麻烦 人这么多，又发展了这么多年，根据大数定律，好摘的果子全摘完了，获取世俗意义上成功的概率已经趋向稳定的低了教育年限已经延长到了现在的十几年还不够，几乎耗尽了脑子能使的整个青少年时期想要荣华富贵只能赌极低的概率绝大部分选择稳定，这种稳定的选择抹平了投入产出比就像现在喜欢说一线永远有人，一线房价永远涨，明年就起飞但炒房子的时候一线的前景就没有算进去吗？每个循环都会把之前的数据和预期纳入计算，计算的结果必然越来越稳定如果有新模型，ai，算法，芯片，也必然是难摘的果子，因为人太多了，好摘的不可能还留着，但与过去不同的是，这些都需要大量的生产资料和资本投入，个体为单位是不可能进去了 我一直想写一个镜子大师式的人物，但很难想到超越石之心的立意，问题是这样的：“灵魂可以卖吗？“这是个经典问题，政治正确的答案时无论何时都不应该卖掉灵魂，但如果对一个穷到快饿死的人说，我给你吃不完的食物，当你死去后，就会在地狱永远收到折磨，这个穷人为什么不该答应？欧吉尔德如果不召唤恶魔，结果就是挚爱被夺走，自己家道中落，很可能在乱世里作为无名小卒死掉，但通俗地理解石之心的这条主线：和恶魔做交易可以得到财富，权势，可以永远和爱人厮守，但得到这一切后的麻木，以及对失去这一切的恐惧，这些痛苦之处加起来远远超过作为无名小卒死掉的痛苦，也就是说和恶魔做交易是必然亏本的目睹了这一切的玩家就可以把正能量打在公屏上了，不过鉴于目前在现实中根本找不到恶魔存在的证据，想要作为道德说教还得找个比喻，例如借高利贷之类的 有一种典型的be或者ne是：奋战后什么也没有改变这个类型也有细分，比如最后虽然功败垂成，但主角得到了救赎，这种属于be中的he,还有最后不过是回到了原点，这种是ne，还有奋战后结果更差的，这种属于搞人心态的be中的be第一种其实还挺多的，例如jojo6，当然新世界大概也算改变……第二种的例子是jojo7，最后乔尼不过是回到了原点，或者极乐迪斯科，到头来除了金的友谊，不过也是回到糟糕的原点；以及东方年代记的te，从幻想乡的毁灭回到幻想乡的诞生，而且这两者其实是一回事第三种例子就很难找，个人观点me3的绿光结局应该算，全银河系变成融合怪，还不如毁灭了；又或者东方年代记的ce，苟延残喘还不如来个痛苦；蝴蝶效应应该也算，或者说蝴蝶效应的结局很难这么分 我高中很讨厌记笔记，原因主要不是我字太丑被老师骂，这种事我已经习惯了​手写笔记是一次性的，增加容易，删改非常难，以至于复习的时候看新学阶段的笔记感觉太幼稚啰嗦，或者理解有偏差，只能再开一版，这种流程要无数次重复下去，非常低效​而博文是不同的，我可以无数次修改，借助git还能随意版本管理，不喜欢md用latex重构一下也无所谓，就是编译花点时间，因此复习笔记可以复用新学时的素材，大刀阔斧地删改和复用，只要自己看得懂就行了，就算md没那么多功能，我想的话完全可以拿出latex写一篇论文一样格式的笔记，虽然完全没有必要，还可以链接多媒体素材​总之，高中我要是会用hexo这种工具，就各种意义上方便多了 比起更主流的善恶对立，我其实更喜欢巫师三或者黑岛生软做的老rpg里的阵营对立，没有哪个阵营是绝对正义的，不如说主角都有可能是邪恶一方，dao的沃顿可以打着大义的旗号烧杀抢掠，因为拯救世界确实是最大的名号，这种体验其实是很新奇的，因为在世界毁灭面前，任何作恶都微不足道，作为救世主，功利地看，为了救世，就是献祭50%的人换取力量都是相对正义的……但绝大部分救世主题材作品都不敢这么编相对没那么自由的巫师三，杰洛特也可以做冷漠的旁观者(虽然原著里毫无疑问是个老好人)生活的故土被敌国入侵了，为什么猎魔人要无动于衷？首先，北国的统治者也不是好东西，其次，猎魔人早就被北国官方抛弃了，法师和猎魔人一起被敌视，尼弗迦德至少还有晋升的通道，因此就算人间惨剧在猎魔人的面前发生，也有正当理由无动于衷也就是说这种rpg会给个正当理由让主角可以选择阵营，或者不选任何阵营，而善恶则是完全无所谓的，虽然老黑岛不知道怎么想的会给秩序善阵营一些属性奖励以表示鼓励当然，这种利己主义很不政治正确，也可能写成小学生式黑深残，但是善恶对立我看得太多了，太腻了，阵营对立还没到让我腻味的程度 同人游戏在现在是个式微的说法，当然定义也从来不精确，例如东方是非完全商业目的的游戏，这很明显，zun绘放那个年代应该也没什么人觉得是美少女游戏，而且对当时的zun也就是做着玩玩但是现在数字销售普及，dlsite,steam这些平台上的邪典游戏算不算同人游戏呢?首先这些游戏很大程度是为了卖钱，然后呢，鞋垫元素又不是那么商业的存在，现在火的是什么，那还是废萌，千那什么万那什么都几十万销量了，但bs1为了真结局要把所有队友图图了，受不了这套的人买了不得“rnm,退钱”，但也不能说这就完全不商业，黑深残的受众也是有的，而且看上去画技要求还比废萌低…… 大概以09的dao为界限，3d游戏达到了一个现在玩也不错的程度，但更往前的3d游戏就有非常多的对当代玩家来说的反人类设定，而世纪之交的2d游戏，虽然现在看比较简陋，但因为有上帝视角，网络有详细攻略，以及可以比较容易地重置一下高清材质，对我来说玩起来比那些最初的3d游戏舒服 很佩服杯赛能把lore做的这么艰深晦涩，我看了猎魔人原著觉得自己已经是猎魔人世界懂哥了，滚五我把所有书籍看了一遍，还是没搞懂这些lore在讲什么，就说魔幻作品里最基础的谁最能打问题都搞不懂因此好长时间内我对滚五敬而远之，和猎魔人粉丝吹水我可以寒暄几句，威爷人类最强，必秒菲丽芭，法兰茜丝卡单手扫死威爷云云，和老滚五粉丝吹水我说一句带专业名词的话可能就被开除粉丝籍了不过就游戏里的演出来说，这些神神鬼鬼给我的感觉就是村头打架 对汉弗莱等牛津出身者来说，牛津三等学位&gt;=其他院校一等学位；对江苏出身的本地人来说，省内211大于省外985，可谓异曲同工之妙 明星制作人文化有一点好，出事了大家都骂制作人而不是公司，起到吸引火力的效果，实在不行可以人间有梦，各自精彩，ktv了给股东一个交代是你守护了员工们吗？陶德，你好温柔 thinklive固态硬盘第一定律:无论你买多大的固态硬盘，在半年后都会发现不够用第二定律:主板上的全速固态槽比固态金贵第三定律:资本是逐利的，不管吹得再好，除非需求暴跌或者产量太高，固态厂都会慢慢涨价或者降做工割韭菜第四定律，也是最惨痛的教训，价格低谷的时候该抄底就抄底 在我游戏生涯里最震撼的演出来自上古卷轴5的黎明守卫dlc吸血鬼线，最终boss和大小姐对质，这boss逼格其实很高，没有神级也有个半神，吵架到高潮处，急眼了，开始掐大小姐脖子，这看起来完全是村头打架这时作为龙裔，毁灭系大师法师，集齐无数神器，受到诸多魔神庇护的主角，在一边看着，因为剧情演出时间两人无敌，这时我不禁感受到了杯赛技术力的强大，播片演出，pst，博德之门都有了，09年的dao还有帅气的处决脚本演出，是杯赛做不出来吗？不是的，是因为老滚五是高魔世界，真实维度里早就战到大道磨灭了，但龙裔排面太低，只能理解到掐脖子这种场面，就像小学生看微积分dy/dx就会问怎么不把d消了如此润物细无声的符合lore向演出，什么生软，黑曜石，cdpr，拉瑞安，往后稍稍，wrpg还得我们杯赛，it just work! 现在大家都说宇航员能看到great wall是谣言，但人家也没说是实体的great wall啊，普通人看到的great wall是石头筑城的，对懂点计网的人来说great wall是一系列信号与二进制代码，众所周知以现在的无线技术，航天器是可以联网的，他说看到了great wall其实是一种俏皮话，意思是他就算在太空用境内ip想跨境往来也会遇上great wall​开局死老婆（或者失踪）真是个万能公式，从巫师2，石头门0，海猫散（?），战神，极乐迪斯科，bs2还有诺兰的大部分电影，都让我为之神伤，并且乖乖掏了钱 我对steam的各种机制非常沉迷，包括功能在我看来比qq空间和朋友圈更好的动态（你在朋友圈发个涩图试试），ost的专门放映，成就，评论，点数商城，个人主页，展柜……但等级制度就让我难以理解了大部分娱乐性质的平台，等级要么按消费，要么按活跃程度分，但steam主要靠合卡和徽章，这就导致我这个库存数在好友里遥遥领先的人等级远远落后，其实我觉得应该没太多人喜欢玩合卡，但等级在stean里非常显眼，个人主页上直接挂名字前面要说我库存两百多，虽然大部分是史低入手或者便宜key，但算提成也给g胖爆了几k人民币，合起来几百刀了，这点米对国内的腾子网易就是零头（还是六年里断断续续花的），但在steam上不算少了，然而等级只有可怜的十出头究其原因应该是g胖想推高抽成的steam市场，其实很多集换卡是挺精美，但我一想这些图设定集不都有，就毫无集卡的兴致了，因此我的卡全低价卖了，而把这玩意和平台等级挂钩就很让人误解，比如我刚认识了一个人，吹逼说哥们游戏领域大神，steam老嗨，g胖从微软出走的时候给他上过提督，然后加了好友一看，游戏领域大师steam10级还没我高，我不是很丢人 虽然我讨厌儒家文化，但充斥着儒家文化描写的儒林外史又几乎是我最喜欢的古典小说，由此看来我不是讨厌儒家，而是讨厌主流视角里永远伟光正，所有儒生都像圣人一样的儒家​儒林外史里面有极少的真圣人，但绝大部分是尖酸刻薄，或油滑市侩，或迂腐固执的，嘴上圣人教诲，实则满身铜臭的儒生，这就让我觉得舒服多了，看来孔夫子的教诲也抵不过哈耶克的教诲嘛，这才是人性 反乌托邦和世界大战，世界大战的问题看起来比较好解决，如何核弹可以无限造，那么人类直接灭绝了，如果核弹无法再生产了，那么核战争基本可以把现代zf打崩溃，幸存者可以像辐射或者地铁里那样慢慢发展出某种文明，然而物质条件会极度艰苦，要是碰到辐射里凯撒军团这种政权，幸存下来也只能当奴隶反乌托邦是相反的，例如美丽新世界里的统治几乎没法推翻，科技实在太发达了，但物质条件很好，假设机械降神成功打破了监控机制，就可以造个真正的乌托邦出来，最不济也能吃喝不愁α和β，这下不好选了 在叶的成长经历中，有一句励志的话:“没有人会怜悯女术士的眼泪”，让失意的叶从自怨自怜中走了出来这是事实，但不能就此说女术士多可怜，看上去可怜的幼年叶也有个至少百里挑一的天赋，让她可以从贫苦的出身一步登天为宫廷术士，代价只是字面意义上的好好学习天天向上事实上，人类图图非人种族，尼弗迦德屠戮北境，松鼠党虐杀人类俘虏，宗教迫害普通民众，战乱中趁火打劫的强盗……这些过程中后者的眼泪毫无作用，因此准确的说法是，在猎魔人的世界观，也就是魔法战乱瘟疫特化版的欧洲中世纪，没有人会怜悯任何人的眼泪只是很简单的理由，有同情心的人早死在各种战乱，迫害里了 恐惧和害怕在常见语境上有一种微妙的区别，恐惧来自于未知，这是一种抽象的概念，而害怕则更多针对实体，比如看到连环杀手，则更多让人害怕而不是恐惧，因为只要不一个人走夜路，不走偏僻小道，家门上防盗链，窗户装防盗栏，就没什么可能被杀人犯得逞，这种危险是可认知的，也可以被解决在娱乐作品里，这两种感情可以大致划成恐怖和猎奇，前者我敬而远之，后者也够呛，也就bs这种很微小的猎奇可以接受比较有趣的是，相关流行文化里比较王道的克系不会让人恐惧，coc里有详细规则，其他体裁里，什么奈亚，泡泡，黄衣之主，都是人民群众的老朋友了，熟面孔也吓不到人了，这个时候就得搞点创新，比如control这种新怪谈同时恐怖和悬疑也有微妙的区别，希区柯克说，倒计时爆炸的炸弹不会让人吃惊，但桌底下没被发现，且不知道什么时候爆炸的炸弹才让人牵肠挂肚，这是悬疑的定义，但归根到底，炸弹爆炸，伤害范围的人就会死，这是确定的规则，而恐怖则不需要规则，把炸弹改成不可名状的实体，就符合恐怖的定义了 第一次知道主机是天龙人的时候我挺吃惊的，主机独占多是不假，难道pc独占少?很多小众独立游戏是没精力移植主机的，而且如果算switch主机的话想和任天堂联系上还不容易，还有异域镇魂曲之类的crpg老游戏，当代才移植，或者直接摆烂了，又或者rts这种没键鼠玩不了的，总之，主机端很多游戏是玩不了的，除非能跑windows虚拟机，游戏都不全怎么当天龙人，难道第一方大作比独游高贵吗?而兼容度最高的游戏平台是什么，那只会是pc，因为可以集成无数平台的模拟器，假设想成为一个游戏界天龙人，你至少得每个大类都涉猎十数个代表作吧，那你要么家里囤一堆主机掌机pc，要么配台高配pc，配合模拟器和虚拟机一劳永逸，然后买台ps5,因为血缘和战神5模拟器带不动 没有什么比省钱更令人高兴了，尤其是通过让别人少赚钱来省钱，可谓一举两得，同时达成两个目的​如果不是我熟悉笔记本构造，换风扇就会花上几百而不是五六十了，以月薪三千算，这能买成年劳动力的两天工作，足以吃一顿非常丰盛的晚餐，或者省着花买一周甚至两周的生命维持餐​因此，如果不是没时间，机修，水电，电焊我都想学，靠这些赚钱多少有点难，但只懂皮毛也能省下大笔开销了​此外，我也不喜欢别人动我的电脑，正所谓忠臣不事二主，电脑作为我最忠诚的仆人，应该只服从我一人才行…… 如果可以，我觉得邪典作应该省掉什么相识相爱的过程，直接把血肉石块的猎奇画面甩脸上，原因很简单，玩家都下了你这种猎奇作品，总不可能冲着纯爱来吧，你先放点日常的美好剧情，老玩家一看就懂，典中典先糖后刀，早就心之壁拉满等着开虐了，这还有什么意思。不如直接放弃无聊的恋爱过家家，直转直下，开局4到结局，从头刺激到尾 一般来说，王道指的是积极向上的流程，历尽艰辛最后获得比开始更好的处境，对具体题材没有限制，也不应该有限制，努力学习考高分是王道，努力工作还房贷也是王道。但是为什么提到王道，更容易想到魔王恶龙勇者公主之类的烂大街题材呢？估计是因为这些题材的王道纯度比较高，以提高属性打败恶龙为唯一目标，没什么节外生枝。wrpg往往没有这么纯粹，很多支线和主线没什么关系，要去做裁决别人命运或者给不同阵营打工这种又不王道也不邪道的事情，量变产生质变，像老滚5这种主线是打败魔龙成为世界最强的王道故事，因为主线还不如支线好玩，打完会毫无内心起伏，甚至产生一个疑问——我既然武力强到可以打败恶龙魔王了，为什么不干脆征服整个世界然后开后宫呢？但这么搞就是邪道了，因为征服世界很难说是艰苦奋斗，不如说是欺凌弱小，这么一来分级就要提高，销量就要降，得不偿失因此我确实是个煞风景的人，每次看到主角够强的王道故事都忍不住想我这么厉害为什么不讨个护国公摄政王当当 如果统计一下赛博朋克世界观游戏的主角群体，含脑量应该是所有大类里最低的，至少脑子里也会有几个芯片，还有缸中之脑的，电子脑的，直接是ai的，记忆移植的，人格修改的，感官干涉的，发条橙之类的价值观干涉的，应有尽有 从我的个人角度倒是希望把打小孩的家长送到豫章书院教育一下，不过这也是口嗨，我上初中的时候被我妈打得不轻 责骂更不用说了，平心而论我当时成绩也不是那么差，也没有早恋，不抽烟不喝酒，脏话都不会说几句，就偶尔考得差点，然后周末玩玩电脑，平时偷着玩玩手机被这么对待是很痛苦的一件事但我家里在经济上确实对我不错，特别是教育上花钱如流水，我妈工作就很忙了为了教育也天天很痛苦，以至于所有人都不开心，压力大的时候戾气就更重，这也是人之常情，更何况我的父母真有权力把我送到杨永信那里电一电，后半辈子收不住口水，而他们至少没这么做因此如果当时的我有个把家长送到豫章书院的机会，大概率不会真这么做可以说亲子关系是个非常纠结的东西，剪不断理还乱，我最讨厌的或者说最不能接受的题材就是原生家庭亲子教育，正如海馆里那句话，因为是别人的悲剧，才能接受，这种题材真是我身上的悲剧，可谓一见到就破防 高三下了晚自习回家大概11点，我躺在床上听dbu music的旅人1969，装作在宇宙中漂泊，其实是不是宇宙也无所谓，只要是空旷的无人区就行了，因为在潮湿闷热的夏天和五十几个人挤在一个不大的房间着实令人窒息，就算所有人都天天洗澡都很难受当时至少在旅人1969里我能回到一个无人区，但现在就很难回去，高三虽然挤罐头，但也都是各学各的，可以完全不互相交流，大学就不同了，就算学理工科可以不那么会来事，和人打交道也是免不了的，这种时候我就会闻到五十多个人散发出来的人肉味，难以散去 将世界的重任交给一个人，这对精英主义者来说似乎是一种理想的天国，著名的生化奇兵系列反驳精英主义用了两个论据，一是所有人都是精英就必然有精英变成相对的普通人，精英们会互相攻击内斗，二是精英也会腐化变质，因此乌托邦总会崩塌，只有一个人的话，第一个问题就不存在了不过这么一来第二个问题还是存在，这个精英出于什么目的才会担负起世界，又能持续多久，不会哪天心情不好就不干了吗？还有的问题是，这样一人面对全世界的巨大不平等实在让人恐惧，如果对精英来说平民就是蝼蚁，那所有其他人都会面临深深宿命感和无力感，这样的世界是可持续的吗 一般来说战略模拟游戏，甚至rts，最不真实的一点是玩家没有动力贪污，制作组不可能给消费者提供游戏货币兑换美刀或者黄金的途径，军费还是税收都是零损耗地投入正道，除此以外没有花费渠道是个人就有私欲，这么就太科幻了，改名三体人模拟器得了。我觉得可以做成黄油，贪污的经费每到一定数额就可以解锁好康的cg，贪到亡国的程度可以开大派对，这么一搞还能人均青天大老爷吗，反正我一周目肯定奔着酒池肉林去了 时隔几年重看油库里，又有点新的体会，我高三是很喜欢看虐油库里文，一是压力大，二是我的对权力与支配的本能向往，为什么我不去爱猫爱狗，而是看虐油?油库里是虚拟的，但爱猫tv云云不也是在屏幕上看的虚拟视频吗？我想这是因为油库里的运动能力远低于猫狗，但相对来说智能又比猫狗高，会简单的语言，上到社会精英，下到我这种没进入社会的底层学生，都能完全地支配这种智能生物。压力是不可能从下位传到上位的，只会相反，油库里的地位比猫狗还要低，智能又提供有趣的反馈，也就是所有人都有能力虐油，满足自己对权力的向往。假设真的有这种生物，我想社会整体的戾气就会小很多，因为可以转移到这种繁殖力高，又不能反抗的生物上，这很讽刺，欺凌弱小是邪恶，但反过来会造福人类 虽然利维亚的杰洛特，范格堡的叶奈法，翻译成中文后有种不明觉厉的时髦，但在世界观里的本地人听来就是，百京的王小明，上海的李小强一样朴素吧，关键还得是地名大家都不认识还朗朗上口，在东方里就是例如布加勒斯特的人偶师这种外号，不过这个称号不怎么少女，听起来像哪个魂类游戏的boss 长安的王老爹有句话说，世界上有两种人，“我们”和“他们”，这话不假，但看怎么分，在家庭里分，就三天大吵两天小吵，在学校里分，就会校园暴力层出不穷，总之，在人类里分就会永无宁日。非人里分呢，哈基米是它们，人类是我们，行不行?其实不怎么行，哈基米又不会说话，不算对等的他们，所以未来有两个指望，一个是机械派，ai是他们，人类大战牛肉萨满，克劳德，文心一言之类。一个是生物派，造点油库里，甚至克隆人出来，原生人类是我们，克隆人和油库里是他们，这样也分工明确。 爱丽丝跳下去的仙境，以现实的角度看是荒诞的，比如红心女王喜欢砍头，但也有现实的逻辑存在，像消失了一半的柴郡猫就没有头，没有任何办法能砍一个不存在头的生物的头，当然，这事也好办，如果红女王学过面向对象编程，就会先检测head对象是否为空，如果红心女王学过点数学，就可以类比虚数发明一个虚头出来砍掉。当然，也可以这么说，红心女王是要砍过去有头时的柴郡猫的头，这个头被它自己砍掉了，皆大欢喜，可喜可贺总之，从这个角度来说，仙境就像早期的规则系怪谈，秩序确切地存在着，只是一开始难以理解，给一个小学生看高等数学也会是类似的结果，他可能看不懂，但会本能性地知道这是秩序的在计算机界也有所谓的二进制分析，一些看起来杂乱无章的二进制码经过特定计算，匹配，可以找出一些特征，通过特征可以猜测这是不是程序，是什么类型的程序。爱丽丝要是在仙境待久点，就可以猜到柴郡猫消失要几秒，红心女王暴躁的性格是不是来自于心理创伤，估计这就是为什么她被审判然后赶出去了 如果想要塑造一个团结的集体，那么损害集体利益的行为可以分成两种，一种是损人利己，也就是不团结的收益比老老实实做人大，这种行为难以根除，但总可以通过奖励优秀个体和惩罚违规者来治理。还有一种就没办法，世界上存在很多不利己也要损人的人，或者为了非常微不足道的利益就去损人的人，我个人完全无法理解这种行为，但还真是不少，要解决估计只能逮到一个杀一个，或者在一些特殊集体，比如网络游戏里直接禁止损人选项。死亡搁浅在我看来就是这么个思路的游戏，无法损人只能利他，所以可以更多体验人性温暖的一面，这很好，但并不能说明什么，一个损人者造成的伤害可以抵过十个利他者带来的温暖，现实生活中无法禁止损人行为，也难以惩治，只能永远在博弈论困境中提心吊胆 被镜中人，或者影子人，或者各种方式产生的另一个自己取代算是个经典怪谈了，从我小时候看斯蒂芬金开始，这种故事至少看过五六次了，最近一次还是流浪地球2这种科幻题材。其中最有意思的应该是异域镇魂曲，玩家扮演的这一世无名氏正是一个镜中人，一个前世为了防止被取代，布下无数陷阱都被他破解，最后无名氏可以同化前世人格，并在融合中占主导，也就是取代“自己”，当然还有一些脑洞大的编剧还会整一些自己ntr自己的狠活，这种先不论了。关键问题在于，怎么产生一个“自我的完整定义”，如果只按性格，那么镜中人就是自己，人体只不过是两个器官集合，如果按记忆，镜中人和自己就是树形图的不同分支，那就不是同一个存在，如果像异域镇魂曲一样合并分支，就又成唯一的自我了，因为同时有两份记忆 想起小学时的一句顺口溜“因为所以，科学道理，想要知道，请拿钞票”，这倒是对知识付费时代的一个预言，但大部分人都不会为了“因为所以”付费，只会为“怎么做”付费，而这方面的资料也烂大街了，至少我没怎么为知识花过钱，事实上，知识就是信息，一锤子买卖而且几乎没有仓储运输成本，很难搞版权付费，更常见的模式是长期服务售卖知识的知识，正如开源代码不要钱，维护服务要钱，考研网课一搜就有，一对一答疑就要报班 找了几个我认为没什么雷点的游戏看评论区，筛选差评后发现很多人有意见，还意见不小，为什么呢，因为总有人感觉被代表然后刻板印象了，这不能说没有道理。于是我反转思路，没有实体人，还很便宜的总没有差评了吧，还真有，这次是因为玩法无聊，谜题不合理，这倒是让我蛮吃惊的，因为作者直接给了可以跳过解谜的官方外挂。于是我把目光投向玩法是整个游戏界公认top级,可定制性极强，几乎没有剧情，人物设计几乎无法被认为在影射或者凝视任何群体的游戏，比如杀戮尖塔，还是发现差评不少，这次是难度或者随机性设置不合理。这下我是真不知道还有什么游戏能让所有花钱的人满意了，于是我打开所有游戏的好评率排序，在我的家庭库里翻到一个好评99%的畅销游戏，问题是这就离谱了，这游戏雷点不比什么杀戮尖塔多？而且冒犯了潜在的大量群体，各种意义上真无法理解了 我越来越觉得阿西莫夫描绘的未来才是乌托邦，而美丽新世界不是这个世界有两种快乐，关于自身的和关于别人的，后者必然是零和博弈，你快乐别人就痛苦，因为冠军永远只有一个，嗑索玛和物质极大丰富解决的是前者，美丽新世界用洗脑式的基因改造解决问题，但社会分工就是用阶层实现的，阶层必然有高有低，有高有低就会比较，只是可以减少范围，而这种本能不能抹掉，长远看，必然有越来越强的竞争趋势与人比较的快乐以及这种比较带来的痛苦只能用老死不相往来解决。每个人隔着几万光年，那么就是想比较也比不了了，不能超光速通信的话来回就是几十年，没有别人的情况下没有动机去比，就算有人想星球大战，对方以逸待劳打防守战也不怕 作为工科生，我对“科学文学”评价不高，不说比较网红的量子力学，大部分科研都是追求确定性的，可能一时间追求不到，但再怎么说也不会去追求模糊的表达但爱丽丝不在此范围，如果事先不知道作者的身份，谁想得到这是数学家的作品?可以说，除了似有似无的隐喻，爱丽丝和数学没什么关系，像这样符号性地引用科学倒是无所谓，这就是超级英雄大片说自己是科幻题材一样，没什么人会当真 在ai人声和ai生成视频成熟后，要如何在网络上证明自己是自己呢，打开摄像头也不行，算力足够的话ai说不定可以几乎实时地生成真人影像总之，中文房间可能不再是是思想实验，而是现实，过去的枪手只能代写文章，而ai作为枪手可以代替整个电子世界的人。当然，我们可以同样用技术解决这种问题，例如一个权威方保证的验证平台，用指纹或者红外摄像头证明你是你，类似学信网。或许是足够长的电子凭证，只由个人持有，每天联网更新，像这样的方法也不难找，就是有点麻烦，况且信任危机也早就产生了 在我看来狗一以及这个系列，就是育碧的一个缩影，开启了很多有趣的ip然后，平滑地慢慢衰落，这个衰落当然是相对的，但育碧毕竟是大厂，人员成本就不低，需要大量产品线，或者gtaol这种持续的现金流维持一个商业帝国的体面。对我以上的论断，育白会反驳销量节节高，哪里衰落了，育黑会反驳工业化罐头哪里有趣了，我懒得写编年史，简单说说吧，狗1在steam4w评，狗2则是8w，狗3则可怜地不到1w，ac起源开始的三部曲有类似的境遇，好评率趋势也差不多。可见育碧式n部曲第一部往往挺有意思，第二部进一步发展，第三部开始再发展，玩家就有点腻了，ac三部曲我没玩，狗12我玩了，可以吐槽几句。狗1有很多问题，还宣发碰瓷过gta，实际成品，公道地说我觉得最多和gta4比一下，5就算了，但狗1使用了一个在现在非常少见的孤独大叔形象作为主角，而且电影化以当时条件来说做的不错，售价也比较友好，因此其实是个不错的第一部，第二部就难绷了，各种缩水一言难尽，风格又大变样，就像从ac1跳到大革命一样突兀，而3更是重量级，弱化主线，明明在狗1做出了一个蝙蝠侠一样的孤独英雄，而且ac2三部曲塑造的艾吉奥反映也不错，就是放一边不用了，实在是太过奢侈所以说我也不知道育碧开这么多ip干什么了，在我看来就是试水试太多了，明明有上岸的机会还想再试试，结果把自己的摇钱树ac也试了一下，现在试得快4了，令人感慨 我爷爷奶奶辈的恐惧是交公粮，以及饥荒与贫穷，我父母辈恐惧的是当一辈子农民或者铁饭碗变成泡影，这些恐惧大部分和我无关，要说我这一辈的恐惧，那就是当不了人上人。不愁吃不愁穿，不愁没学上，这是很美好的事，纵观人类这么多年的历史，都是件难得的事，但不能说我的恐惧就比老一辈的更淡，恐惧是很难比较的，我们可以测量某些时刻的能体现恐惧的内分泌，神经信号，但不能实时监控计算恐惧指数。举例来说我写的代码他们就看不懂，他们不能理解，一些复杂的算法的不可名状的恐惧，或者半天找不到bug的恐惧，以及我深深地记得小时候因为考不好受过的打骂产生的恐惧，纵观历史这种打骂不算什么，农村小孩能养大就不错了，还管你心理健不健康?考不好挨骂不是再正常不过。问题在于，我觉得超出我能力范围的事责骂我也不公平，我再努力也不能次次考好，假设我考砸的概率是1%，这已经很低了，考20次，一次不考砸的概率是0.8左右，依旧是难以避免的。这让我感到无力，众所周知，最恐怖的恐怖游戏没有枪，无力是恐惧的重要一环。当然恐惧也不是什么坏事，世界上有多少完好无损的心灵?这像是一种疫苗，提高对痛苦的耐受性。或许因为世界是痛苦的，才需要普遍的恐惧式教育，可以聊以慰藉的是我不用考虑再下一代会为了什么恐惧了，因为没有下一代了 有的黑友说星空不如给黑曜石做，因为天外世界风评还行，我只能说不能一个极端到另一个极端，为什么天外世界风评还行，首要原因够便宜，够小体量，其次没怎么宣发，都是比较宽容的老玩家玩。其实质量上，只能说够rpg，但实在没什么意思，无功无过，黑曜石擅长的是pentiment这种中小体量有浓郁西方文化色彩的题材，更早的pst，fnv两个口碑作也是这个标准，科幻是真不行。给超级小陶说句公道话，能做星空这个题材的游戏公司还没生出来，除非你把市面上可以叫大厂的公司都拉过去，投资几十亿美元开发至少8年。2077做一个近现代城市，画质是近年t1梯队，城市也不大都有非常多的差评，你想做远未来的整个银河系?纯做梦。真让黑曜石做，要么2d化大量用文本取代演出，要么就是天外世界plus，故事也难写好。我看最多微软想炫技，做个微软模拟宇宙航行，空间500g起步，纯看看风景，实际内容有整个太阳系就不错了 世界的bug和广受诟病的血统论有什么区别呢？血统论虽然不光彩，但热血漫遗传的强者血统经常是真能遗传能力，也不算能力不匹配地位，不像现实的二代很多就天赋平平扶不起来。而世界的bug不同在没有父母照顾，但依旧算基因彩票，如果是银河帝国的大boss骡那样无法生育还好，要是能生育就是血统论的第一代，bug体制能遗传，那不就是皇族血统一样的东西吗总之，这种区别多少有点微妙，也就是说热血漫里很难找什么公平，强者起码能以一敌百，有更高的地位不是理所应当，现实里社会精英也得吃农民种出来的饭，所以才能博弈平等 兰斯系列算是打破了我对jrpg设定残缺，关键时刻就唯心爆发的刻板印象，但比起对位的经典wrpg，老滚辐射，甚至整个dnd阵营，兰斯这样的jrpg依旧没有浓厚的mod文化或者说再创造文化，我觉得很大程度上因为jrpg相对强调冒险感，像兰斯设定很详细，也有意思，但主题依旧是以主角为中心的大冒险，可以说世界围着他转，冒险是什么，是不断发现新东西，设定可以快到结尾再加，只要有趣受众就买账。wrpg就不会那么强调新，fnv的废土一直就是废土，势力就那么多，一开始介绍世界观就知道了，其他一些知名系列也大同小异。玩家和制作组是相对平等的，这是种无言的默契，不会新来个设定把原来的顶替掉，因此如果像陶德一样唐突地把ncr灭了就会挨骂。而兰斯这种jrpg呢？设定依旧存在，但有一堆至高权能喜欢搞事的神明，所以理论上大部分设定都不安全，事实上神明也经常整大活，为了“冒险”服务嘛。因此你去搞二创，可能下一作就换版本。虽然不是rpg，但也可以讨论一下东方等同人文化，东方和wrpg是相反的，设定大量留白，虽然zun可以推翻二创的一些设想，但二设可以部分甚至极大部分无视一设，放商业ip这么做早吃官司了，但同人里是自由的，如果我们要命名的话，wrpg属于推演自由，东方可以叫设定自由 不死的实现方式: 蓬莱之药式，在生理上进化成特殊的不死种族，义体改造也同理 卡bug式，pst的无名氏就是这种原理，问题是一般会有世界线修正之类的设定排除bug 冬眠式，也包括时间冻结 意识上传，只要意识能数据化，上传也好，异地备份也好都是一种永恒 更改自我的定义，比如飞升成世界意志，或者什么蜂群意识之类的 《看不见的骑士》和东方project有点像，以某个逐渐没落的精神为实体，这其实可以理解为一种创作观，角色有自己的目的，不一定是说明什么道理，也可能是揭示某种规则或者追求一种命运，比如英雄的角色就应该像英雄一样发达或者战死，不能被路边一颗石头绊倒摔死，对应的骑士就应该恪守荣耀战死或者赢得胜利，妖怪会迫害人类，神明就要谋求信仰。还有一种创造观是完全还原现实，也包括现实的不确定性，像决斗而死的天才数学家一样荒诞，我个人觉得这么写没什么意思 while 1 echo love;如果说这样的人偶之爱是虚假的话，那么真实的爱难道不是大量的虚假之爱的堆砌吗人偶可以视为对人的劣化，也可以视为人的组成部分，甚至可以视为人，对人偶之爱的界定可以有几种观点。爱是可以被量化的，因此可以堆叠爱必须在一定的复杂度上才会出现，因此算力不够模拟人类的人偶或者人工智能是没有爱的爱无分大小，无分对象，爱被自己定义不依赖于其他，因此人偶之爱和恋人之爱，亲人之爱没有分别 科学是人类知识中最艰深的一部分，但如果作为创作的母题没什么存在感，正经搞科普和上课区别也不大，如果像何圣一样搞“科技博主”，火是很火，但和科学没什么关系。​反过来，金钱是个浅显的东西，就算没受过任何教育的人也会不自觉地拜倒在金钱下，这就导致金钱一旦作为母题，存在感就是压倒性地强大，除了死亡外没有能打倒它的，或让人贪婪或引起相反的鄙视，我们大概率将得到一个感情浓厚，母题压过情节的故事 道德上说linus也不算错，主流的分支是他领头维护，不满意可以随意自己fork新分支，，甚至这也不违背开源软件的理想，开源同时可以是商业的，不提供开源以外的保证，linus没有商业化，只不过禁止了部分提交者。​对此不满的主要是自由软件理念的支持者，我印象里linus并不是自由软件理念的鼓吹者，只是他实际上这么做了，让发达国家到第三世界的群众都有开源操作系统用，不用给微软苹果这些技术资本交钱，这些贡献是无法抹去的，因此linus实质上成为这个理念的图腾，某种意义上的在世圣人，尽管他脾气暴躁，出口成脏，离寻常的圣人形象很远​总之，很难说linus做错了什么，他有意无意地打了自己的脸，暴露了自己自私且狭隘的一面，但行为符合协议，也没有让自由软件理念真的破产，唯一改变的是在世圣人又少了一个，我仍然承认他是个好人，时至今日还有很多穷人受益于linux，尽管很多战争机器也用了linux，资本也用linux，linux内核对所有人都是公平的，就像泰勒定理对所有人都是公平的一样，而驱动或者硬件适配上的不公平就没有办法了，这不是linus能解决的问题 博尔赫斯有篇小说，写的是死刑犯上刑场前祈求上帝给他点时间把未完的书稿写完，并且真的应验了，在刑罚施加前时间无限放慢，直到他把稿子在脑海里写完，然后心安理得地死了。​这个故事有趣就有趣在，好像是废话，但也未必，有无穷的时间思考，可能数学题写不出来，写篇小说并且倒背如流是肯定能做到的，这是废话。不是废话的部分是，他在脑子里写完了小说，这件事死无对证，非常魔幻，除非验尸官能从脑浆校验出他临死前写了什么，不然就无从证明这件事。因此可以美好地想象，所有有未竟心愿并可以在脑海里实现的人临死前都有这么一次慷慨的机会，因为现实里很多潜在的大艺术家，大导演，大文学家都默默为生活奔波 月球上住着兔子，还有一个不知道为什么飞上去的中国女人，细想的话这很不可思议，人想飞很正常，但月亮和兔子有什么关系?​以及，太阳神鸟又是什么?太阳为什么和鸟有关?就算按传统文化来说，太阳是至阳之物，月亮至阴，鸟又不强大哪里阳了?兔子又哪里阴了？总不能是因为鸟类体温高于其他动物吧​总之，民俗本应该是有道理的，但最后成了单纯的现象，这很有趣。埃及神话的荷鲁斯也是鸟神，同时也是太阳神，好像这是共性，而月兔文化又只有中国有，看起来完全没有道理，却是一个文化圈的共识 steam在局域网内有着独特的定位，在如墙领域里，它是最大众的，不像github几乎只有程序员用，但github90%是个技术网站，几乎没人在上面见证，虽然一些污染性的库很难绷。steam更大众一点，也就是可以搞很多东西，包括当代网民最热衷的瑟琴和见证，下个uu加速器就能看到，加个涩图群的话都不用加速这说明了一点，就算不⭐🦆1️⃣也有人见证(悲) 在不涉及r18的场合，应该没有人会花钱挨骂，这就是为什么付费娱乐商品不应该审判用户，甚至不少人讨厌被质问。但这么一来游戏之类的娱乐产品就成了道德虚无主义的温床了?(当然大前提是可以合法销售)例如gta5干坏事会被警察追捕，可以利用游戏机制告诉玩家干坏事会有惩罚，而问题在于，这种惩罚又成了游戏机制的一部分，很多人会觉得被追捕也很好玩，道德依然被部分消解了。又或者像传说之下之类的meta游戏直接和玩家对线，但这依旧没有意义，首先没多少人喜欢花钱专门挨骂，这就意味着大部分玩家能做坏事的原因是作者给了选项，也就是钓鱼执法，这种审判不完全是正当的，玩家没有对等的抗辩权，而做完游戏的作者理应和玩家平等，特别是卖钱的作者总之，我不得不遗憾地说，在文化消费品里找道德就是痴人说梦，作者无权审判，就算审判也是在鼓动逆反心理，或者消解道德 如果等到了戈多，事情会有什么变化，可能有下一个戈少要等，可能发现等的戈多不是来的戈多，有可能戈多真的带来了什么结局，不管是好结局还是坏结局……​但这个故事依然荒诞且虚无，因为它没有开头，也就是开头或者说过去无法改变，从宇宙大爆炸起的一切都和每个原子息息相关，从来是过去决定现在，而不是相反。​可以说戈多暗示了一个氛围，它的到来不会改变什么，因果在等待戈多前就已经种下，等待戈多也是结局的一部分 当一个人对文化消费品的阅历达到一定程度后，不可避免地会看到越来越多重复的母题，模式，以及结局，这可能导向若干结论，例如创新停滞说，资本入侵说等等在我看来这是再正常不过的现象，文化是秩序化的信息，秩序天生有着趋同倾向，创作者的精力有限，因此容易发现的和复制的秩序就会被更多再生产，否则就更稀有，而人脑会不断学习加强分类以及检索能力，特征相似的序列就会碰撞在邻近记忆区……如何对抗重复带来的厌倦感?大概有两种办法，一个是失忆，给头盖骨来一棍，或者温和点等慢慢淡忘再去消费，另一个就是作为创造者去创建新的文化，如果我们把一个文化综合体比作生命，这大概是它自我增值的一种途径…… 极端的观点会有更高的出镜率，更有趣的是，反对者的引用可能比支持者很多，这有点像分级火箭，引用截然相反的观点，反而会让自己这派走得更远​我就很喜欢引用绝对自由主义，精英主义，或者存在主义之类的名言警句，这些句子我半个字也不信，几乎可以当笑话讲​中间派的理论就没这么有意思，因为或多或少有让人相信的力量，引用的语境下需要论述其对错，必然是严肃的，令人厌倦 我之前想到过不思议之国这么火的原因之一，就是它把常识和规则都粉碎了，不靠做题，不靠打仗或者人类比较熟悉的规则运转一个社会，但是规则是存在的，只是你作为外来者不知道这么一来就和西部题材有一点类似，西部为什么有趣?因为你有可能一夜之间成为百万富翁或者百万负翁。所有人都有想当人上人的本能，越是蕴藏机遇的法外之地，就越令中低层们向往如果把不思议之国往这个方向发展呢?如果爱丽丝巧舌如簧，鼓动居民们把红心女王推上断头台，自己称王，然后和镜中之国以及不同的童话世界开战，目标成为多元宇宙之主，也是个很有趣的发展 弥赛亚情结可以分成两种，自己当弥赛亚和希望出来一个弥赛亚，都是可行度极低的幻想或许是觉得这样太扯淡了，谷川流搞出了凉宫春日和阿虚，凉宫春日作为一种情结不太行，这姐们们肆意妄为全是因为她真有神力，不是因为她要拯救世界。阿虚倒是一种典型情结，他希望有个凉宫春日半强迫式地带着他到处跑，不用背负主角的责任，还可以过丰富多彩的生活，这多少有点弥赛亚，但凉宫作为救世主拯救的不是绝望痛苦的世界，而是无聊的世界这种情结依旧不可行，假设有个行动力超强的领导者，你有什么特殊才能，能让有领导能力的人这么拉拢?当然了，实在不行也可以单纯地盼望世界末日，首先末日不无聊，其次，也未必不会产生弥赛亚，说不定弥赛亚会在末日来临后，人类灭亡前出现呢？ 优生学是快两个世纪前的东西了，虽然挺极端的，但最后因为可行性，伦理性以及乱七八糟的原因衰落了​未曾想两百年后的人类自发地，群体无意识地把这种古董意识形态挖了出来，千禧一代开始逐渐用言论和行动证明，基因不够优秀的，社会竞争优势不够的人就是没资格生孩子，这也是这个时代魔幻的现象之一 耳濡目染之下，商品拜物教的信徒几乎活在华胥之国，梦想，享乐，尊严，没有什么不可以作为商品买到。​但是正所谓生于忧患，死于安乐，对曾经曾经的农业帝国来说，对盛极必衰，荣华富贵转头空的恐惧又深深印刻在集体潜意识里。​这两个侧面交织在一起构成了存在的实感，也就是对生的渴望与对死的恐惧但是还有着没有被消解的欲望，盛极必衰，绝境逢生的轮回可以终结吗？可以计算出一切吗？但对秩序的渴望和对混乱的恐惧这两种欲望永远难以满足，连爱因斯坦都不知道上帝掷不掷骰子，因此迷茫不会改变 卡尔维诺的短篇简直不知所云，但中篇又精致也不会过于繁复。这种体验让我不得不加强了作者已死的思想钢印，关于这点可以用反证法，如果作者还活着，卡尔维诺学文科，我学理科，他文学阅历渊博而我俗不可耐，卡尔维诺或者什么类似的文学家想碾死我不要太简单，那么我的一切书评都是庸俗浅薄不值一驳的，所以对我这种弱者来说，肯定要把作家都杀死​当然了，文学家就可以反驳作者已死，归根到底谁也说服不了谁，我的建议是一物克一物，作者的话不如和编辑去说 steam应该出个个人测评好评率统计功能，然后年度报告统计一下大致梯度。这应该很能体现玩家的性格(当然，肯定是中深度玩家样本数才够)，个人好评率高说明要么此人极度谨慎，非喜好的品类的不玩，要么就是大好人；相反地低好评率说明此人性格苛刻或者喜欢玩游戏但要求很高话说我个人的好评率应该在90以上，毕竟买之前都会查半天资料，实在不喜欢的也退款了 游戏多了后整理起来很痛苦，单单一个维度是不够的，比如按类型分，我都有100多款avg了，就需要再引入一个维度，比如说个人评分，或者说权值，默认可以都设置10，个人编辑可以让收藏夹按权值分类显示游戏，当然也可以按权值屏蔽更进一步可以做一个简易数据库存储游戏的metadata，根据细分的键值对来对游戏库管理… rpg游戏里对路线设计的偏好是个常见的问题，实际情况下很可能出现屠杀线人死光了剧情没法编，或者很多情况下善良奖励更多，人际关系更丰富之类的问题，不如说邪恶路线非常容易变成纯粹混乱的县中路线，毕竟都邪恶了还遵守秩序不是多此一举，大部分世界观下的主要秩序都是鼓励善行的，因此体验以及奖励会单薄不少因此，邪恶路线想做好，就不能和善良路线共享框架，人际关系，所处的政体都得完全不同才行，也就是说需要一个邪恶利己的秩序可以让主角投身其中，主线从拯救世界反转为帮邪恶阵营毁灭世界，然后彻底支配邪恶阵营之类的，就拿me2来说，叛逆路线如果可以直接背叛银河系联盟阵营投入收割者并保留主体意志就好玩了，不过这么一来过于惊世骇俗可能会被炎上 在文化领域，现实派和浪漫派的战争是永不停歇的，细分到恐怖文化，这两者可以说平分秋色，现实派有电锯惊魂，沉默的羔羊之类的杀人狂，疯子和变态，浪漫派也不甘示弱，日式恐怖的贞子，伽椰子，以及各路民俗怪谈，都市传说。那么，遇到分类，就会有边界问题，比如科学怪人该分给哪派呢?说实话大部分恐怖题材的改造人缝合怪完全不科学，更像披了科学皮的魔法，我觉得绝大部分应该划给浪漫派。也有一些改造大脑改造出了变态杀手的，鉴于现实中也有大脑做手术后性情大变的，所以这种应该可以算现实派。古兰大剧院为自己的衰落找的理由是，一二战发生的惨剧太多，人们不需要看恐怖剧场了，不过我觉得这只是一部分原因，恐怖的需求是一直存在的，但人偶剧场搞了这么多年，多少也看腻了，20世纪起开始发展的恐怖电影有更好的特效和演技 恐怕很大比例的通关者会认为这部游戏的基调是悲观压抑的，我的两个周目里感受也一样，但我现在快大学毕业了，反而有了另一种感受不管是哈里，还是金，或者有着类似的迪斯科情节的屏幕前的玩家，都要解决一个问题，在失却理想的废墟中如何才能找到救赎？旧的理想难以再续，新的理想要么庸俗乏味要么软弱无力，投向没有具体立场的道德主义吗？但是这必然伴随着一次又一次的痛苦拷问，直至心灵破碎。投向庸俗的利己主义吗？但尸山血海中只有极少数幸运儿能得到片刻的救赎。看似没有任何出路(当然指的是心灵上的)，我认为这是游戏少了一个视角造成的，迪斯科讲了政治，讲了经济，当然也讲了文化和哲学，但是科学呢？如果我们能突破大气层进入星际时代，一切问题都可以抛在脑后，当然这是无聊的空想，但通过教育和科研，这可能成为未来的现实，如果说有还没有被否定的救赎存在，那就是科学，或许还有个宗教，当然科学的前方也可能是赛博朋克之类的绝境，但和什么都不做相比，我更愿意在科学中寻求救赎 很难定义文化输出是什么，现在我们提到极客文化，不会觉得它是美国专属，也不会觉得是西方专属，但这玩意很大程度上在美国起源，这是文化输出吗？美少女文化起源于日本，但现在全世界都在创作二次元美少女，steam今年都找了个很日式画风的画师画促销宣传图。你可能觉得武侠这种总归只有cn能输出吧，但美国有个老rpg叫翡翠帝国，把中式武侠做成了西方刻板印象的武僧，这算输出中国文化还是输出西方文化?总之，某种文化在初期可能会有区域性特征，但随着发展，就会达到所有人都会用这种文化创作的程度，你可以说所有国家都在用二次元相互输出，但这也没什么用。也就是说，你可以输出文化，但不能阻止其他人模仿你怎么创作文化，因此你越输出文化，其他人也就越能有样学样，从而你越不能输出文化，这让所谓的文化输出成为一个短暂的暂时性概念 反推理是一种奇妙的流派，因为推理小说作为一种小说题材很明显和政治哲学道德之类的命题没多大关系，价值判断最多只是点缀，为什么要反呢？不过大概来说有两种动机：一是讽刺推理小说作家和读者自诩聪明理性，动不动嘲笑警方的探案能力，其实不过是把问题简化并洋洋自得以为自己多聪明，是键盘侠的一种；二是对这种选题进行道德批判，推理小说把死亡这种严肃的命题娱乐化，毕竟很多侦探小说推理不是为了维护正义什么的，而是单纯找乐子，侦探走到哪人死到哪，甚至还有想向侦探挑衅而犯罪的罪犯，这不是娱乐至死吗不过我觉得这种批判没什么意思，单推理这个行为是没什么反对理由的，而推理小说最核心的部分毋庸置疑是推理，所以所谓反推理只能反不核心的部分","link":"/cyberblog/2024/01/20/dairy/"},{"title":"书评","text":"男爵所生活的树上世界，和我所创造的迪瑞克拉一样，是一个高于客观世界的以某个主体为中心的世界，树下的世界有美好有不堪，总体来看树上更自由，但最大的问题是不会被任何一个人独享，而树上的世界却是独属于，当然可以加个近乎，不过我想在精神上是完全独属于男爵的。为什么要追求一个主观构建的世界?我想是因为总有人不想把自我淹没掉，当然也有人更喜欢融入集体，这无所谓，只不过男爵和我，或者王小波这样的人总可以找个地方躲进去，享受造物主的快乐 卡尔维诺说现代是分裂的，自我攻击，自相矛盾的，这就像汉弗莱所言，如果一个公务员相信自己的所言，那他必然是个胡言乱语的疯子；其实这也不矛盾，我们可以简单地把意识看成连续且可导的多元函数，每个偏微分都可能有截然不同的性状。子爵裂成了两半，这让他不会妥协，某种意义上更加纯粹，但也丢掉了一个元，我们无需羡慕这种分裂，谁说难解的多元函数就比单元函数好呢？没什么好比较的，只是选择不同而已。当然，本书也没有价值判断的成分，在我看来卡尔维诺指出了一种可能，选择分裂，选择纯粹。 机械，工业，计算机，人工智能，都是人造物，但它们可以反过来奴役人，同样，不存在的骑士是人造物，但可以反过来取代人。那么人是不是人造物？人可不可以被制造，因为被制造的产物可以超越生产它的主体，也就是说，人可以制造超人，人不知道是谁创造自己，从而可能像流浪汉一样不知道自己是什么，如果你不相信神的话，但人造人知道，这就让人造人不会那么容易陷入虚无，虽然不知道自己的去处，它至少知道自己来自哪里，所以这也算对虚无主义的一个解答，即自己制造自己，然后用制造的自己取代自己。 冬夜旅人是一本有趣的元小说，探讨小说的小说，和一本写作教材不同的是，它使用小说的形式探讨小说，也就是是卡尔维诺证明了小说可以是递归的。小说可以是作者写就，也可以由读者阐释而成。可以记载虚假，也可以写就真实可以让读者与作者在思想上融为一体，也可以让两者成为死敌可以互相嵌套，叠加起无数的层级；也可以铺开一个单层的幻想世界可以视为过去，但也可以作用于未来。我们可以把小说视为在两端间传输的信息波，可以改变其频率，幅度，相位，带宽等等等等，只不过要受到物理规律与信息论的限制，信息可以嵌套，可以递归，那小说作为一种有结构的信息就可以当然，我们无法违背信息定理，但探讨更有效的结构永远是有价值的，因为文字是离散的，不管是汉字还是英语都是由一个个离散的字或者字母组成，世界是连续的，就算我们考虑量子或者普朗克时间之类的东西，也比语言更稠密，那么语言或者写作就是对世界的压缩编码，这样一来我们就需要更有效的结构，这就是元小说或者任何meta题材的意义 抛开对数据结构或者信息论的探讨，直观地说，冬夜旅人可视为对一个经典问题的阐释——什么类型的书没有结局最让读者痛苦。​比较通用的解答是悬疑类型的书，可以分为本格与非本格，本格还好，理论上讲足够聪明的读者就能解出来并验证，就像数学题一样，变本格麻烦点，因为可能关键设定结尾才揭晓。​但出于公平我们也有考虑其他答案，比如言情小说，我们知道结局大概率是主人公在一起，但，例如写到矛盾部分烂尾了，不免还是让人纠结怎么才能和好。​或者政治评论，如果作者比较八面玲珑，不到最后不表明立场，不免也让人痛苦​再例如骑士小说，我是说正宗的那种，一般来说主人公要么爱情事业双丰收，要么死在一场荣誉的战斗，假设在一场战斗的高潮断了，也很让人痛苦​总之，没有结果几乎都是让人痛苦的事，除非结果注定是悲剧","link":"/cyberblog/2024/09/23/%E4%B9%A6%E8%AF%84/"},{"title":"星空","text":"星空一对恋人正在观赏夏夜的星空她说:“群星真美”他说:“不及你的眼睛”群星之中的某个存在正好听到了他们的话语，或许是恼怒，或者说戏谑，祂将她的眼球用以太填充，又在眼眶中投下星空，任何人凝视她的双眼，看到的都只有群星。这是一个很常见的逻辑，一个事物无法和自己比较，如果她的双眼就是星空，怎么比星空更美呢？事实上他本想抛弃她，但是在群星降下诅咒后，他却沉迷于她的双眼，而她虽然什么也看不到，但正好误以为他如之前一样深爱自己。在他悉心的照料和渴求下，她愈发感动而难以自制，或许是略微有所察觉他的真正所爱，她终于……她终于割下了那对眼皮，再也没有什么阻碍在他与星空之间的东西了“我可以追随这片星空吗？”他问她默许式地靠近他，他的眼球融入了她的眼眶，如同以眼球相吻，他们将身体沿着眼眶的一侧翻转开来，展露出来的一面血肉模糊，另一面是美丽的群星。收藏家发现了两人的尸骨，将其珍藏至今…… “写的什么玩意”我看完了梅贝尔的稿子，将其撕成粉碎的纸屑（星空）","link":"/cyberblog/2024/08/04/%E6%98%9F%E7%A9%BA/"},{"title":"备份","text":"备份我可能是世界上最喜欢备份的人，看着档案库，我这么想从四十年前亲手留下第一份档案开始，每个固定周期，和重大变故，我都留下了快照，只要我想，我可以随时让我的思想遨游回过去这让我从来不会被虚无感折磨，这是我与那些浑浑噩噩，让记忆从指缝溜走的人的区别，在通信领域中，用超过两倍带宽的频率采样就会存下全部信息，而对我的这些样本，应该也足以还原出我的大部分人格信息，没错，某种意义上，我已经实现了不朽然而，我老了，当我翻阅一份年轻的快照时，我发现对此毫无印象，甚至不觉得我会做出这些选择，可以确定的是几乎完全不可能有人篡改档案，篡改档案而不改变校验码的概率，以小数表示在第一个有效数字前有几百位那么，这，是”我”吗?在档案库中，我陷入了恐惧，如同被无数个陌生人包围我的过去是连续的，而快照是离散的，因此几十年的连续变化后，两个切片完全不同，也是正常的，我这样对自己说，但这依旧让我恐惧，我终于意识到，即使这些快照无法改变，现在的我还可能对构成自己的过去的片段一无所知，因此重新组合，截取，就会毫无矛盾感地产生无数个不同的我，而其中只有按时间轴还原的产物才是现在的我，我实现的不是真正的不朽，而是一个特定排列下的不朽，那么，现在的我是谁?只有我，只有我自己可以随意改动这些档案不留下矛盾，只需要改变一下组合的方式，在用自己的签名留下校验码就行了我是否，已经不是“我”了？","link":"/cyberblog/2024/07/01/%E5%A4%87%E4%BB%BD/"},{"title":"他人即地狱","text":"所谓的他人即地狱，也就是自我的主体在与其他自我的交互中必然会湮灭，片中的家庭悲剧就来自于父母不和对两个儿童的存在价值的否定，儿童没有完整的自我意识，其自我认同依附于父母，无论是否定父母还是被父母否定，都是对其自我的否定，因此“我”在家庭变故后陷入虚无，深感自我的不完整，类似的例如凉宫春日中，春日在意识到世界上有无数个自我后陷入忧郁，不得不用对独特性的追求重塑自我，为了避免这种无力感，为了避免自我意识的溶解，只有两条路。一是强化自我的主体性，就像片中的姐姐那样，用自己来影响周围的世界，可以说这是一个自我强化的过程，她越是影响周边的人，就越会有更强大的辐射力，自我的存在也更加强烈，某种意义上也是凉宫春日的做法二是贬低他人的主体性，就像片中的“我”，我鄙视身边的所有人，虽然我自己是残缺的存在，但只要周边比我更为残缺，那么我依旧是独一无二的“自我”；又或者是片中的宇月，无视身边的世界，就像其他的自我不存在，这个世界只有自己的存在是真实的没有哪种方法绝对地更好，姐姐看似光芒万丈，但那又如何，她真的能一直用拯救别人的方式拯救自己吗？总有她也无能为力的困境。马克思说人是社会关系的集合，也就是说尽管他人是地狱，身处社会中我们就不得不面对地狱，问题在于，原生家庭带来的伤痛往往是过于沉重的，在迈出第一步时吃了苦头，所谓的习得性无助就会让一个人永远无法再次迈步了，即使有的时候第一种方法比第二种好，他也会因为这种创伤一味地选择逃避，这种悲剧如何避免？其实基本是不可能的，人是社会关系的总和没错，但人首先是动物，正是本能塑成了我们，但好在现在是一个原子化社会，相比过去的人，我们可以选择更少的社交，从而保持更大的主体性。","link":"/cyberblog/2024/06/27/%E4%BB%96%E4%BA%BA%E5%8D%B3%E5%9C%B0%E7%8B%B1/"},{"title":"视角","text":"一开始，我们乐观地认为，给每个人一个视角，让每个人都拥有一个世界，会产生一个丰富多彩的结果然而人们本能地渴望更多，结果是，每个人都构造了无穷的世界这还不够，世界之间产生无穷无尽的冲突，无穷的无穷次方，那是一场难以描述的灾难我们试着去修复，但遮住双眼后还有听觉，隔绝感官后还有思想，没错，想要彻底消除“视角”只有一个办法——消灭视角的主体这就是为什么你会一个人醒来，没有其他的观测者要么让无穷的视角拥有有限的世界，要么让唯一的视角拥有无限，我们最终选择了后者请享受你孤独的创作吧，但是切记，不要再度创造一个视角","link":"/cyberblog/2024/05/29/%E8%A7%86%E8%A7%92/"},{"title":"对小波的一些仿写和感想","text":"红拂夜奔是一本让人不忍卒读的书，小波很少写传记这么长的时间线，因此红拂夜奔几乎是他时间线最长的小说之一，当然在王小波的作品里说时间轴没什么意义，但问题在于叙事的起伏也因此拉得很长，让小波成功写出了一个从绝望向更绝望演变的故事，而比洛阳更封闭窒息的长安却恰恰是聪明的卫公亲手打造的，这更是故事的点睛之笔​卫公是全世界最聪明的人，除了智慧和理性，他什么也不信，这让他无比纯粹，也在某种程度上非常幼稚，他觉得数学和工程学是值得追求的，然而不是所有人都这么想，比如皇上就认为能消灭反对派的工程是好工程，除此以外都是潜在的危险。卫公相信理性与科学，这必然导致他比起秩序更倾向自由，像他这样的数学家兼工程学家需要自由地与同行讨论，需要自由地查各种资料，自由对他来说是科学的必需品，也是其附属品；因此对卫公来说如果屈服强权能得到研究的自由，这也是可以接受的，这导致了他最后的悲剧，他无法理解为什么皇帝要用本来应该导向自由的技术来实现更高效的集权，当然，这点没什么好指责的，我是他也会做成同样的选择，卫公这种人和我一样，无法理解为什么有人喜欢被管，有人喜欢管别人。卫公的问题是他太幼稚了，他没有把政治问题当做工程问题考虑的意识，在小波其他作品的一些主人公里就更狡猾，当然工程师去考虑政治往往会得到一些令人啼笑皆非的答案，但卫公面临的问题麻烦在，他从始至终只觉得自己是工程师是数学家，他没有考虑到自己已经是政治人物，等他不得不考虑的时候，已经只有装疯卖傻一个选择了，但这也不是他的错，这种工程师是情商最差的，这意思是，如果卫公想装作“会来事”可能马上就被全家问斩了。总之，我认为对工程师或者数学家来说，没有任何道理要求他“会来事”，理工科面对的是一个高度抽象后的世界，长期处于这种世界会剥夺一个人为人处世的能力，这没办法，但你很难对非工程师出身的人解释这点，解释了他们也不会信，所以我很同情卫公，但确实没办法总之，全书除了红拂没有人真正支持他，他所有依靠技术改革的努力都失败，最后只能装疯卖傻，然而装疯卖傻都被揭穿了，所以卫公其实没有任何希望​红拂是全书最纯粹的反抗者，她倒是不关心什么科学，什么理性，她只是单纯地喜欢无拘无束的生活，但书中的世界不容许这样的人，所以她最后也屈服去办自杀手续，红拂是为了自由和卫公私奔的，但最后她不得不意识到这种自由只是一种偶然，当意识到她和卫公亲手创造了另一座更压抑的洛阳城时，他们已经老到逃不了了。所以卫公装疯卖傻，红拂也只能去当她的妇女办主席，最后想自杀还要办申请手续，当然她是无所谓的，但她不屈服，街坊邻居就得连坐，这是红拂无法接受的，所以反抗精神最后的象征也葬送在了官僚体制下​这个结局最大的悲剧之处在于，反抗的二人死得像个滑稽剧，连壮烈成仁的体面也没有，我个人认为这比1984的结局更有震撼力，奥威尔反对的是思想控制，但思想控制或者说极权只是王小波笔下官僚政治的一部分，成熟的管理体系不需要特别的秘密警察机构，繁琐的手续关卡就能把所有反抗的念头熄灭，而这些手续将会被先用在那些设计出复杂的控制流技术的最聪明的知识分子身上小波是个很聪明的人，我敢说小波的数学天赋和水平都比我高，他全靠自学就在千军万马里考上了人大，当然那时候高考刚恢复，未免有点不成熟，但小波的天赋还是可见一斑的，所以我不能妄言我懂小波的所思所想，但在我看来小波写的是一本实操手册，把遇到的问题和经验忠实点记录下来，我听说在数学界，提出问题与猜想很多时候比解决问题更重要，只要找到问题，前赴后继的数学家就迟早能找到答案，所以作为工程问题，我们总有一天会找到小波提出的问题的所谓的最佳实践，这种理工科生的浪漫之处，恐怕是其他专业难以体会的 如果我要写一本纯文学小说，那可能会这么开头“我的故事开始于做题，也结束于做题”，这样的写法是在致敬小波，而小波是在致敬谁我就不清楚了，不管怎么说，小波的青春基本都在闹革命，要么是在城里要么在乡下，而我的青春则都在做题，这其中的不同处似乎很明显，但这也不一定，就结果来看这两件事都有让人精神状态不正常的影响，此外，就健康来说，知青岁月让小波有严重的心脏病，而高三也送给了我脊柱侧弯作为定情信物，所以我有些疑心这两件事其实是一回事，意思是其实王小波这厮没有死，他骗我说他死了，然后把我写成一部新小说的角色，毕竟如果他是我人生的作者的话当然可以这么做，而他经历的事我未免也得经历一遍，不过得换种方式，这样折磨一个角色未免有些残忍，但可能他身处的时代人权保护还不适用于书中人物​当然，我也可以写一篇故事作为报复，这次不让王二闹革命了，我让他做题去，让他高中三年做出90度脊柱侧弯和1000度近视眼，因为正如我之前说的，这两件事没什么太大的不同，所以我想这也不损文学价值 如果我们都相信拼多多，那么事情就会变得有些麻烦，一般来说高数的前几章就会讲极限，一个标准的例子是如果一个函数定义为fx=x，那么x趋近一个常数c时,fx就会趋近于c​但如果按拼多多的算法，如果我们把页面显示送钱定义为x，实际拿到的钱定义成fx，那么当前者趋近于，比方说，600时，fx竟然趋近为0，如果让学过高数的人看到这件事，就会有两种结果，乐观的人就会当场把大部分数学书撕掉，因为这些理论都无用了，悲观的人，比如我，就会想数学无用了那我以后干什么 操作系统与格物致知——仿王小波的文风我在自习室看操作系统的情形是这样的，我的双手在键盘上飞舞(这是用vim模式的情形，如果是emacs，那得加上脚踏板用于操作ctrl键)，埋头于文山题海，但同时心里免不了犯疑惑，有人说操作系统和编译原理是计算机的内功，我看此事不假，因为我写着写着不免面红耳赤，这是走火入魔的征兆——如果这时做笔记是初中的我就会这么说，但现在的我接受过高等教育，当然不能这么封建迷信​事情很有可能是这样的，我看得入了迷，大脑高速运转，如果你和我一样学过计算机就知道大脑就是人类的cpu，所以它大量发热，传导到了整个头颅​我在自习室看操作系统的情形就是这样，现在我得讲讲我上厕所的事，读者看到这里可能要诧异，这和操作系统有什么关系？具体情形是这样的，我喝多了水，就不免上厕所，操作系统进行大量文件IO，也不免要清理碎片，这两者也有着相同的道理，于是我推开自习室的门去厕所，这解决了我的生理问题，还解答了我之前的疑惑，原来我不是走火入魔，而是教室有人开了空调，这是我才懂了朱子格物致知的道理，朱子说阴盛的地方就会产生阳气，冬夜的自习室就会有人开空调，这岂不是印证了他老人家的高论，这不免又让我想到这洋人的二进制，原来也是出自阴阳两行的学问​这让我飘飘然的同时也让我有些困扰，因为我数学还算马马虎虎，但语文一道却不大擅长，如果考我格物致知和编程的关系云云，未免答不上来 卫公是众所周知群臣里最聪明的人，圣上对他说，爱卿，修建国都这件事，还得你来操办。于是卫公就从国库申请了三马车的草纸，用来操办这座新城市长安。卫公一开始考虑的是用一砖一瓦作为长安的基础，在他的设想下，砖瓦会自由地组合成墙壁和柱子，变换成各种拓扑学上的形状，但要维护平面图就很需要费脑力，卫公不得不发明出一种高效的算法避免可能的循环道路或者非连通图，这是因为大唐的计算机是人力拉动的，当时是建国初期，大家都吃不饱饭，算力很低。这种算法很好，惟一的缺点是需要许许多多像卫公一样聪明的人来维护，因为在这种设想下的长安城，早上群臣上班时一个样，晚上所有人待在自己家里不能出去闹事时又是一个样。圣上想要出门还要让卫公写出当时的道路地图。卫公把这个方案拿给圣上看，圣上对他说，这样一来，朕怎么管长安城呢于是卫公只能回家去，再申请了三马车的草纸，卫公发明了一种高效的解释型编程语言，这个意思是说，如果圣上对皇上圣明机(这是卫公发明的计算终端)说，把宫里的墙往外移一里，长安城就会花上不定的时间(取决于拉动计算机的民夫的力气)，算出一个宫城外扩一里的新长安，卫公还想出了一个验明使用者身份的哈希算法，确保只有有资格的人才能操作终端。卫公把这个方案给圣上看，圣上很高兴，当晚他就回到宫里试用皇上圣明机，并且移除了卫公的管理者权限。这点让卫公日后非常痛苦，像所有聪明人一样，做完圣明机beta版后他又发现了几处需要修复的bug，但没想到想修复的时候已经无法登陆了。卫公做梦也没想到自己精心编写的登陆功能会有这么严重的问题，圣上告诉他，爱卿设计长安城多有劳心，应该回家休息了。卫公当时是如此的伤心，以至于他回家后好几天才想到圣上的意思。于是卫公只能带着对自己的怀疑回到家里，深避不出。卫公回家休息的情形就是这样。你可以想象，在这之后的长安城会是什么样的，如果你无法想象，那就去小县城的公厕看看，这样你就知道一个缺乏维护的系统是什么样的。 小波说他曾经为了给电脑装什么新零件通宵捣鼓了一个晚上，从这件事就可以看出小波对计算机比我更狂热，不管硬件还是软件还真没有让我放弃睡觉去搞的​当然，换一种方式来考虑，小波那会硬件远比现在贵，加上他也没什么钱，导致他老婆不许他在这上面花太多钱，在有限的预算里做出最好的效果，理工科人看到这种问题基本都会热血沸腾，夜不能寐​总之，我想说的是，约学习工科就越感觉到小波在工科上也是奇人一类的人物，让我有种跨越时空的共鸣感 小波说如果他要去荒岛待十年，只能带一本书，就会带高等数学习题册，对此我深有同感，不过小波的意思是这些题目够他消磨一辈子时间，小波的数学水平应该比我高，所以对我来说这点也相同，而我的想法是，除此之外，做题是我坚持最久的事情，从幼儿园开始做到现在，一看到做题这两个字我就有千言万语，因此，带一本习题册也能防止我语言能力退化到野人水平 我不知道小波读书的时候数学课里离散部分的内容有多少，但他既然是代码高手，就肯定对二进制不陌生，在阴阳两界里他描述了两个世界，对这件事可以这么理解，要表示信息就要用不同的状态，也就是至少是二个，这种划分就意味着，想表示信息，最小的划分就是二分，真假，包含不包含，这种逻辑信息可以用二进制表示，同时，二进制也可以编码解码出大部分信息​阴阳是两个状态，也只有两个状态，只要是整数就可以用这两个状态进行组合来表示，因此，哪怕有345个世界，也可以用阴阳两界表示​但只有一个状态则无法表示任何个数以外的信息，因此，阴阳不能多也不能少，王二似乎不喜欢阳界，但阳界也是必须存在的​总之，这未必是个单选，也可能是组合，通过组合就能表示无数种信息，阳阴阳，阴阳阴，都有可能，小波在这里很狡猾，他只告诉我们这篇小说用了二进制，没告诉我们是什么规则的二进制","link":"/cyberblog/2024/01/20/%E6%88%91%E4%B8%8E%E5%B0%8F%E6%B3%A2/"},{"title":"呓语","text":"有些人想让你跟随他们的步调，想让你的尊严被踩踏碾碎，想磨灭你的意志，折磨你的头脑但不要忘记你拥有的理性和智慧，还有刻骨铭心的仇恨，总有一天能反攻倒算的","link":"/cyberblog/2024/02/22/%E5%91%93%E8%AF%AD/"},{"title":"道德和工程","text":"面对绝境，是什么也不做，还是做些尝试，尽管这个尝试会让情况更糟甚至让你自己成为这个绝境的元凶，从而实质上是道德的恶行；在我看来这取决于，你愿不愿意将道德问题纳入工程问题的范畴，因为在工程看来，达成目标是唯一目的，即使这目前看上去不可能，但在试错的过程中，依旧可能发掘出更先进的技术，从而实现目标​在我看来，在一个合适的模型下，工程最佳实践就是道德最佳实践，或者说，可以纳入道德体系之中，可以称为善，而探索最佳实践的过程就是一种善行，即使这个过程中造就了更多惨剧，甚至让自己反过来成为了这个模型失败的根源，评价系数更差了，这也是工程的必要代价​推导是这样的，从当前这个起点，到最终目的，由于物理限制，只有有限种行动，如果存在解，那么每试一次错，就排除了一种错误解，因为这里讨论的是一个相同的问题，至少面对相同问题的后来者能排除一个错误解，相比什么都不做，这是更好的行动。否则呢，绝对没有解，那么做什么也没有区别。如果说贸然行动会让情况劣化呢？那么首先，至少后来者不会重蹈覆辙了，其次呢，还是同样的问题，主观上你不可能真的知道一个工程问题是不是绝对无解，说不定会有更强大的技术出现，让绝对无解的问题可解，可能物理数学上有新的理论，让曾经的物理极限不存在​总之，我认为道德问题就是工程问题，工程问题则必须试错，无论试错带来多么沉重的结果，也是一种积极行动，哪怕像诺贝尔一样害死家人，这也是工程上的善行","link":"/cyberblog/2024/02/17/%E9%81%93%E5%BE%B7%E5%92%8C%E5%B7%A5%E7%A8%8B/"},{"title":"关于中式教育的杂谈","text":"如果你跟做题家说，你现在做题做到高度近视，脊柱侧弯，肠胃病颈椎病各种病，但是没事，等你从象牙塔卷出来就可以住大豪斯，娶/嫁个漂亮配偶，而快乐教育的小孩长大后给你当保姆做家务，这种愿景虽然庸俗物质且不道德，但至少能说公平，问题在于，就现在的经济形势来看，几乎不可能吃了做题的苦就不用吃生活的苦，而是都要吃一遍，当然，就算这样可能依旧比“快乐教育”的中专更好，但这依旧是一种欺骗你可能说教育体系从来没有许诺做了题就有大豪斯，但公正地说，真的有很多小孩做题是自己感兴趣或者为了中华之崛起吗？庸俗物质的价值观在这片土地上一直是主流，虽然这个主要责任是家庭教育，但学校往往也推波助澜或者放任自流，校长要kpi，老师只是拿工资的，管不了家长怎么想，信不信老师拦着小孩开卷家长还得投诉，考虑到经济发展水平，这种价值观也不一定要批判，然而，让心智不成熟的未成年人承担这套价值观下出人头地的希望，无疑会导致很多悲剧所以说，直接的问题是，大豪斯的希望是真的很难了，但做题的痛苦却越来越重了，过去几十年的高考导向培养出了一个愈发精密高效的做题流水线，这个结论缺乏数据支持不够精确，这里只是说说我自己的视角本人是教育大省江苏出身，现在就读于一所普通的211，在我看来，这个体系有不少毛病，但也没有罪大恶极到必须完全推翻，有老师或者校长用这种为了升学不计一切代价的机制pua学生，但也有老师在严酷的体系下尽可能地留给学生一些温情，其中辛酸只能说冷暖自知，客观地说，结果是这个体系给了我比较宝贵的专注力，对成体系的问题的解决能力等等中国学生不陌生的能力，以及一大堆心理问题还有脊柱侧弯与近视以江苏而论，老生常谈的内斗+内卷大省就不多说了，在我看来江苏以遍地开花的县中式教育成功地展现出一个做题流水线应有的样子，就像我后面在编程里学到的工程模式，什么高内聚低耦合之类的工程思想都有体现，然而人并不是机器，这种模式会对心理造成不可避免的负担，而且宏观地说，这种负担是越来越重的，因为重点高中的老师往往是同一批人，经验越来越丰富，就越可以总结怎样去更好地压榨学生的学习能力。知乎上经常批判人情世故，我可以肯定地说，在江苏说得过去的高中里，没有人情世故，学生和老师，老师和老师之间都没太多感情，只有精密的科学统计和规划，以排名分数为唯一导向，这是一种残酷的绝对公平，大部分老师不是感情上讨厌你才批评你，只是想要你拿更高的名次而已，当然私下的送礼也是有的，但如果因为这个耽误了尖子生的排名，等着校长收拾你吧正如我在前文所说的，愿意这样卷的学生多半是出于家长意愿与“吃得苦中苦，方为人上人”的自我洗脑，其他动机不可能让他们能承受这种规模的压力和痛苦，老师也一样，他们一样受苦，但重点中学的工资和灰色收入确实高，所以他们也扛下来了所以你如果问我值不值得，我只能苦笑，因为真不好回答，我个人觉得即使是出于应试目的，逼出心理问题也不利于临场发挥，但没办法，军备竞赛就是这样，如果真有大豪斯，我可能会觉得不是不能接受吧，就像祥林嫂想守贞不改嫁，最后也从了。然而这个梦在目前的经济形势下破碎了，留给我的只有脊柱侧弯和近视眼，我曾经让自己魔怔地去向往以后的大豪斯，嗯造山珍海味之类的场面，如今它们化作回旋镖打了回来，是我自作自受吗？或许只能这么想这个锅不能全让教育背，是个更宏大的问题，某种程度上说应试工厂是面对14亿贫富不均人口的权宜之计，如果你想提出一个替代方案，就得想想怎么处理这个规模的复杂问题，在我看来这个体系的大框架可以留着，但细则得全改掉，大的比如说京爷沪爷的婆罗门待遇，小的比如说定期心理辅导，一旦有疑似崩溃迹象，强制休息一周，家长反对也要依法执行这是说的中式教育的前半部分，从选专业到本科及高等教育呢，这部分我也有不少想说的，但我想大部分大学生们应该都知道我想说什么，如果你好奇，可以搜搜交大生存手册，其中的第一页就能概括我的意见","link":"/cyberblog/2024/02/11/%E4%B8%AD%E5%BC%8F%E6%95%99%E8%82%B2/"},{"title":"一些关于游戏的想法","text":"不管是魔幻还是科幻，都会需要一些“怪人”形象，这可以细分为几种，一是玩家看着怪，对剧中人来说习以为常，而是游戏内外都很怪，三则和第一种相反，比较少见​塑造怪人是很考验功力的一件事，讨巧的方法是一种莫西干头式的怪，比如大街上看到这种发型，肯定很吸引人注意力，但烫这个发型的很可能也是个普普通通的社畜，偶尔放飞自我罢了，这不是一种成体系的怪，只是一个点，但只要戏份不太多，这种角色也是效果不错的​成体系的怪就比较有意思，比如异度风景的痛苦女士，编剧很可能是把权力，统治之类的概念提取出“痛苦”这个关键词，因此痛苦女士严酷而公平地统治整个法印城，这是一整个体系，法印城需要维护阵营九宫格，为此痛苦女士既要打击邪恶也要打击善良，可谓事务繁忙，而且这种设定还可以产生其他互动，比如夜巫就说严酷的皮囊下是个疲惫不堪的灵魂，渴望从重任中解放​这种成体系的怪就更有意思，可以衍生出一系列其他的故事，但设计这种人物很花精力，把太多个性强烈的人物组织起来就更麻烦​比较常见的手法是夸张化，比如魔幻比较喜欢的概念具象化，什么正义的具象化图鲨恶人之类的情节实在是太经典了，或者把其他领域的概念化用，比如科幻里设计个魔法师角色，魔幻里乱入个科学怪人​此外也有些邪道方法，但之所以是邪道，就是因为第二次用就没意思了，所以能发明邪道方法的人对后人来说没什么意义，虽然很天才，什么时候我也能发明一种呢 只看无名氏与失宠的告别，感觉就像wrpg史上最动人的感情线，但本作从始至终都是一种朦朦胧胧的状态，主要是诅咒城收束得太差了，只看诅咒城那段又可谓史诗级的灾难项目管理，而结局又收束得不错​所以PST分开来说，前中期神作，后期烂作，结局佳作，合起来什么样就很难说，我觉得诅咒城那段不放也毫无问题，除了续作可能能用上部分设定，但随着老黑岛解体，无名氏和失宠只能成为老玩家的永远意难平了​回顾地看PST的结局也没好到不能出续作的程度，甚至还挺适合做个无名氏赎罪篇的，加个设定为了赎罪舍弃所有前世战斗能力加入战场之类的，但可惜的是历史没有如果，就像极乐迪斯科也败给资本一样，黑岛虽然也是“资本”，不过很明显他们还是被理想所困输给了现实 奇异人生这类游戏就属于感情有余，技巧不足的类型，如果你此类玩的不多，打到结局时多少会有点感动，下意识地觉得这故事真好，但如果你感动完了再回忆一下，就会觉得这故事漏洞是不是有点多，发展是不是太唐突了​不过我脾气还是太好了，所以不觉得这是被骗了，只是默默地决定下次不能被蒙蔽了​不过相比技巧，玩家更愿意为了感情花钱，这倒是颠扑不破的真理","link":"/cyberblog/2024/01/27/%E6%B8%B8%E6%88%8F%E7%B1%BB%E6%9D%82%E8%B0%88/"},{"title":"天堂","text":"-嘿，伙计，怎么了？你不跳舞吗？-额，根据我之前得到的一些信息，我倾向于认为，这里在学术上，被叫做，天堂？-啊，的确如此，这里是电子乐和舞曲的天堂，你知道，trance,disco……什么都有，其实一开始分得更细，不过后来嘛，财政不景气，就混到一起了，但我们依旧能跳舞，你不喜欢舞曲吗-不-你一定是走错路了，我听说引路办也裁员了，那么你是哪派？金属，摇滚，还是古典，美声，民族？-其实，我对音乐没什么兴趣-哦，这倒是奇怪了，能告诉我一些你的事吗，或许我可以帮忙，你的职业是？-电脑工程师-这倒是很少见，我是说，自从来天堂的条件变了之后-怎么变的？-一开始是由天使裁判，但权力总是导致腐化-我不知道这里还能收受贿赂-哦，你可能不知道，这里有语言上的腐败，开始的那几个天使总是把油嘴滑舌的放进来，这样的人多了后，我们的主很生气-所以换成了什么标准？-后来我们开始论心，心灵纯净的人就能进来，据我所知只有这段时间工程师能进来，无意冒犯-这，我倒是不奇怪，但后来呢-后来，唉，我也不太清楚，那段时间管理很混乱，主认为这样下去不行，所以又改了，标准是论迹，做得好事够多就能进来，这种特招，填补了管理上的不少空缺，当然，也有不少麻烦，你可能能猜到是什么-好吧，所以现在不放工程师进来？-这，无意冒犯，据我所知你们这类职业干得好事不多-哦，所以我们的创作物的恶行也算在我们头上？-至少，我们这是这么看的。-好吧，或许我的确来错地方了，或许地狱才是我该去的地方，至少那里我的同类不少-确实，有这么多人才供给，那边的基础设施应该会比我们发达-敢问您的职业是?-人事主管-据我所知这个职业道德水平也一般-这，我没告诉你我是第一个阶段进来的吗？不过我改过自新了，真的-所以我要怎么下地狱？人事主管笑了笑，“我们的音响有点问题”于是工程师调试了一下音响系统，他如愿以偿地以创造不良诱惑为由被天堂驱逐了","link":"/cyberblog/2024/01/30/%E5%A4%A9%E5%A0%82/"},{"title":"我不堪的过往,久扰我心的噩梦,是时候做个决断了","text":"宪法部分宪法是集中反映一国政治力量对比，确认和保障国家民主制度的国家根本法1宪法规定的内容与普通法不同2法律效力与普通法不同3宪法制定和修改程序与普通法律不同，有全国人大常委会或1/5全国人大代表提议，并由2/3代表通过，其他只需过半数宪法体现阶级力量对比关系宪法历史1954（很好）1975（极左错误）1978（不完善）1982（现行宪法）根本任务：集中力量进行社会主义现代化建设立国之本：四项基本原则强国之路：改革开放坚持四项基本原则的核心：坚持中国共产党的领导工人阶级的领导是人民民主专政的根本标志根本制度：社会主义制度 政权组织形式：人大制度（根本政治制度）原则：民主集中制度优越性：1保证我国人民当家作主，管理国家的地位2充分保证国家权力的集中实行3有利于调动中央和地方的积极性选举制度基本原则：1普遍性2平等性3直接和间接选举并用（县与县以下直接）4无记名投票5代表向选民或原选举单位负责并受其监督6法律和物质上保障选民选举权（选举经费国库支出，行政或刑事处罚破坏选举者） 中国人民政治协商会议是爱国统一战线组织，团结和民主为两大主题中共领导的多党合作与政治协商制度是一项基本政治制度合作政治基础：坚持中共领导，坚持四项基本原则（参政党）政治协商：对重大决策重大问题在决策前和实施前进行协商 民族平等是党和国家解决民族问题处理民族关系的基本原则，也是民族团结互助的基础与前提政治，经济，文化都有平等民族区域自治是一项基本政治制度1聚居区域实行2分为自治区州县3有实行区域自治的公民担任负责人4自治区人大各民族都有适当名额代表5自治机关按宪法和法律刑事国家机关职权与自治权6自治机关是地方政权机关，是有高度自治权的一级地方政权7维护国家统一与法律，有权采取特殊措施加速发展是民族自治与区域自治的有机结合 生产资料的社会主义公有制是我国经济制度的基础社会主义公有制两种形式：全民所有制，劳动群体所优质（由我国生产力状况决定）国有经济（社会主义全民所有制经济）是国民经济主导力量劳动群众集体所有制经济是集体经济组织内的劳动共同占用生产资料的一种公有制作用：发展日用品工业，满足人民生活需要，扩大劳动就业集体经济劳动者有权经营自留地，山（集体所有），家庭副业，饲养自留畜城市图为国家所有，农村郊区除法律规定为集体所有国家为公共利益征收土地给予补偿 基本经济政策：公有制为主体，多种所有制经济共同发展 我国个体与私营经济特点1产权明晰，自担风险2发挥劳动者积极性3经营灵魂，有很强适应力4利用合理配置资源5推动经济增长党的十五大明确邓小平理论是党的指导思想，确定我国将长期处于社会主义初级阶段国家保护非公经济合法权利，鼓励支持引导非公经济发展，并对其实行监督和管理对外开放是一项长期基本国策分配制度：按劳分配为主题，多种分配方式并存的分配制度 国家保护公共财产和工贸私有财产权，可以征用或者征收并给予补偿 发展国民经济的基本方针1在发展生产的基础上逐步改善人民生活（社保）2建立和完善社会主义市场经济体制（加强和完善宏观调控）3企业依法享有自主权和实行民主管理（国有员工代表大会，集体选举罢免管理人员） 物质，精神，政治，生态，社会文明五位一体经济建设为中心，不断加强物质文明建设坚持党的领导，人民当家作主和依法治国（根本是依宪治国）统一起来发挥知识分子在五个文明建设中的作用公民是法律概念，是有一国国籍的人，人民是政治概念（相对敌人）是国家权力的拥有者，是民主的主体我国公民基本权利与义务特点：广泛性，真实性，一致性，平等性广泛：享受权利的主体广泛，公民享有权利范围的广泛（政治，经济，文化与人身，境内非公民也可相声人权）真实性：一定能实现一致性：权利与义务的统一，相辅相成，体现国家集体与公民利益一致性平等性：享受权利和履行义务平等 国家尊重和保障人权，是宪法的根本目的和最高原则，是宪法法律得以存在和发展的前提，基础和归宿，也是衡量是否真正实行限制的根本标准 公民基本权利1政治权利与自由（选举和被选举，言论出版集会结社游行示威）2宗教信仰自由3人身自由（狭义指公民的人身不受非法拘捕限制搜查审问和侵害广义指人格尊严，住宅不受侵犯，以及通信自由和通信秘密）4批评控告检举揭发和取得赔偿5社会经济权利（财产权，劳动权，休息权，退休人员保障权和物质帮助权）劳动者的物质帮助权，指劳动者丧失劳动能力是，有从国家得到物质帮助的权利6文化教育权利（受教育的权利与义务）科学研究，文学创作与文化活动7妇女的群里和婚姻家庭，母亲儿童和老人受国家保护（男女同工同酬，培养选拔妇女干部）8华侨归侨和侨眷的正当权利（政治避难） 基本义务1维护国家统一民族团结2遵守法律，保守国家秘密，爱护公共财产，遵守劳动纪律，公共秩序，社会公德3维护祖国安全荣誉和利益4保卫祖国，依法服兵役，参加民兵组织5依法纳税 国家机构：统治阶级为了实现国家权力而建立起来的一整套国家机关的总称我国国家机关是实现人民民主专政的工具国家权力机构：人大及其常委会国家行政机关：国务院；地方各级人民政府（包括自治权政府）国家军事领导机关：中央军事委员会国家监察机关：国家/地方监察委员会审判机关：人民法院：最高/地方/专门监察机关：最高/地方各级/专门人民检察院基本原则：民主集中制原则：其他国家机关由权力机关产生，对它负责受它监督地方服从重要，下级服从上级法治原则群众路线选择：从人民利益出发，按人民利益办事效率和精简的原则（工作责任制） 全国人大代表：省，自治区，直辖市人大及人民解放军代表组成每届任期五年，届满两月前选举，常委会2/3通过可推迟选举，常委会或1/5人大代表可临时召开全国人大全国人大权利：1国家立法权，修改宪法，制定其他法律2监督宪法实施3决定选举罢免国家领导人4决定国家重大问题5其他职权 全国人大常委会是全国人大常设机关，任期与全国人大相同，正副委员长不得连任职权：1解释宪法和监督宪法实施2立法权，制定应由全国人大制定法律以外的法律3监督权4任免权5国家重大问题和外事工作决定权6规定和决定授予勋章和荣誉称号的权力 人大代表权利与义务1人身自由受特别保护，非法定程序不得逮捕或审判2人大会议发言和表决不受法律追究3模范的遵守宪法和法律，保守国家秘密4与原选举单位和人民保持密切联系，听取人民一件，为人民服务5接受原选举单位监督 主席职权：向全国人大提名国务院总理人选根据全国人大与常委会决定，公布法律，任免国务院授予国家勋章和荣誉称号，发布特赦令动员令，宣布战争，代表共计国事活动，接受外国礼节，根绝人大决定派遣召回驻外全权代表，批准废除与外国条约和重要协定 国务院（中央人民政府）实行总理负责制（首长负责制），国务院总理处于主导地位，对国务院负全部责任，有完全决定权国务院职权：规定行政措施，法规；向全国人大提出议案，规定领导各部门工作 国务院各部各委员会实行部长，主任负责制，国务院设立审计机关，对各部门和地方政府收支进行监督，不受其他机关团体个人干涉 中央军事委员会实行主席负责制，对全国人大和常委会负责 省，自治区，直辖市，自治州，设区的市的人大代表由下一级人大选举，受原选举单位监督，县以下含县直接选举 地方人大职权：1保证宪法，法律，行政法规的遵守执行，改变本级人大常委会不适当决定2审查批准该区域发展计划3选举罢免本级行政长官4制定地方性法规县以上人大常委会：1决定区域重大事项2监督政府，监察委员会，法院，检察院工作3撤销政府不合适决定4撤销下一级人大不合适决定5决定工作人员任免6闭会期间，罢免补选上一级人大个别代表地方各级政府实行省市区乡镇长负责制县以上人民政府设立审计机关，对本级政府和上一级审计机关负责 监察委员会不是行政/司法机关，是实现党和国家自我监督的政治机关国家监委领导地方，上级领导下级任期与本级人大一致监委独立行使职权，不受其他机关干扰，与行政，检察执法部门相互协调制约1对公职人员实施廉政教育2对职务违法和职务犯罪进行调查3对违法公职人员做出政务处分决定4涉嫌职务犯罪，将调查结果移送人民检察院依法审查提起公诉检察机关行使权力有权依法向有关单位和个人了解情况收集证据有以下情形的可以留置特殊场所1案情重大2可能逃跑自杀3可能串供或者伪造隐匿毁灭证据4可能要其他妨碍调查行为5行贿犯罪与其他共同职位犯罪受监察人员公务员与政府机关人员，依法委托管理公务的人员，国有企业管理人员，公办单位人员，基层群众性自治组织管理人员 最高人民法院对全国人大及其常委会负责并报告工作，地方人大对产生它的人大及其常委会负责并报告人民法院使用本民族语言诉讼1依法独立行使审判权不受行政机关干涉2除特别规定，公开审判3两审终审，指案件可以经过两级人民法院审判终结的一种制度当事人可以上诉上一级人民法院，同级人民甲醇钠哈院也可向上级人民法院抗诉，中高最高人民法院的二审，嘴个人民法院的一审都是终身的判决4使用本民族语言诉讼5集体领导只（包括合议制和审判委员会制）一审除规定外，由审判员和人民陪审员组成合议庭进行二审以旅游审判员组成合议庭进行审判委员会实现民主集中制 法律监督机关：人民检察院职权1对叛国案等严重破坏国家的法律政策统一实施的重大案件行使检察权2对直接手里的刑事案件进行侦查3对公安侦破案件审查，决定是否逮捕起诉或免予起诉，监督公安部门侦查活动是否合法4对刑事案件提起公诉，对人民法院审判是否合法进行监督5对刑事案件裁定的执行和监狱看守所是否合法进行监督，对民事和行政诉讼进行监督总结：法纪监督，侦查监督，审判监督监所监督 分为最高地方和专门有同级人大选举，地方检察长任免需要报上一级检察长提请该级人大常委会批准双重领导制（上一级检察院和本级人大及其常委会）检察长统一领导，设立监察委员会，如果检察长不同意多数人决定可以报请同级人大常委会决定工作原则：1实事求是，群众路线，重视证据不亲信口供，忠于真相，忠于社会主义和人民2对任何公民适用法律上一律平等3独立行使检察权 我国宪法的制定权和监督实行权是全国人大行使的，体现全国人大全权性和人民最高权力全国人大有权撤销全国人大常委会不适当决定，国务院同宪法抵触法规有法必依执法必严违法必究 党的领导是保证宪法实施的关键一切党组织和党员的活动都不能和国家的宪法与法律抵触民法部分民法调整的财产关系只平等个体在商品生产，分配，交换，和消费过程中发生的社会关系（所有权，债券和知识产权的财产权关系）民法调整的人身关系指民事主体的人身不可分离而又不具有直接经济内容的社会关系民法只调整横向财产关系基本特征：1当事人在法律上地位平等2在经济利益上一般是等价有偿的3意思表示上是自愿的我国民法基本任务是：通过调整平等主体之间的财产关系和人身卦象你，保护自然人和法人的民事权益，维护社会经济和民事生活秩序，促进经济体制改革的顺利进行和社会主义市场经济的发展，促进社会安定团结和社会主义精神文明建设米饭基本原则1民事权益受法律保护（基本精神）中心任务：构建民事权利体系，弘扬司法自制，强化对人格尊严价值的保障2主体的法律地位完全平等3意思自治（自主决定自己的事务和民事行为）4公平原则（合同领域：等价有偿，情势变更和显示公平）5诚实信用（最高原则）6符合法律和公序良俗7绿色原则三要素1主体：自然人和法人民事权利能力：国家赋予民事主体可以享受权利和承担义务的一种资格2客体：主体间权利义务指向的对象3内容：民事主体间就一定的客体发生的权利义务关系 法律事实：法律规定能引起民事法律关系发生，变更或者终止的客观情况分为两大类：事件（不依赖与主体的意志活动和行为而发生的客观事实）行为（以当事人意志转移的作为或不作为）行为分合法与不合法自然人的出生：胎儿和母体完全分离并能独立呼吸自然人的死亡分为自然死亡（心脏停止跳动或呼吸停止）宣告死亡首先以出生证明和死亡证明为准，没有的，以户籍和其他有效身份登记的时间为准，有证据能推翻以上记载的，以证据为准自然人不能限制转让抛弃自己的民事权利能力 宣告失踪：下落不明满两年下落不明：被宣告人的住所护具所未能获得其消息分一般期间和特别期间前者以失去音讯之日起算，后者从战争结束之日或有关部门缺点下落不明日起算亲属为做此项宣告的利害关系人，人民法院宣告受理后，发出三个月的寻找下落不明人公告，届满做出宣告失踪或者驳回申请的判决宣告失踪只涉及财产管理，失踪人财产由配偶，成年子女或父母代管，或指定管理人，应付费用由代管人从其财产支付不影响婚姻关系 失踪人重新出现（确知下落也算）经本人或者利害关系人申请，人民法院撤销失踪宣告 宣告死亡下落不明满四年（战争结束之日起算）意外事故下落不明满两年（事故发生之日起算）利害关系人可以申请宣告死亡意外事故若经有关机关证明其不可能生存，则申请宣告死亡不受两年时限限制申请受理后发出寻找失踪人公告（一年，意外事故证明不可能生存为三个月）届满后人民法院宣告死亡或者驳回申请宣告死亡的判决日视为死亡日期，因意外事故下落不明，事故发生日视为死亡日期财产发生继承关系，婚姻解除重新出现后铲恒财产恢复效果，原则上返还原物，无法返还给出适当补偿，尚存配偶与别人结婚不得异议，配偶未婚，且未向婚姻登记机关作出书面声明不回复婚姻关系，则恢复原婚姻关系被宣告死亡但未死亡的，不影响期间其民事法律行为效力目的在于保护被宣告任何善意第三人的利益自然人的民事行为能力：自然人得依自己的意思表示，通过自己独立的行为，取得民事权利和设定民事义务的能力，因而不是一切人都具有的16周岁以上18周岁以下以自己劳动收入为主要生活来源的视为完全民事行为能力人8周岁以上未成年人或达18周岁但不能完全辨认自己行为的，是限制民事行为能力人，可独立式是纯或利益的民事法律行为，与其年龄智力适应的民事法律行为不满8周岁和不能辨认行为的就是本人是无民事行为能力人，由法定代理实施民事法律行为 建沪指监护人队无民事行为能力人和限制民事行为能力人的人身财产与其他方面的合法权益进行监督和保护的制度法定监护指监护人由法律直接规定产生的监护未成年人——父母-祖父母-兄姐-经所在地的居委会村委会或民政部门同意的自愿个人组织担任监护人成年人——配偶-父母-成年子女-其他亲属-经所在地的居委会村委会或民政部门同意的自愿个人组织担任监护人没有有监护资格的人由民政部门，村居委会担任，当事人不服可向人民法院申请指定监护人，或直接向人民法院申请指定意定监护，指有完全行为能力的成年人，与近亲属或愿意担任监护人的组织或个人事先协商，以书面形式确定监护人，在丧失民事行为能力时履行监护职责 监护人除了为被监护人的利益外，不处理其财产 自然人以户籍登记或其他有效身份登记记载的居所为住所经常居所，指自然人离开居住地最后连续住满一年的地方，住医院治疗除外 法人指有民事行为能力和民事权利能力，能依法独立享有民事权利承担民事义务的组织基本特征：1依法成立2有财产或经费3有自己的名称，场所，组织机构4能独立承担民事责任法人分营利性法人和非营利性法人营利性法人不需要特别许可，非营利性法人需要依法登记和批准成立营利性法人必须依法登记，非营利性法人成立分为需要登记和不需要登记法人超越自己职能的民事行为无效法人中止：完成事业/目的，依法撤销，宣告破产自然人从事工商业经营，经依法登记为个体工商户（可以取字号）非法人组织指不具有法人资格，但可以依法以自己的名义从事民事活动的组织区别：不能独立承担责任，出资人设立人承担无限责任个人独资企业指在中国境内投资，由一个自然人设立，资产为投资人个人所有，投资人以个人财产对企业债务承担无限责任（投资人应以个人的全部财产用于清偿）的经营实体合伙企业指自然人，法人或其他组织依法在中国境内设立的有限合伙公司和普通合伙公司（有限合伙公司由普通/有限合伙人组成，普通合伙人承担无限连带责任，有限以认缴的出资额为限承担责任）连带责任（即债权人可对债务人中的一人，数人或全体，同时或先后请求全部或部分给付的一种债务形式）民事权利是由民法所确定的权利，是为了民事主体的特别利益提供的保障分为财产权利和人身权利人身权包括人格权和身份权，是以人身所体现的利益为内容的，与权利人的人身密不可分而产生的权利人格权是以人格利益为内容排斥他人侵害的权利身份权是基于权利人的特定身份而产生的权利财产权是指以财产利益为直接内容的权利，主体限于现实的享有或可以取得财产的人，包括物权和债权综合性权利是人身权和财产权结合产生的一种权利（知识产权，继承权） 民事权利的取得分为继受取得（通过法律行为从原权利人取得某种民事权利）和原始取得（最初取得或不依赖原权利人的意志而取得民事权利）民事权利可以根据民事法律行为，法律规定的事实和法律规定的其他方式取得民事法律行为指目的在于发生民法上的后果并加以意思表示为要素的法律事实，就是民事主体基于意思表示而设立，变更或终止特定民事权利义务关系的行为分类单方，双方，共同法律行为要式和非要式（需要有特定形式）诺成和要物（达成一致的意思表示，并有物的交付）有偿和无偿（对提供的服务或利益是否有相应支付）要件1主体有相应行为能力2意思表示真实3不违反法律法规和公序良俗无效民事法律行为：1无行为能力人实施行为2意思表示虚假3违法法律法规4违背公序良俗5恶意串通损害他人利益可撤销的民事法律行为：1基于重大误解实施2被胁迫实施3给予欺诈实施4显示公平的行为效力待定的法律行为1限制民事行为能力人依法不能独立实施的行为2无代理权人因无权代理实施行为3无处分权人因无权处分实施行为确定不发生效力后，行为人因行为取得财产因返还或折价补偿（按照所取得财产的价值进行折算，以金钱的方式对对方当事人予以补偿的一种责任形式） 民事法律行为附带条件必须是1现实有可能发生又不一定发生的客观情况2当事人意定而不是法定3不违背法律法规和公序良俗4不损害相对人利益 代理：以被代理人的名义，在代理权限内向第三人为意思表示或接受意思表示，其法律后果直接归属于被代理人的1产生的民事法律关系主体是被代理人2代理人必须独立为意思表示或接受意思表示3以产生直接法律后果为目的有人身性质不能代理分类：委托代理，法定代理，指定代理委托代理：代理人已被代理人委托进行的代理，以一定法律关系为基础授权委托书应有代理事务，代理人姓名，权限期间签名或者盖章复代理应得到代理人同意或者追认，紧急情况为了维护被代理人利益除外委托代理终止：1代理期间届满或事务完成2被代理人取消委托或代理人辞去3（被）代理人死亡4二者之一的（非）法人组织中止被代理人死亡后，代理行为有效：1代理人不知道并不应该知道其死亡2继承人予以承认3明确代理权在事务完成时终止4被代理人死亡前已经实施5为了被代理人利益继续代理法律直接规定的代理父母子女夫妻之间亲属关系互为法定代理人指定代理行政命令或法院裁定的代理 代理人不履行职责给被搭理人造成损害的承担民事责任，和第三人串通造成损害的，代理人和第三人负连带责任，第三人指导代理人无代理权，超越代理权仍未民事行为造成损害的，两者负连带责任 物权，指法定主体对物依法享有的支配权分为所有权用益物权担保物权特征：1支配性不借助其他人直接对物支配2对世性，权利主体固定，义务主体不固定3排他性（1有直接排除他人不法侵害的效力2同一物上不能设定两个内容互相冲突物权）4绝对性，不需要义务人积极协助，权利人合法支配行为就能实现物权分类一所有物权（完全物权），所有人依法对彩站享有占用使用收益和处分的权利其他物权（限制物权）：给予所有权产生的，非所有人人对他人之物享有一定程度的直接支配权二用益物权：以物的使用收益为目的的物权担保物权：以担保债券为目的，以确保债务的履行为目的的物权动产物权和不动产物权物权的效力一排他效力：同一标的物上不能同时存在两个以上内容不相容的物权，由支配性决定二优先效力（同一物物权和债权斌古村，物权优先于债权，先成立的物权有优先于后成立的物权的效力）源于对物支配权和排他性三物权的追及效力（标的物被不法占有，可依法向物的不法占有人请求返还原物，善意占有无权无偿请求返还）善意占有：占有人不知道且不应该知道自己没有占有的权利而占有四妨害排除效力（物上请求权）物权人于其物被侵害或被侵害风险时请求排除侵害或者防止侵害，以恢复物权圆满状态的权利 物权的变动，指物权的设立（为自己取得，为他人设定），变更（客体，内容部分变更），终止由物权法律行为和法律事实引起 1原始取得，根据法律规定取得物权，不以原所有人意志为转移的物权取得方法（生产，收益，征用征收，合法先占取得无主动产）2继受取得，以物的所有人意志为转移的物权取得方式 物权的消灭（特定主体的物权不复存在）1绝对消灭，物权与特定主体分离，他人未取得权利2相对消灭，与原主体分离归于新主体 要件1登记：主管部门在相关登记簿上记载物权变动情况（不动产物权经依法登记发生效力否则无效力）2交付以法律行为发生动产物权变动的，以交付为生效要件 物权民法保护一请求确认物权物体归属，存在发生争执时，当事人可以向法院提出诉讼请求确认二请求排除妨碍（可能）非法妨碍，可请求消除妨碍三请求恢复原状或者重做更换四请求返还原物五请求赔偿损失财产所有犬只所有人依法对自己的财产享有占有使用收益和处分的权利权利主体是固定的，义务主体是不特定的内容：合法/非法（善意/恶意，区分判定是否应该承担返还原物和赔偿损失的法律后果）使用可脱离使用者本人，非所有人行使收益指基于自己财产取得的法定孳息（物主出让所属物一定期限使用权所得到的收益）处分（最根本）决定财产是时尚和法律上的命运，使财产所有权消灭或转移不得损害他人合法利益 国家财产所有权是全民所有制在法律上的表现主体是中华人民共和国国家作为出资人投资企业法人只享有出资人权益客体有无限广泛性（资源，所有人不明埋藏物） 集体财产所有权是集体所有制在法律上的表现主体是劳动群众的集体组织特点：通过管理机构行使决定侵害集体成员合法权益可请求人民法院撤销 私人财产所有权储蓄投资及收益 业主对建筑物专有部分有所有权，公有部门有共有权和共同管理权利行使权利不得危害建筑安全，不损害其他业主的合法权益，共有部分承担权利履行义务，区划内道路业主共有，城镇共有部分除外绿地业主共有，可以设立业主委员会，自行管理建筑物和附属设施或委托物业公司，业主大会和委员会有权对损害他人利益行为压球停止危害赔偿损失共有关系的权力客体为同一财产或同一物共有人平等或按各自份额享有权利履行义务共有可存在于一种或几种不同性质的所有权中（只需不同权利主体）共同（共有人承担连带责任）按份共有人按份承担责任（份额可转让） 土地，土地上的自然物，相邻关系建筑物的相邻所有人在使用或经营这些相邻的不动产时，相互发生的权力义务关系一方使用经营自己不动产时有不妨碍对方合理行使权力的义务，有权要求对方不妨碍和侵犯自己权利的合理行使，相邻关系的这种权利称相邻权相邻权既是对相邻所有权的限制也是扩大 用益物权土地承包经营权是指农村集体组织，农户或个人对集体所有或国家所有集体使用的自然资源，按承包合同可享有的从事经营并获取收益的权利 农村集体经济组织实行家庭承包经营为基础，统分结合的双层经营体制农民集体所有和国家所有农民集体使用的土地，依法实行土地承包制度，承包期满可按规定继续承包宅基地使用权：农村集体组织的成员依法享有的宅基地（依法批准建造个人住宅的农村集体所有的土地）上建设住宅的权力地役权按合同规定利用他人不动产提高自己不动产效益的权力设立地役权应采取书面形式订立合同，未登记不能对抗善意第三人 债是按合同约定或法律规定，在当事人之间产生的特定权利义务关系，债权人有权享有请求债务人为或不为某种行为的权利，他方有满足请求的义务特征1权利/义务主体固定2内容表现为请求一定行为的能力和履行该行为的义务3债的标的可以是物，智力成果，行为（所有权只能是物）反映社会经济生活流通分配交换的财产关系所有权反映物质财富占有生产消费关系分类按主体人数分双方均一人：单一之债单方或双方多人：多数人之债按主体各自权利义务：按份之债，连带之债按标的物，标的物有特定化性质的叫特定之债，为种类物的叫种类之债按债务人行为是否可选择区分，只能一种行为是简单之债，可以选择的是选择之债按发生原因不同分合同制债和法定之债法定之债分侵权行为之债，不当得利之债和无因管理之债债的变更指债的关系再不是其同一性（已发生的宅一人存在）的前提下，变更债的当事人或债的内容（债权让于和债务承担）给付，读音jǐ fù，即债权债务所共同指向的对象标的物是指当事人双方权利义务指向的对象债的消灭：1因履行消灭2互相抵消3混同（债权和债务人合二为一）4判决5一方抛弃或双方协议免除6时效的完成 合同（契约），是平等主体的自然人法人其他组织之间设立变更终止民事权利义务关系的协议法律特征：1是一种法律行为，设立变更终止彼此权利义务关系2是一种协议，以互相间意思表示一直为条件3双方地位平等，不能强加意志给另一方4必须是一种合法行为当事人遵守诚实信用原则步骤：要约和承诺要约（发盘）乙方向对方提议订约，并提出合同的主要条款，以供对方考虑，如同同意即表示合同已经确定的意思表示（要约1内容具体缺点2表明经受要约人承诺，要约人即受该意思表示约束，可在未生效情况下撤回，撤回要约的通知应当在邀约到达受要约人之前或与要约同时到达受要约人，可在已生效情况下撤销，撤销要约的通知应在受要约人发出承诺前到达受要约人）承诺（接盘），指受要约人同意要约的意思表示应在要约确定的期限内或在合理的时间到达要约人承诺应与要约的内容一致可撤回，但撤回承诺的通知必须于承诺到达要约人前或同时到达要约人合同成立的时间地点在承诺生效的时间地点合同内容：1当事人名称姓名住所2标的，3数量4质量5价格报酬6履行期限地点方式7违约责任8解决争议的方法除特别规定外可采取口头形式效力：除规定要批准登记，成立时生效可附加条件/期限当事人应有相应的民事权利能力和民事行为能力以合法形式掩盖非法目的，损害社会，他人，国家利益的，一方以欺诈胁迫手段订立合同的，违法法律法规的合同无效，机遇重大误解订立的合同与显示公平的当事人可请求人民法院或仲裁机构撤销同时履行抗辩权指当事人互负债务没有先后履行顺序的应同时履行一方在对方履行前有权拒绝，一方履行不规定另一方有权拒绝履行要求先履行抗辩权指当事人互负债务有先后履行顺序的，先一方未履行，后履行方有权拒绝履行要求不安抗辩权指应履行一方如有确切证据证明另一方有以下情形的可拒绝履行要求1经营状况严重恶化2转移财产以逃避债务3丧失商业信誉4有丧失履约能力的其他情形终止履行时应及时通知对方，对方提供担保后恢复履行，未恢复履约能力且无担保可解除合同，没有确切证据终止履行的负违约责任合同经协商可变更或转让债权人不存在以下情况可转让（部分/全部）合同权利给第三人1根据合同性质不能转让2根据当事人约定不能转让3根据法律规定不能转让转让时应通知债务人（未通知不产生效力），债务人转让债务需债权人同意 担保可以以合同形式出现（从属合同，随主合同无效而无效） 1保证，保证人和债权人阅读，债务人不履行债务时，保证人按照约定履行债务或者承担责任的行为国家机关/公益事业单位社会团体/企业法人的分支机构部门不得为保证人分类：一般保证，债务人不嗯能够履行，保证人承担保证责任（主合同纠纷未经审判或仲裁，并就债务人财产强制执行仍不能履行前可拒绝承担责任）连带责任保证，保证合同中阅读保证人和债务人对债务承担连带责任的是连带责任保证保证方式没有约定或不明确的按连带责任保证承担责任2抵押，债务人或第三人不转移财产占有权将财产抵押为债权担保，债务人不能履行时，债权人有权依法以抵押财产折价或拍卖变卖价款受偿以下财产可以抵押：1建筑物与其他土地附着物2建设用地使用权3土地承包经营权4生产设备，材料，（半）产品5正在建造的建筑物船舶航空器6交通运输工具7未禁止抵押的其他财产不可抵押：1土地所有权2集体所有土地所有权3公益目的的事业单位机构4所有使用权不明或有争议的财产5依法被查封扣押监管的财产6规定不能抵押的其他财产应以书面形式订立抵押合同 质押动产质押：债务人或第三人将启动掺一脚债权人专业，作为债权担保，债务人不能履行是，债权人有权依法以抵押财产折价或拍卖变卖价款受偿权利质押：将自身权利出质为债权担保 留置债权人按约定占有债务人动产，债务人按约定期限不履行，债权人有权依法留置财产以抵押财产折价或拍卖变卖价款受偿留置权人应和债务人约定留置财产后的债务履行期间，没有或不明确应给两个月以上期间，不已报关的动产除外，逾期的可以协议折价或拍卖变卖价款受偿 定金当事人约定一方向对方给付一定金额，给付一方不履行债务无权要求返还，收定金一方不履行债加倍返还，定金不超过主合同标的额20%合同权利义务终止：1债务已按约定履行2合同已解除3债务相互抵消4债务人江标的物提存（债务人履行到期债务时债权人无正当理由拒绝受领或下落不明等原因无法履行债务，可依法将标的物送交有关部门代替履行） 双方协议一致合同可以解除：1不可抗力致使不能履行2履行期限届满前一方明确表示或以行为表明不履行主要债务3一方延迟履行主要债务，催告后合理期限内仍未履行4一方违约履行或有其他违约行为使合同目的不能实现5规定的其他情形权利义务关系解除不影响合同中结算和清理条款效力各负债务且标的物种类品质相同的，任何一方可将自己债务与他方抵消（法律不允许除外）标的物提存：1债权人无正当理由拒绝接受履行2债权人下落不明3债权人死亡未确定继承人或丧失民事行为能力未确定监护人的4法律规定的其他情形合同分类：1单务/双务合同（互有权利义务或一方有权利只有义务）2有偿和无偿（各因自己给付从对方得利/只有一方给付且不因自己给付使对方得益）3诺成和实践4要因和无因（财产给付是否以原因存在为前提）5要式和非要式（是否以一定形式程序来签订）6有名和无名（法律是否有规定）7主合同和从合同（是否独立成立或以另一独立存在的合同为前提且依附于他的合同） 法定之债侵权行为之债：行为人不法侵害他人财产权利或人身权利而使他人遭受损失时，行为人依法应承担的法律责任侵权行为法律特征：1对侵权行为人的法律制裁2加于不法行为人的一种法律责任（属于民事责任）3只针对不法侵犯财产权和人身权并致人损害设立，事先当事人之间并无债权债务关系 不当得利要件：1必有一方得利的事实2使他人受损害3得利和损害间有因果关系4得利致人损害没有合同或法律上的依据受损者有权请求侵权者返还不当收益不当得利者为债务人，受损害人为债权人（非债清偿/受领因不法原因所为的给付之中） 无因管理：没有法定或约定义务，为使他人利益免受损失而进行管理或服务的，有权要求受益人偿付为此付出的必要费用/有义务但超出义务范围管理构成要件：1有为他人管理事务的行为存在2尤为他人谋利益的思想3无法律和合同义务4管理他人事务以最适合与本人利益方法进行5尽早将管理行为通知本人 知识产权：个人或集体对其智力成果享有专利权特性：1专有性，特定主体享有，非经其许可，任何人不得非法使用其著作专利商标等谋取利益2地域性，一国取得只在该国境内有效3时间性。不超过法律允许的保护期限 著作权（版权）：授予作品不论是否发表的作者控制其作品出版复制和利用的一种独占权利（音像制品，电脑软件也受保护）自然人法人或其他组织对其创作作品依法享有的权利主体为作品作者或其他依法有著作权的自然人，法人或其他组织外国无国籍人根据作者所属国或者经常居住地国同中国签订条约或共同参与的国际条约依法享有的著作权受法律保护首先在中国境内出版的享有著作权未同中国签订条约或共同参与的国际条约首次在国际条约成员国或在（非）成员国同时出版的，受法律保护依法禁止出版传播不受法律保护自动取得：作品完成不经手续取得包括人身权（发表，署名，修改或授予他人修改权，保护作品完整权，不受歪曲篡改）/财产权（复制发行出租展览等） 署名，修改或授予他人修改权，保护作品完整权无时限发表财产权期限为作者死后第五十年12月31日（合作作者最后一位死亡起算）法人或组织享有的，期限为首次发表后第五十年12月31日创作后50年不发表不再保护侵权行为p151,152可不经许可不支付报酬p152 专利权：对某项发明创造享有的独占利益一项发明创造由发明创造人提出申请，经主管机关审核，确认其在有效期内对此项发明创造享有独占利益，就是专利权专利权主体1执行单位任务或使用单位条件完成的发明，单位是专利权人2非职务的发明人（为其实质性特点直接作出创造性贡献）3执行单位任务或使用单位条件完成的发明，发明人与单位与合同对专利权归属有约定的，从其约定4受让人，专利权的合法继承人没有固定居所，外国人/企业/其他组织也可在中国申请专利（所属国签订有关协议）中国单位个人向外国申请专利需向国务院专利行政部门作保密审查以下略刑法部分刑法有惩罚性和保卫性任务基本原则：1罪刑法定（法无明文规定不为罪）基本原则2平等适用法律任何人犯罪在适用法律上一律平等，不允许超越法律特权3罪刑相适应1确定科学刑罚体系2规定刑事责任年龄和刑事责任能力3根据犯罪形态的不同社会危害性规定了轻重有别的处罚原则4根据主观恶性程度，规定了一系列刑罚制度（累犯，自首理工，缓刑减刑假释）适用范围：中国境内，船舶和航空器内分类：1行为和结果在我国境内2行为在结果不在3结果在行为不在特别规定1有外交特权和豁免权的外国人刑事责任通过外交途径解决2少数民族的特别规定3港澳的有关规定4其他特别规定我国公民在境外犯罪，刑法规定最高刑在三年内以下有期徒刑的可以不予追究，国家工作人员和军人均适用 外国人境内犯罪一律适用，境外对我国公民犯罪，规定最低刑在三年以上有期徒刑的可以适用，犯罪地法律不予处罚的除外外国犯罪应受审判的已经受外国审判触犯的可以免除或减轻处罚我国参加的国际条约规定的罪刑，我国在承担条约义务范围内形式刑事管辖的，适用我国刑法我国刑法采用从旧兼从轻原则，刑法施行以前的行为，当时法律不认为是犯罪适用当时法律，认为犯罪且按追诉时效规定应该追诉的，按当时法律追究责任，刑法不认为犯罪或处理较轻的适用新法犯罪是阶级社会产物，统治阶级为了维护统治镇压被统治阶级的反抗，把危害本阶级利益的行为以国家的名义宣布为犯罪并施以刑罚我国存在产生犯罪的社会阶级根源，思想根源和外部根源犯罪定义p231犯罪基本特征：1具有社会危害性且达到一定程度（是行为不是思想）最基本有决定意义的特征2是违反刑法的行为，具有刑事违法性3是应受刑罚处罚的行为，有应受刑法惩罚性 犯罪要件：1犯罪客体2犯罪客观方面3犯罪主体4犯罪主观方面犯罪客体：刑法保护的为犯罪行为所侵害的社会主义社会关系分类：一般客体：一切犯罪行为所具有的客体反映一切犯罪的共同本质同类犯罪：同一类犯罪行为所共同具有的客体，反映该类犯罪的共同本质直接客体：各个具体的犯罪行为所特有的客体，反映具体犯罪的特别本质，是区分此罪和彼罪的主要根据之一犯罪对象是犯罪行为侵害社会关系时直接受影响的人或物犯罪的客观方面：犯罪的行为和这种行为引起的危害社会的结果表现形式：作为，不作为用积极行动实施我国刑法禁止的行为负有特定义务而又能履行义务得人，消极的不履行义务而造成危害社会的结果犯罪结果是否发生是划分犯罪既遂和未遂的标准犯罪行为和危害结果之间确实存在内在和必然联系时，才能使行为人担负刑事责任（否则客观归罪）犯罪主体：实施犯罪行为，对自己罪行依法应负刑事责任的人1实施犯罪行为的入（单位犯罪为行使主体负刑事责任，采取两法原则，对单位和主管人员与直接责任人员刑罚）2自然人作为犯罪主体达到刑事责任年龄（16周岁）满14不满18/满75/过失犯罪/又聋又哑/盲人从轻或减轻处罚3自然人作为犯罪主体，具有刑事责任能力醉酒犯罪负刑事责任一般主体：满足上述条件的犯罪主体特定主体：上述条件外还有特别身份主观方面：犯罪的主体对自己实施的行为及其可能引起危害社会的结果所具有的故意或者过失的心理状态（故意犯罪希望或放任发生）直接故意：知道有危害社会后果并希望发生间接故意：知道有危害社会后果并放任发生应当预见危害社会后果因大意没有预见，或已经预见但轻信能避免以致结果发生的，是过失犯罪（过于自信和间接故意）法律有规定才负刑事责任意外事件：主观上无故意也无过失，由不能抗拒或不能预见的原因引起 正当防卫：为了使国家，公共利益，本人或者他人人身财产和其他权利免受正在进行的不法侵害，所采取的制止不法侵害，而对不法侵害人造成损害的行为 应具备下列条件：1对不法侵害才能实行防卫2对正在进行的不法侵害行为才能防卫（已经开始或直接面临）3是对实施不法侵害的人才能实行防卫4不能明显超过必要限度（损害和保护的利益大体相适应）对严重危害人身安全的暴力犯罪采取防卫造成不法侵害人伤亡不属于防卫过当，不负刑事责任 紧急避险指为了国家，公共利益，本人或他人人身财产与其他权利免受正在发生的危险，不得已采取的损害法律所保护另一方利益的行为不负刑事责任条件：1为了国家，公共利益，本人或他人人身财产与其他权利遭到危险而采取的（法律保护的利益）2正在发生危险的情况下采取3采取的行动是当时唯一可以避免危险的行为4不超过必要限度，被损害利益小于被保全利益职务业务上有特定责任的人（锁单人的职务或从事的业务有同一定风险作斗争的责任的人员）不得因避免本人危险而实行紧急避险 区别：1正当防卫只发生在受到不法侵害的场合，紧急避险可发生在人的违法行为/自然力量造成的危险场合2正当防卫只施于不法侵害者，并使他受到损害，紧急避险是对第三人实行的，使其合法权益受到损害3是否是唯一可采取的方式4利益大体相适应和引起损害小于避免的损害故意犯罪过程指故意犯罪由犯罪的预备经犯罪的实施到犯罪完成的过程故意犯罪过程中的犯罪形态指故意犯罪在其发展过程中不同阶段所发生的犯罪行为的形态分类：1犯罪的完成形态（既遂）2未完成形态（预备未遂和中止）过失和间接故意犯罪不存在犯罪预备：为了犯罪准备工具制造条件的比照既遂犯从轻/免除处罚犯罪表示（只有思想）犯罪未遂：已着手实行犯罪，由于犯罪分子意志以外的原因而未得逞的特征：1犯罪人已经着手实行2未能得逞（犯罪意图未能实现）3由于犯罪分子意志以外的原因比照既遂犯从轻处罚（不可免除）既遂：犯罪人行为已经具备构成某一具体犯罪的全部法定要件以发生了犯罪人预期的危害社会结果为标志（或者有时候实施了某种行为） 犯罪的中止：犯罪过程中自动放弃犯罪或自动有效防止犯罪结果发生的前者条件：1犯罪过程中放弃（预备或着手实行阶段）2自动放弃（客观和主观认识上有完成犯罪条件，但出于自己意志停止犯罪行为）后者：必须有效防止犯罪结果发生中止犯没有损害免除处罚，有损害的减轻处罚共同犯罪：两人以上共同故意犯罪要件：1犯罪主体是两人或以上到达刑事责任年龄有刑事责任能力的人2必须有共同犯罪行为（指向同一犯罪目标，互相配合互为条件，对发生危害都有因果关系）3具有共同的犯罪故意（也要知道其他人和自己一起实施犯罪）共同过失犯罪不算形式分类：任意的和必要的（能一人单独实施，两人以上实施才构成犯罪）事前通谋和事前无通谋（是否在着手实行犯罪前形成共同犯罪故意）简单和复杂（两人以上直接实行犯罪/存在教唆实行帮助等分工）一般和犯罪集团（三人以上为共同实施犯罪而组成的较为固定的犯罪组织，包括一般和黑社会）黑社会性质组织特征：1形成较稳定犯罪组织，人数较多，分工明确2有组织通过违法犯罪获取经济收益，有一定经济实力3以暴力等手段有组织的多次进行犯罪活动4通过我发犯罪或利用国家工作人员的暴毙陈霸一方形成非法控制和重大影响，破坏社会经济生活秩序种类：主犯：组织领导犯罪集团进行犯罪活动或在共同犯罪中起主要作用的是主犯（集团中组织策划指挥的分子是首要分子，按集团全部罪行处罚，不得缓刑）可不止一人从犯：共同犯罪中起次要或辅助作用的（表现：提供犯罪工具，提供模板创造机会，排除账啊，隐匿罪犯罪证）从轻/免除处罚胁从犯：被胁迫参加犯罪（不完全丧失意志自由）从轻/免除处罚身体受强制和受骗不算教唆犯：教唆他人犯罪的条件：主观上有教唆他人犯罪的故意客观上有教唆犯罪的行为可构成单独犯罪，教唆未成年人加重处罚，被教唆者没有犯罪从轻处罚 刑罚：审判机关以国家的名义，对犯罪分子实行惩罚的一种强制方法与其他强制方法区别：1是最严厉的强制方法2只对犯罪分子适用3只能由人民法院代表国家依法适用目的：与教育法，达到预防减少犯罪并最终消灭犯罪的目的方面：特别预防：预防犯罪分子本人重新犯罪一般预防：通过惩罚犯罪警戒社会的不稳定分子，防止其走上犯罪道路刑罚的体系：刑法所规定的并按一定次序排列的各种刑罚方法的总和主刑：管制，拘役，有期徒刑，无期徒刑，死刑附加刑：罚金，剥夺政治权利，没收财产主刑只能独立适用，附加刑可独立适用用也可和主刑合并适用利用职务便利或违背职务义务的犯罪，禁止执行完毕之日或假释五年内从事相关职业情节轻微免于刑罚的，予以训诫或责令悔过，由或主管部门予以行政处罚管制是犯罪分子不实行关押，但限制其一定自由，依法实行社区矫正的一种刑罚（罪行较轻，不需要关押）可根据情况同时禁止从事特定活动进入特定场所管制和缓刑的犯罪分子在执行期间禁止进入：1娱乐场所2未经执行机关批准，禁止进入大型群众性活动场所3中小学，幼儿园区和周边，因居住就学等原因经批准的除外4确有必要禁止进入的场所管制期限：3月以上2年以下，判决执行日起算数罪并罚时最高不超过三年，判决前先行羁押的羁押一日抵刑期两日期间未经执行机关批准不准行使言论出版集会结社游行示威自由权利，按规定报告活动情况，执行关于会客规定，离开居住市县或迁居报经执行部门批准劳动中同工同酬拘役：对犯罪分子短期剥夺人身自由的一种刑罚一个月以上6个月以下，数罪并罚不超过一年，判决执行日起算，羁押一日抵刑期一日，公安机关就禁止性，每月可回家1-2天，劳动酌量发给报酬有期徒刑：一定期限内将犯罪分子加以监禁，剥夺其人身自由并实行劳动改造的一种刑罚刑期：6月以上15年以下，死缓减为有期或数罪并罚可达到25年，判决执行日起算，羁押一日抵刑期一日无期徒刑：剥夺犯罪分子终身自由，对其实行强制劳动改造的一种刑罚有悔改或立功表现，执行一定时期后可依法得到减刑或者假释死刑：剥夺犯罪分子生命的刑罚审判时不满18周岁和怀孕妇女不适用，已满75周岁不适用，残忍手段致死除外（最高人民法院判决外需报请其批准）死缓：对应当判处死刑的犯罪分子，如果不是必须立即执行的，可以判处死刑同时宣告缓期2年执行，死缓期间没有故意犯罪，2年期满后减为无期徒刑有重大立功表现，2年期满减为25年有期 罚金：强制犯罪分子或者犯罪单位向国家缴纳一定数额金钱的一种刑罚单独适用只限于罪行较轻，刑法规定可单独处罚金的犯罪一次或分期，期满不缴纳的，强制缴纳，无法全部缴纳的，应当随时追缴，确有困难可延期，酌情减少或免除 剥夺政治权利：剥夺犯罪分子参加国家管理和政治活动权利的一种刑罚指剥夺下列权利：1选举和被选举权2言论出版集会结社游行示威自由3担任国家机关职务4担任国有公司企业事业单位和人民团体领导职务单独或有期拘役附加：1年以上5年以下管制：和管制期限相等死刑，无期：终身死缓/无期减为有期：3年以上10年以下有期徒刑，拘役执行完毕/假释之日起算 没收财产：将犯罪分子个人所有的财产的一部分或者全部无偿地收归国有的一种刑罚没收全部的对其个人及其抚养家属保留必须生活费用，以前所负正当债务经债权人请求偿还驱逐出境：强迫犯罪的外国人离开中国国境的刑罚（刑罚） 量刑：人民法院依法对犯罪分子裁量应当判处的刑罚查明犯罪事实，以法律为准绳量刑的情节：人民法院在量刑是拘役决定处刑轻重或免除刑罚的各种情况分类：法定情节：法律明文固定在量刑时必须考虑的情节，包括从重从轻（法定刑的限度内，适用较轻重的刑罚）减轻（判处低于法定刑的刑罚）和免除处罚（宣布有罪但免除刑罚）等情节酌定情节：人民法院在量刑时根据不同案情斟酌予以考虑的情节（动机手段时间地点损害结果对象，一贯表现，犯罪后态度）不存在法定减轻刑罚情节经最高人民法院核准可在法定刑下判处刑罚 累犯：犯罪受过一定刑罚处罚，在刑罚执行完毕或者赦免后，法定期限内又犯一定之罪的犯罪分子分类：一般累犯：判处有期徒刑以上刑罚，执行完毕或赦免后，5年内再犯应当判处有期徒刑以上刑罚之罪的犯罪分子特别累犯：犯了危害国家安全罪，恐怖活动罪，黑社会性质组织罪，执行完毕或赦免后，任何时候再犯上述任一类罪的犯罪分子累犯从重处罚，过失犯罪和未成年人犯罪除外，不适用缓刑假释，被判处死缓的同时决定对其限制减刑 自首：犯罪分子在犯罪后自动投案，如实供述自己罪行的行为犯罪人未被捉拿（发现），并如实供述罪行被采取强制措施的犯罪嫌疑人，被告人和服刑罪犯，如实供述司法机关尚未掌握的本人其他罪行，以自首论从轻减轻触犯，罪行较轻可免除不自首如实供述也能从轻或减刑 立功：犯罪分子揭发他人犯罪行为，查证属实的，或提供其他重要线索，从而侦破其他案件，可以减轻或免除 数罪并罚：一个人犯了赎罪，人民法院对其所犯各罪分别定罪量刑后，依法决定应当执行的刑罚除判处死刑和无期外，在总和刑期以下，数刑最高刑期以上酌情决定刑期，管制不超过三年，拘役不超过一年，有期总和刑期不超过35年的，最高不超过20年，超过35年的，最高不超过25年（附加刑种类相同合并执行，不同的分别执行）判处有期和拘役，执行有期刑期，判处有期和管制，拘役和管制，有期或拘役执行完毕后管制仍需执行不适用：继续犯（较长时间内处于继续状态），想象的数罪（一个行为触犯数个罪名）惯犯（一种犯罪为常业/习惯/主要腐化生活来源）结合犯（数个独立行为按刑法结合为一个犯罪）连续犯（处于同一犯罪故意，连续式是同一性质行为并触犯同一罪名）牵连犯（（一个犯罪的犯罪方法或结果触犯其他罪名）吸收犯（数个罪名不同犯罪行为，其中一个吸收了其他犯罪行为） 缓刑：1对罪刑较小的犯罪分子在一定条件下，暂缓其刑罚执行，给予一定考验期限，在此期限内如果无新罪，无漏罪，无情节严重的违法违规行为，即可不再执行原判刑罚的一种制度判处拘役/三年以下有期的犯罪分子，犯罪情节较轻，有悔罪表现，没有再犯罪的危险，宣告缓刑对所居住社区没有重大不良影响的，可以宣告缓刑（其中未成年人，怀孕妇女，满75周岁的人应当缓刑）有附加刑仍要执行（累犯首要分子不适用）拘役考验期限原刑期以上一年以下，不少于2月有期考验期限原刑期以上5年以下，不少于一年判决确定之日起算减刑：服刑期间确有悔改或者立功表现的犯罪分子，以法定程序将其原判刑罚予以适当减轻的一种制度有重大立功表现，应当减刑：1阻止他人重大犯罪活动2检举监狱内外重大犯罪活动，经查证属实的3有发明创造或重大技术革新的4日常生产生活中舍己救人的5抵御自然灾害或排除重大事故中有突出表现的6对国家和社会有重大贡献的减刑后实质执行刑期，有期管制拘役不少于原判刑期1/2，无期的不少于13年死缓的累犯，和重大犯罪被判死缓同时决定限制减刑的，缓刑期满减为无期的，不少于25年，缓刑期满依法减为25年有期的，不少于20年执行机关向中级以上人民法院提出减刑建议书，人民法院组成合议庭审理 假释：对被判处有期或无期徒刑的犯罪分子，在执行一定刑期以后，如果确有悔改表现，假释后不致再危害社会，附有条件地予以提前释放的制度被判处有期的犯罪分子，执行原判刑期1/2以上，被判无期的，实际执行13年以上，认真遵守监规，接受教育改造，确有悔改表现，没有再犯罪危险的可以假释，如有特殊情况，经最高人民法院核准可不受限制累犯与重大犯罪被判10年以上有期无期的，不得假释考验期限：有期为没有执行完毕的刑期无期为十年（假释之日起算）时效：对犯罪分子追究刑事责任的有效期限1法定最高刑不超过5年有期，经过5年2法定最高刑为5年以上不满10年有期的，10年3法定最高刑10年以上有期，经过15年4法定最高刑死刑和无期，20年20年后认为必需追诉的，报请最高人民法院核准犯罪之日起算，又连续状态的，犯罪终止之日起算检察院/公安/国家安全机关立案/人民法院受理案件后，逃避侦查和审判的，不受追诉期限限制，被害人在追诉期限内提出控告，人民法院/检察院/公安机关应当立案不予立案的，不受追诉期限限制犯罪的种类故意/过失（主观方面要件作为/不作为（犯罪行为表现形式）预备犯，未遂犯，中止犯，既遂犯（实现犯罪的程度）单独/共同（犯罪主体人数）1危害国家安全2危害公共安全3破坏社会主义市场经济秩序4侵犯公民人身权利，民主权利5侵犯财产6妨害社会管理秩序7危害国防利益8贪污贿赂9渎职10军人违反职责","link":"/cyberblog/2024/01/20/past/"},{"title":"对于何同学的何语言的吉祥物选用的建议","text":"linux的吉祥物是一只企鹅，firefox则是经典的狐狸，python如其名是蟒蛇，用在logo里的蟒蛇则是大名鼎鼎的conda 而火狐基金会资助的rust用了螃蟹当吉祥物，我也不知道为什么狐狸要资助螃蟹，rust的螃蟹我怀疑是取其安全周密的(壳)的意思go语言的logo是只可爱的地鼠，因为它挖洞很快，对编程语言来说这是个不错的寓意，或许世界上最好的编程语言php用的是大象，可能是用了盲人摸象的典故新起之秀zig用了蜥蜴当吉祥物，并且还穿着太空服，像是上世纪的动画片总之，编程语言似乎都喜欢选一个动物当吉祥物，但要我说，最佳的新起之秀还得是著名高校北邮的毕业生何同学，他发明的何语言(没有开源很可惜，但正好能卡外国脖子)，虽然看上去是c语言的方言，但实际上能做到颠覆人机关系，让电脑无视二进制运算规律直接输出人类想要的结果，就是图灵复活也得叫一声何圣，如果chatgpt团队会中文，他们看到何语言的演示画面就不会做gpt这种班门弄斧的东西了像这样先进的语言，我建议使用雪豹做吉祥物，因为另一个新青年的代表丁真珍珠先生曾经说过:“知识学爆，有时间就要学习”，因此雪豹不仅有何同学知识丰富，水平高超的寓意，也能体现环保主义精神，维护民族团结在联合国发布何语言的演讲稿我也帮忙想好了“二进制世界不仅属于我，也属于我的动物朋友们，这是何语言，这是python，这是rust……”","link":"/cyberblog/2024/01/20/helang/"},{"title":"hollow hope","text":"或许是格林唱给自己的歌，谁知道呢 Why am i still believing?無駄ながだ来だ为什么我仍在坚信?明明这毫无意义闇を描けても行き先のないstory受困于一片黑暗没有出路的故事割れかけた希望を抱えてどうすん だよ怀抱着破碎的希望,无所适从自分にこんやもあざ割られる让自身也支离破碎 All i am holding on to memories 溺れている紧握着仅剩的过往，溺毙在回忆中Bring me back to how things used to be before i lost it all祈求让我回到从前,就在我失去一切之前一方ずつに自分をなくしてきた 一步一步失去自我don’t tell me to try again别让我重头再来when I know there’s nothing left因为我早已知晓那里空无一物時間わ傷を癒という想要让时间抚平伤痛but it never gets better但它从未好转it’s time to stop the pain已经是时候埋葬伤痛I’ve lost myself I’m out of luck我迷失了自我,命数已尽don’t waste your time on me所以别在我身上浪费时间ひとりで落ちるよ我会一个人坠落So don’t remember me所以别记住我All i am holding on to memories紧握着仅剩的过往，溺毙在回忆中Bring me back to how things used to be before i lost it all祈求让我回到从前,就在我失去一切之前一方ずつに自分をなくしてきた 一步一步失去自我don’t tell me to try again别让我重头再来when I know there’s nothing left因为我早已知晓那里空无一物I know there’s nothing left早已知晓那里所剩无物the world has turned its back on me这个世界已对我关上了门won’t leave behind the memory不会留下任何回忆頑張ってきたけど何も変わらない我淌血奋战,但什么都没改变All i am holding on to memories溺れている紧握着仅剩的过往，溺毙在回忆中Bring me back to how things used to be before i lost it all祈求让我回到从前,就在我失去一切之前一方ずつに自分をなくしてきた 一步一步失去自我don’t tell me to try again别让我重头再来when I know there’s nothing left因为我早已知晓那里空无一物","link":"/cyberblog/2024/01/20/hollow%20hope/"},{"title":"如何评价曹丰泽演讲稿《去非洲：中国青年工程师的“发展主义”选择》？","text":"有的人天生就是上梁山杀人放火的料，有的人不到完全没有希望绝不会和梁山有瓜葛，有的人首鼠两端，想要一杆秤分金银又不想把脑袋别裤腰带上，但不论如何，他们是都得上梁山的，宋江会跟你说梁山有多好，林冲会跟你说他不过是没得选，但梁山到底是什么，不知道，因为他是个纯粹的混沌系统，波动性太强了，所以梁山是好是坏，主要取决于你信不信命运 原文： 我其实一直非常相信一个道理，就是上帝往往会回报那些不对自己的人生做太多精算的人。不是说不思考，思考肯定要思考，而是说不要精算，别算得那么精细。为什么这么说呢，因为人类社会它是一个二阶混沌系统，它是不可预测的，不仅不可预测，还会根据人主观意志的扰动而急剧变化，你的所有精密的算计都必然是一场空。你以为自己进入了一个热门的好行业，结果不出五年它饱和了，大规模裁员了。你以为你拿到了一个铁饭碗，结果没几年它亏空了，这都是历史上发生过无数次的很正常的事情。很多人算计来算计去，都聪明惨了，最后反被聪明误。要我说你还不如不算计，与其整天在这想如何过好这一生，不如想想怎么好好过这一生。 一个战士，在他决斗之前，他也会向上帝祈祷，祈求上帝赐予他勇气与决断，但他从来不会祈求胜利本身。在我看来，祈求胜利本身是一种懦夫的行为，因为这意味着你缺乏足够的好奇心来面对属于你自己的未知。但你不觉得这种未知本身就很吸引人吗？你不知道你的未来将向何处去，你也不知道你将以什么样的角色来面对这些未知，这本身难道不就是生活的意义吗？作为一个青年人，我认为有一个道理是不言自明的，那就是在你为你人生的意义负责之前，你要先为自己人生的意思负责。过一个没有意义的人生还没那么可怕，但要是过一个没有意思的人生那可真的太恐怖了吧。 最后，我把一段我特别喜欢的话跟大家分享，大家很可能听过这段话，来自罗伯特·海因莱因的《时间足够你爱》：一个男人，应该能够换尿布，策划战争，杀猪，开船，设计房子，写十四行诗，结算账户，砌墙，接脱臼的骨头，安慰濒死的人，服从命令，发布命令，携手合作，独立行动，解数学方程，分析新问题，铲粪，电脑编程，做出可口的饭，善打架，勇敢地死去。只有昆虫才专业化。 祝愿所有的青年朋友们，愿上帝赐予你勇气与决断，让你能够如旁观者一般，平静地看着命运的车轮究竟会将你载向何方。 顺便一提，关于曹大佐的想法，对他来说做题可能是明日黄花，但对我来说学习(不完全等于做题，事实上重合不大)切实是一种快乐的事情，我认为如果做一件事不能让你在下次做相同的事的时候更容易一点，那么这种事就是纯苦力活，苦力活不是不能做，但哪怕有一点点上进心的话，还是少做的好。土木说实话，基本就是这种苦力活，我不知道清北的博士去是不是能做点创造性工作，但我肯定欣赏不来，不敢赌，也没资格做这种事。","link":"/cyberblog/2024/01/20/%E4%B8%8A%E9%9D%9E%E6%B4%B2/"},{"title":"知识的诅咒","text":"知识给我了精算未来的能力，通过一台再便宜不过的笔记本电脑，我可以操纵上百万条数据，敲几行代码，详细分析他们的性质，趋势，预测未来的数据变化，但有什么用呢，什么也无法改变，知识让我能看到未来，但不会让我能改变它，很多时候不用精算，或者什么数据科学我都知道未来是什么样的，但我什么都做不了。 有时候我看着没有知识的人发笑，但到头来我们结果上没什么区别。 我最早记事的时间是在小学一年级，之所以是这个时间，是因为当时我的家庭状态不好，父亲失业了，家里矛盾不断，我可能是维系家庭关系的最后一根稻草，可能因为这个，也可能是我母亲的职业病使然（中学教师），她对我寄予了厚望，意思就是，一旦我考不好就得挨打骂。这对江苏的儿童来说可能是人生的第一课，是分数决定了你的家庭地位，人格尊严，以及能否有一个“幸福”的童年，但不管怎么说，当时的我是真的和高分无缘，我倒不是没有努力过，但如果结果是唯一的导向，努力也未必有什么用，这可能导致我初步形成了内向的性格。应该是二年级后，我转学了，在那之后我得到了更好的教育条件，也可能是基因发挥了作用，反正我的成绩逐渐好了起来，家庭状况也有所好转，这时的我大概有一个美满的家庭，但在我心中总有一种恐惧，因为我并没有比一年级时更努力多少，如今的改变只不过是命运对我偶尔的垂青而已。 之后是初中，为了让我有进一步的教育条件，我妈交换去了市里一家不错的初中，把我带过去当了借读生，这时我已经习惯了把分数视为一个人的一切，因为去了做题家聚集如云的地方，我颇有些落差，更何况我妈这时能无缝地监视我的状态，一点风吹草动她也能知道，这导致初中成了我最拘谨的一段时间，校长跟我说借读生应该更努力，这让我担心是不是成绩不好就要被赶出去，我妈又经常拿她为我的付出责怪我不好好读书，情绪激动时还免不了打骂，最让我痛苦的还是这一切都是结果导向，意思是我用没用功自己说了不算，分数才算。我开始沉迷电子游戏，但也没什么意义，这只是一种逃避而已，生在江苏，你不得不面对自己的命运。这时我养成了喜忧都不报的习惯，原因很简单，考得好没有任何奖励，考得不好却要挨一顿打骂，傻子才报，但我妈偏偏觉得奇怪，可能她也被江苏同化了，认为做题家只是一群在做题以外没有常识的傻子。高中时，压力就更进一步了，有时候我会担心我妈的精神状态是不是魔怔了，其中的代表性事例是一次我妈得知了我的语文成绩是全班倒数后，对我大上嘴脸，随后我的数学成绩出来了，全班第一，这时又像春风一样和蔼。其实这种态度让我很痛苦，似乎我只是分数的附庸，其实每次考试我都是倾尽全力的，好或不好都和我的学习态度没什么关系。或许在这时我有些醒悟了，其实能不能学有所获不重要，分数才是一切，当然这时才有点醒悟着实晚了，但奈何我不过是个视野闭塞的做题家，所以能领悟到这点应该也算个成就了。08方案对我这种理科偏科生来说其实是一种负面效果，但这就是命运，所以你也只能释然，高考完后无论是我还是家里都感到了解脱，日后我才知道，家里是真解脱了，我只是假的。父母给我买了台游戏本，他们的爽快其实颇让我诧异，因为我在很长的时间里认为他们是洪水猛兽，但或许，他们也不过是被应试教育异化的本性不坏的人，当然也有可能是他们的大学就是玩过来了，所以觉得大学玩玩也无所谓。我其实没有恨过父母，在我看来这是一种制度性的悲剧，知识一点也不重要，分数决定一切，这很离谱，但所有人都是这样想这样做的，在江苏这只是一种任务，一种天赋人权，并且只是为了分数，而不是像衡水一样精神都要异化，在他们看来只是为我好，但我不这么想，因为我很有可能不是读书的料，他们能这么后见之明只是因为我确实有些做题的天赋，如果我没有这种天赋，一切就都不一样了，毕竟这种世态炎凉我在没考好的时候就见过很多次了。但非常可惜的是，分数，即使在重视分数高于一切的中国，也不是全部，归根到底，工作的时候是需要真正的知识的，如果没有知识，也得有所谓的“情商”，虽然由于中国有技术含量的工种不多，导致很多父母辈意识不到这点，这就是我大学悲剧的根源。我不能昧着良心说应试教育毫无优点，事实上在数理上我觉得问题不算很大，这可能是我数理天赋的私心，但无论在哪里1+1都等于2，这对我是一个巨大的慰藉，应试教育至少让我接触到了数学的美，虽然不是以最好的方式。我不会说我喜欢理科是非功利的，但理科给我了一些匮乏的自信，这确实是一种救赎，而文科的应试化，不仅无聊透顶，还用歧视的眼光扫视着没有天赋的我，我没有彻底的自卑人格只能说多亏了数学拉了我一把。但正如我说的，中国的教育从来不重视知识的部分，事实上，大学里连应试都不太重视了，如果你选错了专业，那么做题无用，数理也没什么用，你几乎已经注定是个废人了（讽刺的是，我埋身于文山卷海中那么多年，才能进到大学的门槛）但我曾经领略过数学的美好，这让我的心中残存着一丝对知识的向往，可能因此，我勉强脱身了出来。我一直在想，如果说应试的天赋给我了一个说得过去的学历，那么学习知识的天赋给了我什么，或许就是落到泥潭里也想要挣脱的动力吧，知识是难得真正美好的东西，即使埋在试卷海中也能微微发光，被有心之人注意到。为了做题我牺牲了大部分的娱乐，但至少也得到了真正学习的入场券，这是一条无比曲折的路程，但我只能这么走。回头看去我的人生真是一团糟，但说实话，我真不知道有什么办法可以做得更好，我不能违抗父母，也很难对抗体制，我有的最多也不过是内心的小世界，所以以我的天赋和能力，我只能说自己尽力了，不管怎么说，至少我现在能真正地学一些知识，因此我可以可怜我的父母以及江苏的所有“教育家”，他们只知道应试，不知道知识，并把应试作为了全部，可怜我的同学，他们连什么是有用的都不知道了，陷入了谈玄的幻想，可怜我院里的教师，大脑只有一团浆糊式的玄学，却还要自以为清醒。他们都不知道，1+1永远等于2是多么伟大的事情。我知道与此同时他们也在嘲笑我，但我也不会在乎了。我不是不想同流合污，但这对我来说太难了，这不能怪我，态度如何都做不到的事怎么也不能算我的问题。 Never thought I could become this strong in my whole life能变得如此坚强是我今生都未曾想过的Crowd going back and forth人们麻木的徘徊着They would take you somewhere试图将你也拉入So you have to stand strong所以你必须坚定信念And never let ‘em take you to places you don’t want不要让他们把你带到你不想去的地方I won’t let somebody else我才不用其他人Tell me that I am wrong告诉我：我错了And I’m not listening when they say that I’m messed up并且我承受得住其他人的诋毁I’m okay even when I’m lost即使我迷失方向也没什么Becasue I have faith因为我有着信念Don’t need somebody to take my hand and lead me through不需要别人的帮助来走出困境Get back what you lost a long ago找回你曾经拥有过的东西吧Never let it go when you have your dreams in your hands不要再让梦想从你的指尖溜走了Get back what you lost a long ago找回你曾经拥有过的东西吧‘cause if you let go, it’s gone你若置之不理的话它就会消失的So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall毫无畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下So you know that she wanted to keep you in her cage你知道她想让你待在她的笼子里And you know they always wanted you on their side你也知道他们一直想让你跟从他们He just had to have everything in his hands有人只是不得不将一切掌控在手中All inside the swirling mind在其混乱的头脑里Get back what you lost a long ago找回你曾经拥有过的东西吧Something that made your life amazing and beautiful让你的生活惊奇又美丽的东西Get back what you lost a long ago找回你曾经拥有过的东西吧‘Cause it’s still there in your heart因为它仍然在你的心中啊So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall毫无畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我So now I stand alone所以现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall无所畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步","link":"/cyberblog/2024/01/20/%E7%9F%A5%E8%AF%86%E7%9A%84%E8%AF%85%E5%92%92/"},{"title":"Timeless Dissonance","text":"红心女王献给卡罗尔的歌My woes flowing as rivers, unendingly我的悲伤如同河流，无尽流淌 Winter’s cold embrace wraps around me凛冬之寒在我身旁，拥抱环绕 Lifeless, your words echo in my head你不含生气的言语回响脑海 I see I have written my own demise我知道我早已逃脱不了自身的终结 Can I take back the words that I’ve said to you?我还能收回对你倾诉的爱意吗 Can we forget the curses I’ve made?我还能遗忘我经历的苦痛吗 Summer’s heat burns the strings of reality盛夏之炎燃尽现实的丝线 I grasp at nothing but empty air我伸出双手却什么也无法触及 Please don’t leave me alone请不要留我孤单一人 Please don’t die on your own请不要独自离开此世 Please kill me here now请赐我长眠于此时此刻 Blood stained, I fall, fall鲜血褪去色彩，我不断陨落、陨落…… Seasons pass, a never ending story yet时光流逝，但故事永无终结 Your words refuse to fade from my mind你的话语无法从我的脑海中淡去 How could a demon ever find peace in here?亡魂可曾于此找寻到安宁 How could a saint ever give you freedom?神明又何以赐你自由之身 Lies, spilling out, ahh…啊，谎言泛滥成灾 Repeating, repeating the same curse of yesterday重复，重复着与昨日相同的诅咒 Cowering from the world outside蜷缩身体与世隔绝 Cursed, the tide flows on遗恨，波涛四起 Blessed, the tide flows on祈祷，浪潮肆溢 Please don’t leave me请你不要让我 Please don’t leave me alone不要让我孤身一人 Seasons pass, the tide ebbs and flows时间流逝，轮回不休 Yet this curse is constant然而这诅咒却是永恒 When will this end? Only God knows终结到来之日，只有神明知晓 Morning will come again明日故事照常上演","link":"/cyberblog/2024/01/20/Timeless%20Dissonance/"},{"title":"Redeemer","text":"个人对歌词的润色，希望能体现出格林和爱丽丝01的苦情剧Falling through the hourglass 时漏之沙 细细落下 Time is up for me at last 最后于我 时限已尽 Though you’re here our fate is clear 虽然你已在此 但我们命运已明： That we were just not meant to be 我们 并非命中注定 If I could turn back time to save you I would 若我 能回溯时光去拯救 I promised I’d always be right next to you 我将许诺 永不与你分离 But it’s too late, instead I’ll come find you 可恨时限已至 你已难觅其踪 Extinguish me now so I’ll be beside you 现在让我自绝 就能永远与你相依 I promised I know to never let go 早已立誓 自己绝不放手 The pain is too much and I’m losing control 痛苦万分 情绪失控 I close my eyes and whisper goodbye 缓闭双目 轻言永别 The world I once loved is falling apart 曾深爱着的世界訇然崩塌 Don’t leave me I’m pleading on the inside I’m bleeding 我的心正滴着血 乞求着你不要离开 I’ve stopped believing my life-force depleting 我已不会相信 自己维生的力量正在枯竭 Take me with you to the other side 带我和你去到彼岸 When it’s all over I’ll wait here forever for you 当一切终结 我会在此为你永远守望 May our paths cross once again 愿我们生命的航路可以再有交集 Follow me through the dead end 和我穿越绝境 Hand in hand eternally 永远十指相扣 With you resting right beside me 与你一起入眠 Approaching the darkness I’m closer to you 接近黑暗 我才能追寻到你 There’s no turning back now I’ll be with you soon 早已无路可退 我将与你同在 Our last recourse the final solution 这便是我们最后的依靠 最终的解脱 Without you here I’m but half a person 若没有你的相伴 我的存在都已残缺 I promised I know to never let go 早已立誓 自己绝不放手 The pain is too much and I’m losing control 无限的苦痛让我歇斯底里 I close my eyes and whisper goodbye 缓闭双眼 轻道永别 The world I once loved is falling apart 挚爱过的世界就此分崩离析 Don’t leave me I’m pleading on the inside I’m bleeding 我的心正滴着血 乞求着你不要离开 I’ve stopped believing my life-force depleting 我已不会相信 自己维生的力量正在枯竭 Take me with you to the other side 带我和你去到彼岸 When it’s all over I’ll wait here forever for you 当一切终结 我会在此为你永远守望 I promised I know to never let go 我早就发过誓 我清楚自己不会放手 The pain is too much and I’m losing control 痛苦万分 情绪失控 I close my eyes and whisper goodbye 闭上双眼 轻言再见 The world I once loved is falling apart 曾热爱过的尘世开始坠毁分裂 Stay with me I’m pleading ‘till my heart stops beating 恳求你伴我身旁 直到我生命终结 The end is near and I’m disappearing 结局逐渐临近 我的存在开始消失 Following you across the divide 跟你一起 跨过梦境与现实的分界 When it’s all over I’ll be here forever with you 当一切终结 我会在此为你孤守三生","link":"/cyberblog/2024/01/20/Redeemer/"},{"title":"forget me","text":"如今的红女王献给格林的歌 待ち望んだ 夢にも描いたこの日期待已久的梦想之日 そのハズが あっさりに 悪夢の鸟笼に却轻飘飘地成了噩梦的囚牢 き戻せると 言い聞かせても即使一遍遍告诉自己可以重来 自分の首占めて到头来还是被自己所困 もう域が已经无处可逃 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same早已厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再铭记我 目がクラムほど 間違った世界我所看见的世界错漏百出 した自分も どこにも嫌しない我期待的自己无处安放 Repeat the words, I’ll be okay, I’ll be fine 重复着自我安慰的话语 It’s easier believing my own lies轻易地陷入自己编制的谎言 巻き戻せると 泣き叫んでも即使哭喊着让时光倒流 あなたを傷つけるだけ我只会继续伤害你 もうできない我已穷途末路 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me 只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same早已厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再记得我 When the reason I once believed当我曾坚信不疑的意义 Was taken from me被夺走之时 むりな ゆめを しなせて我的梦 终究只会破灭 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same终究厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再铭记我","link":"/cyberblog/2024/01/20/forget%20me/"},{"title":"我与晓r","text":"第一次接触车万应该是在高二，偶尔听到了一首碎月的钢琴曲惊为天人，然后顺路发现了幽闭星光这种编曲很成熟的社团，所以车万曲在我心中形成了优雅抒情的印象。不久后的一天，我在车万网易云999+的一个歌单里随机到了晓r的两人结晶，听前奏感觉实在太过激昂与我的印象冲突，但确实很好听，人声出来时吓了我一跳，怎么会有声线这么特别的歌姬，当即退了出去，但过了几秒，我感觉如此编曲实在不容错过，于是我认真听了一遍。想来那应该是喜欢上晓r的开始，在那之后听了阳炎，deep breath等等名曲，越听越喜欢，晓r多样的编曲，stack强大的唱功和独特的声线，甚至很有风格的歌词都让我印象深刻，陪我走过了高中，尤其是高三那段艰难的时光如果让现在的我评价晓r，那我会除了会说编曲，唱功之类的老几样之外，还有一点是最让我印象深刻的，晓r主要风格是摇滚，有时候也会有一些pop一点的曲风，还有各种电波曲，但始终做的是东方，至今已经走过11年了，在我看来水平没有特别大的下降，基本上有点人气的原曲都做过一次了，这是何等的热爱和坚持，十周年时晓r还出了原创专辑，讲的是作为作为年轻一代对自己世代的看法，积极向上的歌词让我颇为感动，在晓r身上我感受到一种持续不断的激情和活力，这种热情感染了我很多。可以说，晓r见证了我的青春，只要晓r还在，我就会一直陪她走下去。","link":"/cyberblog/2024/01/20/%E6%99%93r/"}],"tags":[{"name":"歌词翻译","slug":"歌词翻译","link":"/cyberblog/tags/%E6%AD%8C%E8%AF%8D%E7%BF%BB%E8%AF%91/"},{"name":"日记","slug":"日记","link":"/cyberblog/tags/%E6%97%A5%E8%AE%B0/"},{"name":"随想","slug":"随想","link":"/cyberblog/tags/%E9%9A%8F%E6%83%B3/"},{"name":"创作","slug":"创作","link":"/cyberblog/tags/%E5%88%9B%E4%BD%9C/"},{"name":"短篇小说","slug":"短篇小说","link":"/cyberblog/tags/%E7%9F%AD%E7%AF%87%E5%B0%8F%E8%AF%B4/"}],"categories":[{"name":"歌词翻译","slug":"歌词翻译","link":"/cyberblog/categories/%E6%AD%8C%E8%AF%8D%E7%BF%BB%E8%AF%91/"},{"name":"日记","slug":"日记","link":"/cyberblog/categories/%E6%97%A5%E8%AE%B0/"},{"name":"随想","slug":"随想","link":"/cyberblog/categories/%E9%9A%8F%E6%83%B3/"},{"name":"创作","slug":"创作","link":"/cyberblog/categories/%E5%88%9B%E4%BD%9C/"},{"name":"短篇小说","slug":"短篇小说","link":"/cyberblog/categories/%E7%9F%AD%E7%AF%87%E5%B0%8F%E8%AF%B4/"}],"pages":[{"title":"archives","text":"","link":"/cyberblog/archives/index.html"},{"title":"recent_posts","text":"","link":"/cyberblog/recent-posts/index.html"},{"title":"tag","text":"","link":"/cyberblog/tag/index.html"},{"title":"categories","text":"","link":"/cyberblog/categories/index.html"}]}