{"posts":[{"title":"迪瑞克拉神龛","text":"这里是迪瑞克拉的意识深处，世界和思维的残片在这里漂浮，破碎，组合 let showed = false; var binft = function (r) { function t() { return b[Math.floor(Math.random() * b.length)] } function e() { return String.fromCharCode(94 * Math.random() + 33) } function n(r) { for (var n = document.createDocumentFragment(), i = 0; r > i; i++) { var l = document.createElement(\"span\"); l.style.fontSize = \"40px\"; l.textContent = e(), l.style.color = t(), n.appendChild(l) } return n } function i() { if(showed) { return } let fontSize = c.fontSize; r.style.fontSize = fontSize; var t = o[c.skillI]; c.step ? c.step-- : (c.step = g, c.prefixP < l.length ? (c.prefixP >= 0 && (c.text += l[c.prefixP]), c.prefixP++) : \"forward\" === c.direction ? c.skillP < t.length ? (c.text += t[c.skillP], c.skillP++) : c.delay ? c.delay-- : (c.direction = \"backward\", c.delay = a) : c.skillP > 0 ? (c.text = c.text.slice(0, -1), c.skillP--) : (c.skillI = (c.skillI + 1) % o.length, c.direction = \"forward\")), r.textContent = c.text, r.appendChild(n(c.prefixP < l.length ? Math.min(s, s + c.prefixP) : Math.min(s, t.length - c.skillP))), setTimeout(i, d) } var l = \"\", o = [\"正在骇入\", \"正在获取认证信息\",\"正在窃取超级用户权限\", \"正在破解终端\",\"正在反汇编程序\",\"登陆成功，欢迎来到迪瑞克拉\",,\"hello\"].map(function (r) { return r + \"\" }), a = 2, g = 1, s = 5, d = 75, b = [\"rgb(255,255,0)\"], c = { text: \"\", prefixP: -s, skillI: 0, skillP: 0, direction: \"forward\", delay: a, step: g, fontSize: \"40px\" }; i() }; binft(document.getElementById('binft'));","link":"/cyberblog/2023/10/02/%E8%BF%AA%E7%91%9E%E5%85%8B%E6%8B%89/"},{"title":"知识的诅咒","text":"知识给我了精算未来的能力，通过一台再便宜不过的笔记本电脑，我可以操纵上百万条数据，敲几行代码，详细分析他们的性质，趋势，预测未来的数据变化，但有什么用呢，什么也无法改变，知识让我能看到未来，但不会让我能改变它，很多时候不用精算，或者什么数据科学我都知道未来是什么样的，但我什么都做不了。 有时候我看着没有知识的人发笑，但到头来我们结果上没什么区别。 我最早记事的时间是在小学一年级，之所以是这个时间，是因为当时我的家庭状态不好，父亲失业了，家里矛盾不断，我可能是维系家庭关系的最后一根稻草，可能因为这个，也可能是我母亲的职业病使然（中学教师），她对我寄予了厚望，意思就是，一旦我考不好就得挨打骂。这对江苏的儿童来说可能是人生的第一课，是分数决定了你的家庭地位，人格尊严，以及能否有一个“幸福”的童年，但不管怎么说，当时的我是真的和高分无缘，我倒不是没有努力过，但如果结果是唯一的导向，努力也未必有什么用，这可能导致我初步形成了内向的性格。应该是二年级后，我转学了，在那之后我得到了更好的教育条件，也可能是基因发挥了作用，反正我的成绩逐渐好了起来，家庭状况也有所好转，这时的我大概有一个美满的家庭，但在我心中总有一种恐惧，因为我并没有比一年级时更努力多少，如今的改变只不过是命运对我偶尔的垂青而已。 之后是初中，为了让我有进一步的教育条件，我妈交换去了市里一家不错的初中，把我带过去当了借读生，这时我已经习惯了把分数视为一个人的一切，因为去了做题家聚集如云的地方，我颇有些落差，更何况我妈这时能无缝地监视我的状态，一点风吹草动她也能知道，这导致初中成了我最拘谨的一段时间，校长跟我说借读生应该更努力，这让我担心是不是成绩不好就要被赶出去，我妈又经常拿她为我的付出责怪我不好好读书，情绪激动时还免不了打骂，最让我痛苦的还是这一切都是结果导向，意思是我用没用功自己说了不算，分数才算。我开始沉迷电子游戏，但也没什么意义，这只是一种逃避而已，生在江苏，你不得不面对自己的命运。这时我养成了喜忧都不报的习惯，原因很简单，考得好没有任何奖励，考得不好却要挨一顿打骂，傻子才报，但我妈偏偏觉得奇怪，可能她也被江苏同化了，认为做题家只是一群在做题以外没有常识的傻子。高中时，压力就更进一步了，有时候我会担心我妈的精神状态是不是魔怔了，其中的代表性事例是一次我妈得知了我的语文成绩是全班倒数后，对我大上嘴脸，随后我的数学成绩出来了，全班第一，这时又像春风一样和蔼。其实这种态度让我很痛苦，似乎我只是分数的附庸，其实每次考试我都是倾尽全力的，好或不好都和我的学习态度没什么关系。或许在这时我有些醒悟了，其实能不能学有所获不重要，分数才是一切，当然这时才有点醒悟着实晚了，但奈何我不过是个视野闭塞的做题家，所以能领悟到这点应该也算个成就了。08方案对我这种理科偏科生来说其实是一种负面效果，但这就是命运，所以你也只能释然，高考完后无论是我还是家里都感到了解脱，日后我才知道，家里是真解脱了，我只是假的。父母给我买了台游戏本，他们的爽快其实颇让我诧异，因为我在很长的时间里认为他们是洪水猛兽，但或许，他们也不过是被应试教育异化的本性不坏的人，当然也有可能是他们的大学就是玩过来了，所以觉得大学玩玩也无所谓。我其实没有恨过父母，在我看来这是一种制度性的悲剧，知识一点也不重要，分数决定一切，这很离谱，但所有人都是这样想这样做的，在江苏这只是一种任务，一种天赋人权，并且只是为了分数，而不是像衡水一样精神都要异化，在他们看来只是为我好，但我不这么想，因为我很有可能不是读书的料，他们能这么后见之明只是因为我确实有些做题的天赋，如果我没有这种天赋，一切就都不一样了，毕竟这种世态炎凉我在没考好的时候就见过很多次了。但非常可惜的是，分数，即使在重视分数高于一切的中国，也不是全部，归根到底，工作的时候是需要真正的知识的，如果没有知识，也得有所谓的“情商”，虽然由于中国有技术含量的工种不多，导致很多父母辈意识不到这点，这就是我大学悲剧的根源。我不能昧着良心说应试教育毫无优点，事实上在数理上我觉得问题不算很大，这可能是我数理天赋的私心，但无论在哪里1+1都等于2，这对我是一个巨大的慰藉，应试教育至少让我接触到了数学的美，虽然不是以最好的方式。我不会说我喜欢理科是非功利的，但理科给我了一些匮乏的自信，这确实是一种救赎，而文科的应试化，不仅无聊透顶，还用歧视的眼光扫视着没有天赋的我，我没有彻底的自卑人格只能说多亏了数学拉了我一把。但正如我说的，中国的教育从来不重视知识的部分，事实上，大学里连应试都不太重视了，如果你选错了专业，那么做题无用，数理也没什么用，你几乎已经注定是个废人了（讽刺的是，我埋身于文山卷海中那么多年，才能进到大学的门槛）但我曾经领略过数学的美好，这让我的心中残存着一丝对知识的向往，可能因此，我勉强脱身了出来。我一直在想，如果说应试的天赋给我了一个说得过去的学历，那么学习知识的天赋给了我什么，或许就是落到泥潭里也想要挣脱的动力吧，知识是难得真正美好的东西，即使埋在试卷海中也能微微发光，被有心之人注意到。为了做题我牺牲了大部分的娱乐，但至少也得到了真正学习的入场券，这是一条无比曲折的路程，但我只能这么走。回头看去我的人生真是一团糟，但说实话，我真不知道有什么办法可以做得更好，我不能违抗父母，也很难对抗体制，我有的最多也不过是内心的小世界，所以以我的天赋和能力，我只能说自己尽力了，不管怎么说，至少我现在能真正地学一些知识，因此我可以可怜我的父母以及江苏的所有“教育家”，他们只知道应试，不知道知识，并把应试作为了全部，可怜我的同学，他们连什么是有用的都不知道了，陷入了谈玄的幻想，可怜我院里的教师，大脑只有一团浆糊式的玄学，却还要自以为清醒。他们都不知道，1+1永远等于2是多么伟大的事情。我知道与此同时他们也在嘲笑我，但我也不会在乎了。我不是不想同流合污，但这对我来说太难了，这不能怪我，态度如何都做不到的事怎么也不能算我的问题。 Never thought I could become this strong in my whole life能变得如此坚强是我今生都未曾想过的Crowd going back and forth人们麻木的徘徊着They would take you somewhere试图将你也拉入So you have to stand strong所以你必须坚定信念And never let ‘em take you to places you don’t want不要让他们把你带到你不想去的地方I won’t let somebody else我才不用其他人Tell me that I am wrong告诉我：我错了And I’m not listening when they say that I’m messed up并且我承受得住其他人的诋毁I’m okay even when I’m lost即使我迷失方向也没什么Becasue I have faith因为我有着信念Don’t need somebody to take my hand and lead me through不需要别人的帮助来走出困境Get back what you lost a long ago找回你曾经拥有过的东西吧Never let it go when you have your dreams in your hands不要再让梦想从你的指尖溜走了Get back what you lost a long ago找回你曾经拥有过的东西吧‘cause if you let go, it’s gone你若置之不理的话它就会消失的So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall毫无畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下So you know that she wanted to keep you in her cage你知道她想让你待在她的笼子里And you know they always wanted you on their side你也知道他们一直想让你跟从他们He just had to have everything in his hands有人只是不得不将一切掌控在手中All inside the swirling mind在其混乱的头脑里Get back what you lost a long ago找回你曾经拥有过的东西吧Something that made your life amazing and beautiful让你的生活惊奇又美丽的东西Get back what you lost a long ago找回你曾经拥有过的东西吧‘Cause it’s still there in your heart因为它仍然在你的心中啊So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall毫无畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步So now I stand alone现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我So now I stand alone所以现在我独自一人Standing tall昂首挺胸No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me没有人阻止我Because I stand alone因为我独自一人Standing tall无所畏惧No matter how strong无论多么猛烈的the wind and rain is in my way and never going away风和雨在路上阻挡我，我也不会放弃Alive and I’m free as I can be我能够自由的活着Nobody stop me as I go my way在我的路上没有人能使我停下Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步Don’t tell me to live your way, No别让我以你的方式生活，我拒绝Don’t tell me to follow you别让我跟随你的脚步","link":"/cyberblog/2023/10/18/%E7%9F%A5%E8%AF%86%E7%9A%84%E8%AF%85%E5%92%92/"},{"title":"如何评价曹丰泽演讲稿《去非洲：中国青年工程师的“发展主义”选择》？","text":"有的人天生就是上梁山杀人放火的料，有的人不到完全没有希望绝不会和梁山有瓜葛，有的人首鼠两端，想要一杆秤分金银又不想把脑袋别裤腰带上，但不论如何，他们是都得上梁山的，宋江会跟你说梁山有多好，林冲会跟你说他不过是没得选，但梁山到底是什么，不知道，因为他是个纯粹的混沌系统，波动性太强了，所以梁山是好是坏，主要取决于你信不信命运 原文： 我其实一直非常相信一个道理，就是上帝往往会回报那些不对自己的人生做太多精算的人。不是说不思考，思考肯定要思考，而是说不要精算，别算得那么精细。为什么这么说呢，因为人类社会它是一个二阶混沌系统，它是不可预测的，不仅不可预测，还会根据人主观意志的扰动而急剧变化，你的所有精密的算计都必然是一场空。你以为自己进入了一个热门的好行业，结果不出五年它饱和了，大规模裁员了。你以为你拿到了一个铁饭碗，结果没几年它亏空了，这都是历史上发生过无数次的很正常的事情。很多人算计来算计去，都聪明惨了，最后反被聪明误。要我说你还不如不算计，与其整天在这想如何过好这一生，不如想想怎么好好过这一生。 一个战士，在他决斗之前，他也会向上帝祈祷，祈求上帝赐予他勇气与决断，但他从来不会祈求胜利本身。在我看来，祈求胜利本身是一种懦夫的行为，因为这意味着你缺乏足够的好奇心来面对属于你自己的未知。但你不觉得这种未知本身就很吸引人吗？你不知道你的未来将向何处去，你也不知道你将以什么样的角色来面对这些未知，这本身难道不就是生活的意义吗？作为一个青年人，我认为有一个道理是不言自明的，那就是在你为你人生的意义负责之前，你要先为自己人生的意思负责。过一个没有意义的人生还没那么可怕，但要是过一个没有意思的人生那可真的太恐怖了吧。 最后，我把一段我特别喜欢的话跟大家分享，大家很可能听过这段话，来自罗伯特·海因莱因的《时间足够你爱》：一个男人，应该能够换尿布，策划战争，杀猪，开船，设计房子，写十四行诗，结算账户，砌墙，接脱臼的骨头，安慰濒死的人，服从命令，发布命令，携手合作，独立行动，解数学方程，分析新问题，铲粪，电脑编程，做出可口的饭，善打架，勇敢地死去。只有昆虫才专业化。 祝愿所有的青年朋友们，愿上帝赐予你勇气与决断，让你能够如旁观者一般，平静地看着命运的车轮究竟会将你载向何方。 顺便一提，关于曹大佐的想法，对他来说做题可能是明日黄花，但对我来说学习(不完全等于做题，事实上重合不大)切实是一种快乐的事情，我认为如果做一件事不能让你在下次做相同的事的时候更容易一点，那么这种事就是纯苦力活，苦力活不是不能做，但哪怕有一点点上进心的话，还是少做的好。土木说实话，基本就是这种苦力活，我不知道清北的博士去是不是能做点创造性工作，但我肯定欣赏不来，不敢赌，也没资格做这种事。","link":"/cyberblog/2023/10/12/%E4%B8%8A%E9%9D%9E%E6%B4%B2/"},{"title":"hollow hope","text":"或许是格林唱给自己的歌，谁知道呢Why am i still believing? 为什么我仍在坚信?This is meaningless 明明这毫无意义Even depicting the darkness, 一片黑暗,the story has nowhere to go 受困于没有出路的故事 Holding the shattered hope, 抱着破碎的希望,what should I do 我该去往何方I’m still hurting myself 总是自怨自怜I’m clinging to memories, drowning 紧握着过往，溺毙在回忆中Bring me back to how things used to be before I lost it all 请带我回到从前,就在我失去一切之前I’ve been losing myself little by little 一步一步失去自我Don’t tell me to try again 别让我重头再来When I know there’s nothing left 因为我早已知晓那里空无一物Time wants to smooth the wound 想要让时间抚平伤痛But it never gets better 但它从未好转It’s time to stop the pain 已经是时候埋葬伤痛I’ve lost myself I’m out of luck 我迷失了自我,命数已尽Don’t waste your time on me 所以别在我身上浪费时间I will fall alone 我会一个人坠落So don’t remember me 所以别记住我I’m clinging to memories, drowning 紧握着过往，溺毙在回忆中Bring me back to how things used to be before I lost it all 请带我回到从前,就在我失去一切之前 I’ve been losing myself little by little 一步一步失去自我Don’t tell me to try again 别告诉我重头再来When I know there’s nothing left 因为我早已知晓那里空无一物I know there’s nothing left 早已知道那里所剩无物The world has turned its back on me 这个世界已对我关上了门Won’t leave behind a memory 不会留下任何记忆I’ve tried hard, but nothing has changed 我已经努力过,但什么都没改变I’m clinging to memories, drowning 紧握着过往，溺毙在回忆中Bring me back to how things used to be before I lost it all 请带我回到从前,就在我失去一切之前I’ve been losing myself little by little一步一步失去自我Don’t tell me to try again 别让我重头再来When I know there’s nothing left 因为我早已知晓那里空无一物","link":"/cyberblog/2023/10/12/hollow%20hope/"},{"title":"Timeless Dissonance","text":"红心女王献给卡罗尔的歌My woes flowing as rivers, unendingly我的悲伤如同河流，无尽流淌 Winter’s cold embrace wraps around me凛冬之寒在我身旁，拥抱环绕 Lifeless, your words echo in my head你不含生气的言语回响脑海 I see I have written my own demise我知道我早已逃脱不了自身的终结 Can I take back the words that I’ve said to you?我还能收回对你倾诉的爱意吗 Can we forget the curses I’ve made?我还能遗忘我经历的苦痛吗 Summer’s heat burns the strings of reality盛夏之炎燃尽现实的丝线 I grasp at nothing but empty air我伸出双手却什么也无法触及 Please don’t leave me alone请不要留我孤单一人 Please don’t die on your own请不要独自离开此世 Please kill me here now请赐我长眠于此时此刻 Blood stained, I fall, fall鲜血褪去色彩，我不断陨落、陨落…… Seasons pass, a never ending story yet时光流逝，但故事永无终结 Your words refuse to fade from my mind你的话语无法从我的脑海中淡去 How could a demon ever find peace in here?亡魂可曾于此找寻到安宁 How could a saint ever give you freedom?神明又何以赐你自由之身 Lies, spilling out, ahh…啊，谎言泛滥成灾 Repeating, repeating the same curse of yesterday重复，重复着与昨日相同的诅咒 Cowering from the world outside蜷缩身体与世隔绝 Cursed, the tide flows on遗恨，波涛四起 Blessed, the tide flows on祈祷，浪潮肆溢 Please don’t leave me请你不要让我 Please don’t leave me alone不要让我孤身一人 Seasons pass, the tide ebbs and flows时间流逝，轮回不休 Yet this curse is constant然而这诅咒却是永恒 When will this end? Only God knows终结到来之日，只有神明知晓 Morning will come again明日故事照常上演","link":"/cyberblog/2023/10/07/Timeless%20Dissonance/"},{"title":"Redeemer","text":"个人对歌词的润色，希望能体现出格林和爱丽丝01的苦情剧Falling through the hourglass 时漏之沙 细细落下 Time is up for me at last 最后于我 时限已尽 Though you’re here our fate is clear 虽然你已在此 但我们命运已明： That we were just not meant to be 我们 并非命中注定 If I could turn back time to save you I would 若我 能回溯时光去拯救 I promised I’d always be right next to you 我将许诺 永不与你分离 But it’s too late, instead I’ll come find you 可恨时限已至 你已难觅其踪 Extinguish me now so I’ll be beside you 现在让我自绝 就能永远与你相依 I promised I know to never let go 早已立誓 自己绝不放手 The pain is too much and I’m losing control 痛苦万分 情绪失控 I close my eyes and whisper goodbye 缓闭双目 轻言永别 The world I once loved is falling apart 曾深爱着的世界訇然崩塌 Don’t leave me I’m pleading on the inside I’m bleeding 我的心正滴着血 乞求着你不要离开 I’ve stopped believing my life-force depleting 我已不会相信 自己维生的力量正在枯竭 Take me with you to the other side 带我和你去到彼岸 When it’s all over I’ll wait here forever for you 当一切终结 我会在此为你永远守望 May our paths cross once again 愿我们生命的航路可以再有交集 Follow me through the dead end 和我穿越绝境 Hand in hand eternally 永远十指相扣 With you resting right beside me 与你一起入眠 Approaching the darkness I’m closer to you 接近黑暗 我才能追寻到你 There’s no turning back now I’ll be with you soon 早已无路可退 我将与你同在 Our last recourse the final solution 这便是我们最后的依靠 最终的解脱 Without you here I’m but half a person 若没有你的相伴 我的存在都已残缺 I promised I know to never let go 早已立誓 自己绝不放手 The pain is too much and I’m losing control 无限的苦痛让我歇斯底里 I close my eyes and whisper goodbye 缓闭双眼 轻道永别 The world I once loved is falling apart 挚爱过的世界就此分崩离析 Don’t leave me I’m pleading on the inside I’m bleeding 我的心正滴着血 乞求着你不要离开 I’ve stopped believing my life-force depleting 我已不会相信 自己维生的力量正在枯竭 Take me with you to the other side 带我和你去到彼岸 When it’s all over I’ll wait here forever for you 当一切终结 我会在此为你永远守望 I promised I know to never let go 我早就发过誓 我清楚自己不会放手 The pain is too much and I’m losing control 痛苦万分 情绪失控 I close my eyes and whisper goodbye 闭上双眼 轻言再见 The world I once loved is falling apart 曾热爱过的尘世开始坠毁分裂 Stay with me I’m pleading ‘till my heart stops beating 恳求你伴我身旁 直到我生命终结 The end is near and I’m disappearing 结局逐渐临近 我的存在开始消失 Following you across the divide 跟你一起 跨过梦境与现实的分界 When it’s all over I’ll be here forever with you 当一切终结 我会在此为你孤守三生","link":"/cyberblog/2023/10/07/Redeemer/"},{"title":"forget me","text":"如今的红女王献给格林的歌 待ち望んだ 夢にも描いたこの日期待已久的梦想之日 そのハズが あっさりに 悪夢の鸟笼に却轻飘飘地成了噩梦的囚牢 き戻せると 言い聞かせても即使一遍遍告诉自己可以重来 自分の首占めて到头来还是被自己所困 もう域が已经无处可逃 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same早已厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再铭记我 目がクラムほど 間違った世界我所看见的世界错漏百出 した自分も どこにも嫌しない我期待的自己无处安放 Repeat the words, I’ll be okay, I’ll be fine 重复着自我安慰的话语 It’s easier believing my own lies轻易地陷入自己编制的谎言 巻き戻せると 泣き叫んでも即使哭喊着让时光倒流 あなたを傷つけるだけ我只会继续伤害你 もうできない我已穷途末路 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me 只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same早已厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再记得我 When the reason I once believed当我曾坚信不疑的意义 Was taken from me被夺走之时 むりな ゆめを しなせて我的梦 终究只会破灭 So I’ll throw it away, just to bury the pain所以我抛弃过往 只为埋葬伤痛 If you promise you’ll forget me只希望你发誓遗忘我的存在 Sick of starting again when it all stays the same终究厌倦重复着没有改变的故事 Promise me you won’t remember me请答应我 不要再铭记我","link":"/cyberblog/2023/10/07/forget%20me/"},{"title":"我与晓r","text":"第一次接触车万应该是在高二，偶尔听到了一首碎月的钢琴曲惊为天人，然后顺路发现了幽闭星光这种编曲很成熟的社团，所以车万曲在我心中形成了优雅抒情的印象。不久后的一天，我在车万网易云999+的一个歌单里随机到了晓r的两人结晶，听前奏感觉实在太过激昂与我的印象冲突，但确实很好听，人声出来时吓了我一跳，怎么会有声线这么特别的歌姬，当即退了出去，但过了几秒，我感觉如此编曲实在不容错过，于是我认真听了一遍。想来那应该是喜欢上晓r的开始，在那之后听了阳炎，deep breath等等名曲，越听越喜欢，晓r多样的编曲，stack强大的唱功和独特的声线，甚至很有风格的歌词都让我印象深刻，陪我走过了高中，尤其是高三那段艰难的时光如果让现在的我评价晓r，那我会除了会说编曲，唱功之类的老几样之外，还有一点是最让我印象深刻的，晓r主要风格是摇滚，有时候也会有一些pop一点的曲风，还有各种电波曲，但始终做的是东方，至今已经走过11年了，在我看来水平没有特别大的下降，基本上有点人气的原曲都做过一次了，这是何等的热爱和坚持，十周年时晓r还出了原创专辑，讲的是作为作为年轻一代对自己世代的看法，积极向上的歌词让我颇为感动，在晓r身上我感受到一种持续不断的激情和活力，这种热情感染了我很多。可以说，晓r见证了我的青春，只要晓r还在，我就会一直陪她走下去。","link":"/cyberblog/2023/10/06/%E6%99%93r/"}],"tags":[{"name":"歌词翻译","slug":"歌词翻译","link":"/cyberblog/tags/%E6%AD%8C%E8%AF%8D%E7%BF%BB%E8%AF%91/"},{"name":"日记","slug":"日记","link":"/cyberblog/tags/%E6%97%A5%E8%AE%B0/"},{"name":"随想","slug":"随想","link":"/cyberblog/tags/%E9%9A%8F%E6%83%B3/"}],"categories":[{"name":"歌词翻译","slug":"歌词翻译","link":"/cyberblog/categories/%E6%AD%8C%E8%AF%8D%E7%BF%BB%E8%AF%91/"},{"name":"日记","slug":"日记","link":"/cyberblog/categories/%E6%97%A5%E8%AE%B0/"},{"name":"随想","slug":"随想","link":"/cyberblog/categories/%E9%9A%8F%E6%83%B3/"}],"pages":[{"title":"archives","text":"","link":"/cyberblog/archives/index.html"},{"title":"categories","text":"","link":"/cyberblog/categories/index.html"},{"title":"recent_posts","text":"","link":"/cyberblog/recent-posts/index.html"},{"title":"tag","text":"","link":"/cyberblog/tag/index.html"}]}